<?

class ProductInfoClass {
    // 후공정 종류 배열
    const AFTER_ARR = array(
        "코팅"     => "coating",
        "귀도리"   => "rounding",
        "오시"     => "impression",
        "미싱"     => "dotline",
        "타공"     => "punching",
        "접지"     => "foldline",
        "엠보싱"   => "embossing",
        "박"       => "foil",
        "형압"     => "press",
        "도무송"   => "thomson",
        "넘버링"   => "numbering",
        "재단"     => "cutting",
        "제본"     => "binding",
        "접착"     => "bonding",
        "라미넥스" => "laminex"
    );

	// 카테고리별 재단, 작업사이즈 차이
	const NCR_DOTLINE_PER_PRICE = array(
		// NCR 상하
			"793" => 20,
			"794" => 40,
			"795" => 120,
			"796" => 80,
			"797" => 160,
			"798" => 40,
			"799" => 80,
			"800" => 160,
			"801" => 240,
			"802" => 320,

		// NCR 상중하
			"803" => 13,
			"804" => 27,
			"805" => 80,
			"806" => 53,
			"807" => 107,
			"808" => 27,
			"809" => 53,
			"810" => 107,
			"811" => 160,
			"812" => 213,

		// NCR 상중중하
			"813" => 10,
			"814" => 20,
			"815" => 60,
			"816" => 40,
			"817" => 80,
			"818" => 20,
			"819" => 40,
			"820" => 80,
			"821" => 120,
			"822" => 160,

		// NCR 상중하
			"823" => 20,
			"824" => 40,
			"825" => 120,
			"826" => 80,
			"827" => 160,
			"828" => 40,
			"829" => 80,
			"830" => 160,
			"831" => 240,
			"832" => 320
	);

    // 상품별 리다이렉트 페이지
/*
    const PAGE_ARR = array(
        "001001001" => "nc_normal.html",
        "001001002" => "nc_luxury.html",
		"004002001" => "ad_book.html"
    );
*/
    const PAGE_ARR = array(
        "001001001" => "nc_normal.html",
        "001001002" => "nc_normal.html",
		"001001003" => "nc_normal.html",
		"001001004" => "nc_normal.html",
		"004002001" => "nc_normal.html",
		"002001001" => "bl_normal.html",
		"002001002" => "bl_normal.html",
    );
    // 카테고리별 재단, 작업사이즈 차이
    const SIZE_GAP = array(
        "001001001" => 2,
        "004002001" => 8
    );

	//주문진행상태
	const ORDER_STATUS_ARR = array(
			'100'=>'주문완료',
			'320'=>'접수중',
			'330'=>'시안확인',
			'390'=>'접수완료',
			'400'=>'생산',
			'500'=>'배송준비중',
			'600'=>'배송완료');

	// 2.0에서 쓰이는 종이코드로 변경
	const PAPER_CODE = array(
			'스노우지 백색 100g'=>'SW/B/100',
			'스노우지 백색 120g'=>'SW/B/120',
			'스노우지 백색 150g'=>'SW/B/150',
			'스노우지 백색 180g'=>'SW/B/180',
			'스노우지 백색 200g'=>'SW/B/200',
			'스노우지 백색 250g'=>'SW/B/250',
			'스노우지 백색 300g'=>'SW/B/300',
			'아트지 백색 90g'=>'AT/B/100',
			'아트지 백색 100g'=>'AT/B/100',
			'아트지 백색 120g'=>'AT/B/120',
			'아트지 백색 150g'=>'AT/B/150',
			'아트지 백색 180g'=>'AT/B/180',
			'아트지 백색 216g'=>'AT/B/216',
			'아트지 백색 300g'=>'AT/B/300',
			'모조지 백색 70g'=>'MO/B/070',
			'모조지 - 70g' => 'MO/B070',
			'모조지 백색 80g'=>'MO/B/080',
			'모조지 - 80g'=>'MO/B/080',
			'모조지 백색 100g'=>'MO/B/100',
			'모조지 - 100g'=>'MO/B/100',
			'모조지 백색 120g'=>'MO/B/120',
			'모조지 백색 150g'=>'MO/B/150',
			'모조지 백색 180g'=>'MO/B/180',
			'모조지 백색 220g'=>'MO/B/220',
			'모조지 백색 260g'=>'MO/B/260',
			'모조지 미색 80g'=>'MO/B/080',
			'모조지 미색 100g'=>'MO/B/100',
			'휘라레 백색 216g'=>'WR/B/216',
			'반누보 미색 210g'=>'BV/M/210',
			'탄트지 - 200g'=>'TT/X/200',
			'스타드림 - 220g'=>'SD/X/220',
			'스타골드 - 200g'=>'SG/X/200',
			'키칼라메탈릭 골드 200g'=>'KG/X/200',
			'키칼라메탈릭 아이스골드 200g'=>'KI/X/200',
			'샤인스페셜 백색 200g'=>'SC/B/200',
			'컨셉블루펄 백색 250g'=>'KB/B/250',
			'팝셋 - 240g'=>'PS/X/240',
			'유포지 - 200g'=>'UP/X/200',
			'스코틀랜드 백색 220g'=>'SL/B/220',
			'그레이스 미색 209g'=>'GR/M/209',
			'빌리지 백색 200g'=>'BI/B/200',
			'머쉬멜로우 백색 209g'=>'MM/B/209',
			'베이직 백색 233g'=>'BS/B/233',
			'스타실버 - 250g'=>'HP/X/250',
			'랑데뷰 미색 240g'=>'LV/N/240'
	);

	// 2.0에서 쓰이는 카테고리코드로 변경
	const CATE_CODE = array(
			'001001001'=>'N11',
			'001001002'=>'N12',
			'001001003'=>'N13',
			'001001004'=>'N14',
			'001002016'=>'N20',
			'001003024'=>'N30',
			'002003001'=>'S20', // 특수지스티커
			'002003009'=>'S10', // 일반/강접스티커
			'002004009'=>'S30',
			'003001001'=>'B01', // 합판전단지
			'003003001'=>'B02', // 독판전단지
			'003004001'=>'B03', // 초소량인쇄
			'005001001'=>'E10',
			'005001002'=>'E10',
			'007001001'=>'M01',
			'007001002'=>'M01',
			'007001003'=>'M01',
			'007002001'=>'M02'
	);

	// 2.0에서 쓰이는 카테고리코드로 변경
	const NCR_PAPER_COLOR_MATCHING = array(
			'백색'=>'W',
			'황색'=>'Y',
			'적색'=>'R',
			'청색'=>'B',
			'녹색'=>'G'
	);

	// 2.0에서 쓰이는 카테고리코드로 변경
	const PAGE_CODE = array(
			'001001001'=>'N10',
			'001001002'=>'N10',
			'001001003'=>'N10',
			'001001004'=>'N10',
			'001002016'=>'N20',
			'001003024'=>'N30',
			'003001001'=>'B01',
			'003003001'=>'B02',
			'003004001'=>'B03',
			'005001001'=>'E10',
			'005001002'=>'E10',
			'007001001'=>'M01',
			'007001002'=>'M01',
			'007001003'=>'M01',
			'007002001'=>'M02');

	// 2.0에서 쓰이는 기본코팅 여부
	const COATING_CODE = array(
			'001001001'=>'1',
			'001001002'=>'0',
			'001001003'=>'1',
			'001001004'=>'0',
			'001002016'=>'0',
			'001003024'=>'0',
			'003001001'=>'0',
			'003003001'=>'0',
			'003004001'=>'0',
			'005001001'=>'0',
			'005001002'=>'0',);
}

?>
