/*
 *
 * Copyright (c) 2015 Nexmotion, Inc.
 * All rights reserved.
 *
 * REVISION HISTORY (reverse chronological order)
 *=============================================================================
 * 2015/12/23 엄준현 생성
 * 2015/12/29 임종건 일자 검색 관련 함수 수정
 * 2015/12/29 임종건 회원 팝업 검색 수정
 *=============================================================================
 *
 */

var request = null;
var ajaxreq = null;
var uploaderObj = "";

$(document).ready(function() {
    // 데이트 피커 초기화
    $("#date_team_from").datepicker({
        autoclose : true,
        format    : "yyyy-mm-dd",
        todayBtn  : "linked",
        todayHighlight: true
    });
    $("#date_team_to").datepicker({
        autoclose : true,
        format    : "yyyy-mm-dd",
        todayBtn  : "linked",
        todayHighlight: true
    });
    $("#date_memb_from").datepicker({
        autoclose : true,
        format    : "yyyy-mm-dd",
        todayBtn  : "linked",
        todayHighlight: true
    });
    $("#date_memb_to").datepicker({
        autoclose : true,
        format    : "yyyy-mm-dd",
        todayBtn  : "linked",
        todayHighlight: true
    });

	cndSearch.exec();
    // 페이징 목록생성
    paging.exec(1);
});

/**
 * @brief 날짜 범위 설정 - 공통
 *
 * @param num = 범위
 */
var setDateVal = function(num, dvs) {

    var day = new Date();
    var time = day.getHours();
    var d_day = new Date(day - (num * 1000 * 60 * 60 * 24));
    var last = new Date(day - (365 * 1000 * 60 * 60 * 24));

    if (num === "all") {
        $("#date_" + dvs + "_from").val("");
        $("#time_" + dvs + "_from").val("0");
        $("#date_" + dvs + "_to").val("");
        $("#time_" + dvs + "_to").val("0");

        return false;
    } else if (num === "last") {
        $("#date_" + dvs + "_from").datepicker("setDate", last);
        $("#time_" + dvs + "_from").val("0");
        $("#date_" + dvs + "_to").datepicker("setDate", last);
        $("#time_" + dvs + "_to").val(time);
        return false;
    }

    $("#date_" + dvs + "_from").datepicker("setDate", d_day);
    $("#time_" + dvs + "_from").val("0");
    $("#date_" + dvs + "_to").datepicker("setDate", '0');
    $("#time_" + dvs + "_to").val(time);
}

/**
 * @brief 회원별 검색 날짜 범위 설정
 *
 * @param num = 범위
 */
var setDateMemb = function(num) {
    setDateVal(num, "memb");
};

/**
 * @brief 팀별 검색 날짜 범위 설정
 *
 * @param num = 범위
 */
var setDateTeam = function(num) {
    setDateVal(num, "team");
};

/**
 * @brief 선택조건으로 검색 클릭시
 */
var cndSearch = {
    "tabDvs"     : "memb",
    "page"       : "1",
    "listSize"   : "20",
    "searchFlag" : false,
    "exec"       : function(dvs, val) {
        this.searchFlag = true;
        // 리스트 사이즈 변경시 마지막 seqno 초기화
        if (dvs === 'l') {
            this.listSize = val;
            this.page = 1;
            paging.exec(1);
        }

        // 페이지 변경시 활성화 변경
        if (dvs === 'p') {
            this.page = val;
            $("#paging").find("a.active").removeClass("active");
            $("#page_" + val).addClass("active");
        }

        //var url = "/ajax/business/order_common_mng/load_order_list.php";
        var url = "/ajax/business/order_hiprint/load_order_list.php";
        var data = {
            "page"       : this.page,
            "list_size"  : this.listSize,
            "tab_dvs"    : this.tabDvs,
            "last_seqno" : $("#last_seqno").val()
        };
        var callback = function(result) {
			//var rsdata = $.parseJSON(result);
			//console.log(rsdata.html);
            $("#order_list").html(result.html);
            $("#page").html(result.paging);
        };

        if (this.tabDvs === "memb") {
            data.sell_site     = $("#sell_site").val();
            data.cate_sortcode = $("#cate_bot").val();
            data.office_nick   = $("#office_nick").val();
            data.from_date     = $("#date_memb_from").val();
            data.from_time     = $("#time_memb_from").val();
            data.to_date       = $("#date_memb_to").val();
            data.to_time       = $("#time_memb_to").val();
            data.status        = $("#status_memb").val();
            data.status_proc   = $("#status_proc_memb").val();
        }

        showMask();

        ajaxCall(url, "json", data, callback);
    }
};

/**
 * @brief 주문 내용 조회팝업 출력
 *
 * @param seq = 주문일련번호
 */
var showOrderContent = function(seq) {
    var url = "/ajax/business/order_hiprint/load_order_info.php";
    var data = {
        "seqno" : seq
    };
    var callback = function(result) {
        openRegiPopup(result, "950");
    };

    ajaxCall(url, "html", data, callback);
};

/**
 * @brief 상품 내용 조회팝업 출력
 *
 * @param seq = 주문일련번호
 */
var showProductContent = function(seq) {
    var url = "/ajax/business/order_hiprint/load_product_info.php";
    var data = {
        "seqno" : seq
    };
    var callback = function(result) {
        openRegiPopup(result, "950");
        setFiles();

        price = $("#Price").attr("value");
        beforeTax = parseInt(price / 1.1);
        tax = price - beforeTax;

        $("#PayPrice").val(price);
        $("#OriPayPrice").val(beforeTax);
        $("#Taxes").val(tax);
        $("#RPay_Price").val(price);
        $("#RPay_PriceU").val(price);

        if($("input[name=Pro_Code]").val().length != 15) {
            $("#order_request").hide();
        }
    };

    ajaxCall(url, "html", data, callback);
};


/**
 * @brief 주문 상태 상세 조회팝업 출력
 *
 * @param seq = 주문일련번호
 */
var showOrderDetail = function(seq) {
    var url = "/ajax/business/order_common_mng/load_order_detail.php";
    var data = {
    };
    var callback = function(result) {
        $("#regi_popup").css("height", "500px");
        openRegiPopup(result, "800");
    };

    ajaxCall(url, "html", data, callback);
};

/**
 * @brief 페이지 이동
 */
var movePage = function(val) {
    cndSearch.exec('p', val);
}

/**
 * @brief 보여줄 페이지 수 설정
 */
var showPageSetting = function(val) {
    cndSearch.exec('l', val);
}

var applyOrderStatus = function() {
	var url = "/ajax/business/order_hiprint/save_order_status.php";
	var data = {
		"order_prdlist_seq"	:	$(".sel_status").attr("id"),
		"prd_status"		:	$(".sel_status").find("option:selected").attr("id"),
	};

	var callback = function(result) {
        if(result == 1) {
            alert("요청완료");
            hideRegiPopup()
            cndSearch.exec('', '');
        }
        else
            alert("실패");
	};

	ajaxCall(url, "html", data, callback);
}

var setFiles = function(){
    var uploader = new plupload.Uploader({
        runtimes : 'html5,flash,silverlight,html4',
        browse_button : 'pickfiles', // you can pass an id...
        url : '/proc/common/file_upload_common.php',
        flash_swf_url : '/plupload/js/Moxie.swf',
        silverlight_xap_url : '/plupload/js/Moxie.xap',
        chunk_size: '5mb', //업로드단위 분할 사이즈
        multipart_params : {
            "order_no" : "",
            "prd_detail_no" : "",
            "type" : "",
            "ftype" : ""
        },
        max_file_count : 1,
        filters : {
            max_file_size : '1000mb',
            mime_types: [
                {title : "Image files", extensions : "jpg,gif,png"}
            ]
        },

        init: {

            PostInit: function() {
                document.getElementById('uploadfiles').onclick = function() {
                    uploader.settings.multipart_params["order_no"] = $('#fileUpload').attr('ono');
                    uploader.settings.multipart_params["prd_detail_no"] = $('#fileUpload').attr('dno');
                    uploader.settings.multipart_params["type"] = 'user';
                    uploader.settings.multipart_params["ftype"] = 'order';
                    $('#filelist').attr('fchk',false); //파일업로드중 결제진행을 못하기 위해 설정
                    uploader.start();
                    return false;
                };
            },

            FilesAdded: function(up, files) {
                $("#btn_upload").show();
                //console.log(uploader<?=$i?>.files);
                plupload.each(files, function(file) {
                    $("#uploadfiles").show();
                    if(uploader.files.length > 1){
                        uploader.files.reverse();
                        uploader.files.pop();
                    }
                    document.getElementById('filelist').innerHTML
                        = '<label id='+ file.id +'>' + file.name +' (' + plupload.formatSize(file.size) + ')<b></b>'
                    + '&nbsp;' +
                        "<img src=\"/design_template/images/btn_circle_x_red.png\"" +
                    "     id=\"work_file_del\"" +
                    "     file_seqno=\"\"" +
                    "     onclick=\"removeFile('');\"" +
                    "     style=\"cursor:pointer;\" /></label>";
                });

            },

            UploadProgress: function(up, file) {
                document.getElementById(file.id).getElementsByTagName('b')[0].innerHTML = '<span>' + file.percent + "%</span>";
            },
            FileUploaded: function(up, file, response) {
                var jsonObj = JSON.parse(response.response);
                var fileSeqno = jsonObj.id;
                $('#filelist').attr('fchk',true);
                $('#work_file_del').attr(
                    {"onclick"  : "removeUploadFile('" + fileSeqno + "');",
                        "file_seqno" : fileSeqno}
                );
            },
            Error: function(up, err) {
                alert('파일업로드가 정상적으로 이루어지지 않았습니다 \n관리자에게 문의해주세요');
            }
        }
    });
    uploader.init();
    uploaderObj = uploader;
}

var removeUploadFile = function(seqno) {
    if (confirm("기존 파일은 삭제합니다." +
            "\n계속 하시겠습니까?") === false) {
        return false;
    }

    var fileSeqno = seqno;

    removeFile(fileSeqno, false);
}

var removeFile = function(seqno, flag) {
    if (checkBlank(seqno) === true) {
        var uploader = uploaderObj;
        var files = uploader.files;
        uploader.removeFile(files[0]);

        return false;
    }

    if (flag === true) {
        if (confirm("작업파일을 삭제하시겠습니까?" +
                "\n삭제된 파일은 복구되지 않습니다.") === false) {
            return false;
        }
    }

    var url = "/ajax/business/esti_list/del_esti_file.php";
    var data = {
        "seqno"  : seqno
    };
    var callback = function(result) {
        if (result == "F") {
            alert("파일 정보 삭제에 실패했습니다.");
            return false;
        }
        $("#uploadfiles").hide();
        $("#filelist").html('');

        if (flag === true) {
            var uploader = uploaderObj;
            var files = uploader.files;
            uploader.removeFile(files[0]);
        }


    };

    showMask();
    ajaxCall(url, "text", data, callback);
};

function httpRequest(){

	if(window.XMLHttpRequest){

		try{

			request = new XMLHttpRequest();

		}catch(e){

			request = null;

		}

	}else if(window.ActiveXObject){

		//* IE

		try{

			request = new ActiveXObject("Msxml2.XMLHTTP");

		}catch(e){

			//* Old Version IE

			try{

				request = new ActiveXObject("Microsoft.XMLHTTP");

			}catch(e){

				request = null;

			}

		}

	}

	request.onreadystatechange = function(){

		if(request.readyState == 4 && request.status == 200){

			var xmlData = request.getReaponseXML().getElementById("helpMsg");

			var entries = xmlData.getElementByTagName("rawurl");

		}

	}

}

function callRequest() {
    callOrderRequest();
}

function callDeliveryRequest(){

	httpRequest();

	request.open("POST", "http://www.dprinting.biz:8090/shop_sun/order_joochong.php", true);
    //request.open("POST", "http://www.gprinting.co.kr/shop_sun/order_joochong.php", true);
    postdata = $("#deliveryForm").serialize();
    /*
	var postdata = "";
	postdata += "AProSale_Price[]=0&";
	postdata += "AProSale_PriceU[]=0&";
	postdata += "Secure_Id[]="+ $("#Secure_Id").val() +"&";
	postdata += "Dcode=136-783&";
	postdata += "Deli_Mode=C&";
	postdata += "Deli_Pay_Mode=2&";
	postdata += "Exception_YN=N&";
	postdata += "GProSale_Price[]=0&";
	postdata += "GProSale_PriceU[]=0&";
	postdata += "mypoint=10000000&";
	postdata += "or_addr1=����Ư���� ���ϱ� ����2��&";
	postdata += "or_addr2=123&";
	postdata += "or_com=&";
	postdata += "or_email=hyeonsik5015@naver.com&";
	postdata += "or_hp[]=010&";
	postdata += "or_hp[]=5015&";
	postdata += "or_hp[]=7915&";
	postdata += "or_name=������&";
	postdata += "or_tel[]=2900&";
	postdata += "or_tel[]=972&";
	postdata += "or_tel[]=02&";
	postdata += "or_zip1=136&";
	postdata += "or_zip2=783&";
	postdata += "order_S=2&";
	postdata += "order_type=direct&";
	postdata += "OriPayPrice=5900&";
	postdata += "PayPrice=6490&";
	postdata += "PayPrice_Sale=0&";
	postdata += "Pro_TotalSale[]=0&";
	postdata += "ProSale_Price[]=0&";
	postdata += "ProSale_PriceU[]=0&";
	postdata += "re_addr1=����Ư���� ���ϱ� ����2��&";
	postdata += "re_addr2=123&";
	postdata += "re_hp[]=010&";
	postdata += "re_hp[]=5015&";
	postdata += "re_hp[]=7915&";
	postdata += "re_name=������&";
	postdata += "re_tel[]=2900&";
	postdata += "re_tel[]=972&";
	postdata += "re_tel[]=02&";
	postdata += "re_zip1=136&";
	postdata += "re_zip2=783&";
	postdata += "RPay_Price[]=6490&";
	postdata += "RPay_PriceU[]=6490&";
	postdata += "Same=basic&";
	postdata += "Send_addr1=����Ư���� ���ϱ� ����2�� 123&";
	postdata += "Send_chk=new&";
	postdata += "Send_name=������&";
	postdata += "Send_tel[]=02&";
	postdata += "Send_tel[]=972&";
	postdata += "Send_tel[]=2900&";
	postdata += "Send_zip1=136&";
	postdata += "Send_zip2=783&";
	postdata += "Taxes=590&";
	postdata += "x=44&";
	postdata += "y=11";
    */
	request.onreadystatechange = function() {
        if (request.readyState === 4)  {
            var serverResponse = request.responseText;
            temp = serverResponse.split("file_name=");
            fileName = temp[1];
            orderNum = $("#fileUpload").attr("dno");

            submitOrder(fileName, orderNum);
        }
    };

	request.setRequestHeader("Content-type", "application/x-www-form-urlencoded");
	request.setRequestHeader("Content-length", postdata.length);

	request.send(postdata);
}



function callOrderRequest(){
	httpRequest();

	request.open("POST", "http://www.dprinting.biz:8090/ISAF/Libs/php/doquery_joochong.php", true);
    //request.open("POST", "http://www.gprinting.co.kr/ISAF/Libs/php/doquery_joochong.php", true);
	postdata = $("#orderForm").serialize();
    /*
    var postdata = "";
	postdata += "after_H06=&";
	postdata += "after_H06_sub=&";
	postdata += "after_H07=&";
	postdata += "after_price[0]=3300&";
	postdata += "after_price[1]=5500&";
	postdata += "after_price[2]=5500&";
	postdata += "after_price[3]=5500&";
	postdata += "after_price[4]=16000&";
	postdata += "after_price[5]=0&";
	postdata += "after_price[6]=0&";
	postdata += "after_price[7]=0&";
	postdata += "After_TPrice=3300&";
	postdata += "after_W06=&";
	postdata += "after_W06_sub=&";
	postdata += "after_W07=&";
	postdata += "AGroup_1[0]=01&";
	postdata += "AGroup_1[1]=02&";
	postdata += "AGroup_1[2]=03&";
	postdata += "AGroup_1[3]=04&";
	postdata += "AGroup_1[4]=05&";
	postdata += "AGroup_1[5]=06&";
	postdata += "AGroup_1[6]=07&";
	postdata += "AGroup_1[7]=08&";
	postdata += "AGroup_1_Sel[]=01&";
	postdata += "AGroup_2[0]=01&";
	postdata += "AGroup_2[1]=01&";
	postdata += "AGroup_2[2]=01&";
	postdata += "AGroup_2[3]=01&";
	postdata += "AGroup_2[4]=01&";
	postdata += "AGroup_2[5]=01&";
	postdata += "AGroup_2[6]=01&";
	postdata += "AGroup_2[7]=01&";
	postdata += "Basic_Price=3190&";
	postdata += "Ca_Code=N11&";
	postdata += "Color_Code=4&";
	postdata += "CS_MaxSizeH=&";
	postdata += "CS_MaxSizeW=&";
	postdata += "CS_MinSizeH=&";
	postdata += "CS_MinSizeW=&";
	postdata += "CutSizeH=52&";
	postdata += "CutSizeW=86&";
	postdata += "Digits=1&";
	postdata += "direct=Y&";
	postdata += "EditSizeH=54&";
	postdata += "EditSizeW=88&";
	postdata += "GD_LB=Y&";
	postdata += "GD_LT=Y&";
	postdata += "GD_RB=Y&";
	postdata += "GD_RT=Y&";
    postdata += "isNonStand=N&";
	postdata += "mode=to_cart&";
	postdata += "Num=1&";
	postdata += "Page_CaCode=N10&";
	postdata += "Paper_Code=AT/B/216&";
	postdata += "Pressure2=76&";
	postdata += "Price=6490&";
	postdata += "Pro_Code=N11ATB216N014S1&";
	postdata += "Pro_Code_basic=N11ATB216N014S1&";
	postdata += "Qty=200.0&";
	postdata += "S_Code=N01&";
	postdata += "Side_Code=S&";
	postdata += "Standard=SEL&";
	postdata += "TK_Num=4&";
	postdata += "DSFile=" + $("#DSFile").val() + "&";
	postdata += "DSOriFile=event.png&";
	postdata += "Memo=hi&";
	postdata += "Subject=987&";
	postdata += "DataGubun=0";
	*/
	request.setRequestHeader("Content-type", "application/x-www-form-urlencoded");
	request.setRequestHeader("Content-length", postdata.length);


	request.onreadystatechange = function() {
        if (request.readyState === 4)  {
            var serverResponse = request.responseText;
            temp = serverResponse.split("</iframe>");
            secure_id = temp[1];
            $("#Secure_Id").val(secure_id);

            callDeliveryRequest();
        }
    };

	request.send(postdata);
}



var submitOrder = function(save_file_name, prd_detail_no) {
    var url = "/ajax/business/order_hiprint/update_img_status.php";
    var data = {
        "save_file_name"  : save_file_name,
        "prd_detail_no" : prd_detail_no
    };
    var callback = function(result) {
        if (result == 1) {
            alert("성공");
        } else {
            alert("실패");
        }
    };

    //showMask();
    ajaxCall(url, "text", data, callback);
};

<!--
var ProductName_count = 121;
var Product_Name = new Array('일반명함','고품격명함','당일오전판명함','복권','고급지-300장명함','고급지-200장명함','카드명함','고급지두꺼운명함','상품권-500장','상품권-600장','상품권-400장-1','상품권-400장-2','초대청첩장-500장','초대청첩장-300장','초대청첩장-200장','코팅사각주차증','코팅모양주차증','PP주차증','세트품목','일반스티커','파워강접스티커','유포지스티커','은데드롱스티커','보험도무송스티커','정사각귀돌이-AR','직사각귀돌이-ARR','원형도무송-AC','타원형도무송-AE','반원형도무송-AS','하트형도무송-AH','비디오스티커','열쇠스티커','CD카세트스티커','전단합판','문어발합판전단','80모조합판전단','150아트합판전단','메뉴판합판','독판전단','문어발독판전단','문고리독판전단','단색독판전단','족자포스터','중철카다로그','수입지카다로그','리플렛','수입지리플렛','홀더','칼라5절대봉투합판','칼라A4소봉투합판','봉투세트합판','칼라대봉투독판','칼라소봉투독판','칼라봉투세트독판','마스타대봉투','마스타소봉투','마스타양식지1','마스타양식지2','마스타양식지3','NCR1','NCR2','NCR3','초소량옵셋인쇄','디지탈소량인쇄','기타인쇄물','FTP접수','운송비','부가세','차감액','추가품목','보험도무송스티커','자동차모양스티커','원형스티커','타원형스티커','하트형스티커','사각라운드스티커','자유형스티커','사각귀돌이스티커','아름다운전면도무송','투명스티커','탁상용카렌다','고급지귀돌이명함','종이자석','자석스티커','무지명함','무지귀돌이명함','별규격독판-대봉투','별규격독판-소봉투','별규격독판-카드봉투','별규격독판-티켓봉투','디지탈소량인쇄(신제품)','디지탈인쇄(후가공1)','디지탈인쇄(후가공2)','80코트합판전단','80모조스티커','연당단가-70모조','연당단가-80모조','연당단가-100모조','상-하(100매철)','상-중-하(150매철)','상-중-중-하(200매철)','칼라6절대봉투합판','칼라9절대봉투합판','칼라자켓소봉투합판','칼라티켓소봉투합판','부분에폭시명함','색지마스타(45g)','색지마스타(90g)','연당단가-색지45g','연당단가-색지90g','선거명함','부동산봉투(M)','종교봉투','16절소봉투','부동산봉투','배너거치대','실사출력','현수막','폼보드','포맥스','백색인쇄명함');
var AfterWork_count = 147;
var AfterWork = new Array('100*20.9-10개','100*26.1-8개','100*32-8개','100*36.6-10개','100*37-8개','100*41.8-5개','10등분재단','12등분재단','14등분재단','15등분재단','16등분재단','18등분재단','1도인쇄비추가','20등분재단','2단접지','2도인쇄비추가','2등분재단','2절단면','2절양면','3단병풍','3단접지','3도인쇄비추가','3등분재단','4도인쇄비추가','4등분재단','4절단면','4절양면','5도인쇄비추가','5등분재단','60*20.9-10개','60*23-8개','60*26.1-8개','60*30.1-6개','60*36.2-5개','60*41.8-5개','6등분재단','70*23-8개','70*30.1-6개','70*36.2-5개','7등분재단','80*20.9-10개','80*23-8개','80*26.1-8개','80*30.1-6개','80*36.2-5개','80*41.8-5개','8등분재단','9등분재단','가변인쇄(단면)','가변인쇄(양면)','국2절단면','국2절양면','국전단면','국전양면','금박단면','금박양면','금색단면1도','금색베다1도','금색베다2도','금색양면2도','기본넘버링','기본제판비','난수넘버링(단면)','난수넘버링(양면)','녹박단면','녹박양면','대문접지','도무송추가','두루마리접지','떡제본','라미넥스코팅','라벨재단','명함귀돌이','목형+도무송','무광단면코팅','무광양면코팅','무선제본','문고리 지름60','문고리 지름68','미싱1줄','미싱2줄','미싱3줄','미싱4줄','미싱5줄','별도견적있음','별색1도','별색2도','별색3도','별색4도','별색5도','별색6도','별색7도','별색8도','병풍접지','스크레치복권','스티커원터치','스티커투터치','십자접지','양면테이프','양식제본','오시1줄','오시2줄','오시3줄','오시4줄','오시5줄','유광단면코팅','유광양면코팅','은박단면','은박양면','은색단면1도','은색베다1도','은색베다2도','은색양면2도','장국2절 날개접지','적박단면','적박양면','정매있음','주차증도무송','중철제본','짧은면쪽 중철제본','청박단면','청박양면','타공','타공1구멍','타공2구멍','타공3구멍','타공4구멍','타공5구멍','통박단면','통박양면','통형압','형압','홀더 4DHD1','홀더 4DHD2','홀더 4DHD3','홀더 4DHD4','홀더 4DHD5','홀더 4DHD6','홀더 4DHD7','홀더 4DHD8','홀더 4DHD9','A타입스티커','B타입스티커','C타입스티커','DM접지','UV단면코팅','UV양면코팅');
var AfterWorkSub_count = 147;
var AfterWorkSub = new Array('박인쇄','박인쇄','박인쇄','박인쇄','박인쇄','박인쇄','박인쇄','박인쇄','박인쇄','박인쇄','박인쇄','박인쇄','미싱','미싱','미싱','미싱','미싱','오시','오시','오시','오시','오시','타공','타공','타공','타공','타공','형압','형압','재단','재단','재단','재단','재단','재단','재단','재단','별색','별색','별색','별색','별색','별색','별색','별색','별색','별색','별색','별색','별색','별색','별색','별색','코팅','코팅','코팅','코팅','코팅','코팅','코팅','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','도무송','접지','접지','접지','접지','접지','접지','접지','제본','제본','제본','제본','제본','제본','넘버링','별도견적','제판비','제판비','제판비','제판비','제판비','제판비','제판비','제판비','제판비','제판비','제판비','제판비','제판비','정매','도무송','넘버링','넘버링','넘버링','넘버링','넘버링','제판비','접지','접지','타공','재단','재단','재단','재단','재단','재단','재단','재단','재단','재단');
var SizeKindName_count = 2;
var SizeKind_Name = new Array('규격','비규격');
var FilmAdd_count = 1726;
var FilmAdd = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','27000','0','27000','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','20000','0','0','0','0','0','0','0','0','0','27000','9000','44000','0','0','0','0','0','0','0','0','0','27000','18000','62000','0','0','0','0','0','32000','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','32000','56000','32000','56000','32000','56000','32000','56000','32000','56000','56000','92000','32000','56000','32000','56000','32000','56000','32000','56000','32000','56000','56000','92000','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','8000','16000','12000','24000','48000','32000','24000','16000','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var JaedanAdd_count = 1726;
var JaedanAdd = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','5000','5000','0','0','0','0','0','0','5000','5000','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','10000','0','0','0','5000','5000','0','0','0','0','0','0','0','0','0','0','5000','5000','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','5000','5000','0','0','0','0','0','0','0','0','5000','5000','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','5000','5000','5000','5000','5000','5000','5000','5000','5000','5000','0','0','5000','5000','5000','5000','5000','5000','5000','5000','5000','5000','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_0_0 = new Array('3500','6500','9500','13000','16300','18000','21000','21000','23700','24000','26400','28600','31000','34200','36500','38800','41300','42000','44000','44000','49000','53000','58000','62000','66000','71000','75000','80000','84000','88000','132000','176000','220000','264000','308000','352000','396000','440000','484000','528000','572000','616000','660000','704000','748000','792000','836000','880000','924000','968000','1012000','1056000','1100000','1144000','1188000','1232000','1276000','1320000','1540000','1760000','1980000','2200000');
var Cost_0_1 = new Array('3500','6500','9500','13000','16300','18000','21000','21000','23700','24000','26400','28600','31000','34200','36500','38800','41300','42000','44000','44000','49000','53000','58000','62000','66000','71000','75000','80000','84000','88000','132000','176000','220000','264000','308000','352000','396000','440000','484000','528000','572000','616000','660000','704000','748000','792000','836000','880000','924000','968000','1012000','1056000','1100000','1144000','1188000','1232000','1276000','1320000','1540000','1760000','1980000','2200000');
var Cost_0_2 = new Array('4500','9000','13500','18000','22500','27000','31500','34000','37000','37000','40700','43000','46600','49000','50000','51000','53000','53000','54000','54000','60000','65000','71000','76000','81000','87000','92000','98000','103000','108000','162000','216000','270000','324000','378000','432000','486000','540000','594000','648000','702000','756000','810000','864000','918000','972000','1026000','1080000','1134000','1188000','1242000','1296000','1350000','1404000','1458000','1512000','1566000','1620000','1890000','2160000','2430000','2700000');
var Cost_0_3 = new Array('3000','6000','9000','12000','15000','17000','18000','18000','19000','19000','20900','22600','24500','26200','28000','29800','31700','32000','33800','34000','38000','41000','45000','48000','51000','55000','58000','62000','65000','68000','102000','136000','170000','204000','238000','272000','306000','340000','374000','408000','442000','476000','510000','544000','578000','612000','646000','680000','714000','748000','782000','816000','850000','884000','918000','952000','986000','1020000','1190000','1360000','1530000','1700000');
var Cost_0_4 = new Array('3000','6000','9000','12000','15000','17000','18000','18000','19000','19000','20900','22600','24500','26200','28000','29800','31700','32000','33800','34000','38000','41000','45000','48000','51000','55000','58000','62000','65000','68000','102000','136000','170000','204000','238000','272000','306000','340000','374000','408000','442000','476000','510000','544000','578000','612000','646000','680000','714000','748000','782000','816000','850000','884000','918000','952000','986000','1020000','1190000','1360000','1530000','1700000');
var Cost_0_5 = new Array('3500','7000','10500','13500','18000','18300','23000','23200','27000','28000','32000','32900','37000','37800','43000','43000','48000','48000','51000','51000','60000','62000','71000','72000','80000','81000','90000','91000','99000','100000','150000','200000','250000','293000','336000','379000','421000','463000','505000','545000','585000','625000','665000','705000','745000','785000','825000','865000','905000','945000','985000','1025000','1065000','1105000','1145000','1185000','1225000','1265000','1315000','1728000','1930000','2130000');
var Quantity_0_count = 62;
var Quantity_0 = new Array('500','1000','1500','2000','2500','3000','3500','4000','4500','5000','5500','6000','6500','7000','7500','8000','8500','9000','9500','10000','11000','12000','13000','14000','15000','16000','17000','18000','19000','20000','30000','40000','50000','60000','70000','80000','90000','100000','110000','120000','130000','140000','150000','160000','170000','180000','190000','200000','210000','220000','230000','240000','250000','260000','270000','280000','290000','300000','350000','400000','450000','500000');
var Kind_0_count = 6;
var Kind_0 = new Array('코팅단면4도','코팅양면5도','코팅양면8도','비코팅단면4도','비코팅양면5도','비코팅양면8도');
var Kind_0_Code = new Array('0','1','2','3','4','5');
var Cost_1_6 = new Array('3500','6500','9500','13000','16300','18000','21000','21000','23700','24000','26400','28600','31000','34200','36500','38800','41300','42000','44000','44000','49000','53000','58000','62000','66000','71000','75000','80000','84000','88000','132000','176000','220000','264000','308000','352000','396000','440000','484000','528000','572000','616000','660000','704000','748000','792000','836000','880000','924000','968000','1012000','1056000','1100000','1144000','1188000','1232000','1276000','1320000','1540000','1760000','1980000','2200000');
var Cost_1_7 = new Array('3500','6500','9500','13000','16300','18000','21000','21000','23700','24000','26400','28600','31000','34200','36500','38800','41300','42000','44000','44000','49000','53000','58000','62000','66000','71000','75000','80000','84000','88000','132000','176000','220000','264000','308000','352000','396000','440000','484000','528000','572000','616000','660000','704000','748000','792000','836000','880000','924000','968000','1012000','1056000','1100000','1144000','1188000','1232000','1276000','1320000','1540000','1760000','1980000','2200000');
var Cost_1_8 = new Array('4500','9000','13500','18000','22500','27000','31500','34000','37000','37000','40700','43000','46600','49000','50000','51000','53000','53000','54000','54000','60000','65000','71000','76000','81000','87000','92000','98000','103000','108000','162000','216000','270000','324000','378000','432000','486000','540000','594000','648000','702000','756000','810000','864000','918000','972000','1026000','1080000','1134000','1188000','1242000','1296000','1350000','1404000','1458000','1512000','1566000','1620000','1890000','2160000','2430000','2700000');
var Cost_1_9 = new Array('3000','6000','9000','12000','15000','17000','18000','18000','19000','19000','20900','22600','24500','26200','28000','29800','31700','32000','33800','34000','38000','41000','45000','48000','51000','55000','58000','62000','65000','68000','102000','136000','170000','204000','238000','272000','306000','340000','374000','408000','442000','476000','510000','544000','578000','612000','646000','680000','714000','748000','782000','816000','850000','884000','918000','952000','986000','1020000','1190000','1360000','1530000','1700000');
var Cost_1_10 = new Array('3000','6000','9000','12000','15000','17000','18000','18000','19000','19000','20900','22600','24500','26200','28000','29800','31700','32000','33800','34000','38000','41000','45000','48000','51000','55000','58000','62000','65000','68000','102000','136000','170000','204000','238000','272000','306000','340000','374000','408000','442000','476000','510000','544000','578000','612000','646000','680000','714000','748000','782000','816000','850000','884000','918000','952000','986000','1020000','1190000','1360000','1530000','1700000');
var Cost_1_11 = new Array('3500','7000','10500','13500','18000','18300','23000','23200','27000','28000','32000','32900','37000','37800','43000','43000','48000','48000','51000','51000','60000','62000','71000','72000','80000','81000','90000','91000','99000','100000','150000','200000','250000','293000','336000','379000','421000','463000','505000','545000','585000','625000','665000','705000','745000','785000','825000','865000','905000','945000','985000','1025000','1065000','1105000','1145000','1185000','1225000','1265000','1315000','1728000','1930000','2130000');
var Quantity_1_count = 62;
var Quantity_1 = new Array('500','1000','1500','2000','2500','3000','3500','4000','4500','5000','5500','6000','6500','7000','7500','8000','8500','9000','9500','10000','11000','12000','13000','14000','15000','16000','17000','18000','19000','20000','30000','40000','50000','60000','70000','80000','90000','100000','110000','120000','130000','140000','150000','160000','170000','180000','190000','200000','210000','220000','230000','240000','250000','260000','270000','280000','290000','300000','350000','400000','450000','500000');
var Kind_1_count = 6;
var Kind_1 = new Array('코팅단면4도','코팅양면5도','코팅양면8도','비코팅단면4도','비코팅양면5도','비코팅양면8도');
var Kind_1_Code = new Array('6','7','8','9','10','11');
var Cost_2_12 = new Array('3500');
var Cost_2_13 = new Array('3500');
var Cost_2_14 = new Array('4500');
var Cost_2_977 = new Array('3500');
var Cost_2_978 = new Array('3500');
var Cost_2_979 = new Array('4500');
var Quantity_2_count = 1;
var Quantity_2 = new Array('500');
var Kind_2_count = 6;
var Kind_2 = new Array('코팅단면4도','코팅양면5도','코팅양면8도','고품격코팅단면4도','고품격코팅양면5도','고품격코팅양면8도');
var Kind_2_Code = new Array('12','13','14','977','978','979');
var Cost_3_15 = new Array('11000','22000','33000','33000','44000','44000','55000','55000','66000','66000','77000','79200','90200','82500','93500','88000','99000','99000','110000','125000','137500','150000','162500','175000','187500','200000','212500','225000','230000','230000','345000','460000','575000','690000','805000','920000','1035000','1150000','1265000','1380000','1495000','1610000','1725000','1840000','1955000','2070000','2185000','2300000','2415000','2530000','2645000','2760000','2875000','2990000','3105000','3220000','3335000','3450000','4025000','4600000','5175000','5750000');
var Cost_3_16 = new Array('11000','22000','33000','33000','44000','44000','55000','55000','66000','66000','77000','79200','90200','82500','93500','88000','99000','99000','110000','125000','137500','150000','162500','175000','187500','200000','212500','225000','230000','230000','345000','460000','575000','690000','805000','920000','1035000','1150000','1265000','1380000','1495000','1610000','1725000','1840000','1955000','2070000','2185000','2300000','2415000','2530000','2645000','2760000','2875000','2990000','3105000','3220000','3335000','3450000','4025000','4600000','5175000','5750000');
var Cost_3_17 = new Array('15000','27000','42000','42000','57000','57000','72000','72000','87000','87000','102000','104400','119400','109500','124500','116800','131800','131400','146400','150000','165000','180000','195000','210000','225000','240000','255000','270000','285000','300000','450000','600000','750000','900000','1050000','1200000','1350000','1500000','1650000','1800000','1950000','2100000','2250000','2400000','2550000','2700000','2850000','3000000','3150000','3300000','3450000','3600000','3750000','3900000','4050000','4200000','4350000','4500000','5250000','6000000','6750000','7500000');
var Quantity_3_count = 62;
var Quantity_3 = new Array('500','1000','1500','2000','2500','3000','3500','4000','4500','5000','5500','6000','6500','7000','7500','8000','8500','9000','9500','10000','11000','12000','13000','14000','15000','16000','17000','18000','19000','20000','30000','40000','50000','60000','70000','80000','90000','100000','110000','120000','130000','140000','150000','160000','170000','180000','190000','200000','210000','220000','230000','240000','250000','260000','270000','280000','290000','300000','350000','400000','450000','500000');
var Kind_3_count = 3;
var Kind_3 = new Array('복권단면4도','복권양면5도','복권양면8도');
var Kind_3_Code = new Array('15','16','17');
var Cost_4_18 = new Array('4500');
var Cost_4_19 = new Array('6500');
var Cost_4_20 = new Array('6500');
var Cost_4_21 = new Array('4500');
var Cost_4_22 = new Array('6500');
var Cost_4_23 = new Array('6500');
var Cost_4_24 = new Array('0');
var Cost_4_25 = new Array('0');
var Cost_4_26 = new Array('0');
var Cost_4_27 = new Array('0');
var Cost_4_28 = new Array('0');
var Cost_4_29 = new Array('0');
var Quantity_4_count = 1;
var Quantity_4 = new Array('300');
var Kind_4_count = 12;
var Kind_4 = new Array('라레단면4도','라레양면5도','라레양면8도','누브단면4도','누브양면5도','누브양면8도','탄트단면4도','탄트양면5도','탄트양면8도','화인라레단면4도','화인라레양면5도','화인라레양면8도');
var Kind_4_Code = new Array('18','19','20','21','22','23','24','25','26','27','28','29');
var Cost_5_30 = new Array('4000','8000','11000','15000','18000','22000','26000','29000','33000','36000','54000','72000','90000','180000','360000','540000','720000','900000');
var Cost_5_31 = new Array('5000','10000','14000','18000','22000','27000','32000','36000','40000','44000','66000','88000','110000','220000','440000','660000','880000','1100000');
var Cost_5_32 = new Array('5000','10000','14000','18000','22000','27000','32000','36000','40000','44000','66000','88000','110000','220000','440000','660000','880000','1100000');
var Cost_5_33 = new Array('4000','8000','11000','15000','18000','22000','26000','29000','33000','36000','54000','72000','90000','180000','360000','540000','720000','900000');
var Cost_5_34 = new Array('5000','10000','14000','18000','22000','27000','32000','36000','40000','44000','66000','88000','110000','220000','440000','660000','880000','1100000');
var Cost_5_35 = new Array('5000','10000','14000','18000','22000','27000','32000','36000','40000','44000','66000','88000','110000','220000','440000','660000','880000','1100000');
var Cost_5_36 = new Array('4000','8000','11000','15000','18000','22000','26000','29000','33000','36000','54000','72000','90000','180000','360000','540000','720000','900000');
var Cost_5_37 = new Array('5000','10000','14000','18000','22000','27000','32000','36000','40000','44000','66000','88000','110000','220000','440000','660000','880000','1100000');
var Cost_5_38 = new Array('5000','10000','14000','18000','22000','27000','32000','36000','40000','44000','66000','88000','110000','220000','440000','660000','880000','1100000');
var Cost_5_39 = new Array('4000','8000','11000','15000','18000','22000','26000','29000','33000','36000','54000','72000','90000','180000','360000','540000','720000','900000');
var Cost_5_40 = new Array('5000','10000','14000','18000','22000','27000','32000','36000','40000','44000','66000','88000','110000','220000','440000','660000','880000','1100000');
var Cost_5_41 = new Array('5000','10000','14000','18000','22000','27000','32000','36000','40000','44000','66000','88000','110000','220000','440000','660000','880000','1100000');
var Cost_5_42 = new Array('4000','8000','11000','15000','18000','22000','26000','29000','33000','36000','54000','72000','90000','180000','360000','540000','720000','900000');
var Cost_5_43 = new Array('5000','10000','14000','18000','22000','27000','32000','36000','40000','44000','66000','88000','110000','220000','440000','660000','880000','1100000');
var Cost_5_44 = new Array('5000','10000','14000','18000','22000','27000','32000','36000','40000','44000','66000','88000','110000','220000','440000','660000','880000','1100000');
var Cost_5_45 = new Array('4500','9000','13500','18000','22000','26500','31000','35500','40000','44000','66000','88000','100000','200000','400000','600000','800000','1000000');
var Cost_5_46 = new Array('5500','11000','16500','22000','27000','32500','38000','43500','49000','54000','81000','108000','130000','260000','520000','780000','1040000','1300000');
var Cost_5_47 = new Array('5500','11000','16500','22000','27000','32500','38000','43500','49000','54000','81000','108000','130000','260000','520000','780000','1040000','1300000');
var Cost_5_48 = new Array('4500','9000','13500','18000','22000','26500','31000','35500','40000','44000','66000','88000','100000','200000','400000','600000','800000','1000000');
var Cost_5_49 = new Array('5500','11000','16500','22000','27000','32500','38000','43500','49000','54000','81000','108000','130000','260000','520000','780000','1040000','1300000');
var Cost_5_50 = new Array('5500','11000','16500','22000','27000','32500','38000','43500','49000','54000','81000','108000','130000','260000','520000','780000','1040000','1300000');
var Cost_5_51 = new Array('4500','9000','13500','18000','22000','26500','31000','35500','40000','44000','66000','88000','100000','200000','400000','600000','800000','1000000');
var Cost_5_52 = new Array('5500','11000','16500','22000','27000','32500','38000','43500','49000','54000','81000','108000','130000','260000','520000','780000','1040000','1300000');
var Cost_5_53 = new Array('5500','11000','16500','22000','27000','32500','38000','43500','49000','54000','81000','108000','130000','260000','520000','780000','1040000','1300000');
var Cost_5_54 = new Array('5500','11000','16000','20000','25000','30500','36000','41000','45000','50000','75000','100000','120000','240000','480000','720000','960000','1200000');
var Cost_5_55 = new Array('6500','13000','19000','24000','30000','36500','43000','49000','54000','60000','90000','120000','140000','280000','560000','840000','1120000','1400000');
var Cost_5_56 = new Array('6500','13000','19000','24000','30000','36500','43000','49000','54000','60000','90000','120000','140000','280000','560000','840000','1120000','1400000');
var Cost_5_57 = new Array('5500','11000','16000','20000','25000','30500','36000','41000','45000','50000','75000','100000','120000','240000','480000','720000','960000','1200000');
var Cost_5_58 = new Array('6500','13000','19000','24000','30000','36500','43000','49000','54000','60000','90000','120000','140000','280000','560000','840000','1120000','1400000');
var Cost_5_59 = new Array('6500','13000','19000','24000','30000','36500','43000','49000','54000','60000','90000','120000','140000','280000','560000','840000','1120000','1400000');
var Cost_5_60 = new Array('4500','9000','13500','18000','22000','26500','31000','35500','40000','44000','66000','88000','100000','200000','400000','600000','800000','1000000');
var Cost_5_61 = new Array('5500','11000','16500','22000','27000','32500','38000','43500','49000','54000','81000','108000','130000','260000','520000','780000','1040000','1300000');
var Cost_5_62 = new Array('5500','11000','16500','22000','27000','32500','38000','43500','49000','54000','81000','108000','130000','260000','520000','780000','1040000','1300000');
var Cost_5_63 = new Array('4500','9000','13500','18000','22000','26500','31000','35500','40000','44000','66000','88000','100000','200000','400000','600000','800000','1000000');
var Cost_5_64 = new Array('5500','11000','16500','22000','27000','32500','38000','43500','49000','54000','81000','108000','130000','260000','520000','780000','1040000','1300000');
var Cost_5_65 = new Array('5500','11000','16500','22000','27000','32500','38000','43500','49000','54000','81000','108000','130000','260000','520000','780000','1040000','1300000');
var Cost_5_1011 = new Array('3500','7000','10000','13500','17000','20500','24000','27000','30500','34000','51000','68000','80000','160000','320000','480000','640000','800000');
var Cost_5_1012 = new Array('4500','9000','13000','17500','22000','26500','31000','35000','39500','44000','66000','88000','100000','200000','400000','600000','800000','1000000');
var Cost_5_1013 = new Array('4500','9000','13000','17500','22000','26500','31000','35000','39500','44000','66000','88000','100000','200000','400000','600000','800000','1000000');
var Cost_5_1014 = new Array('3500','7000','10000','13500','17000','20500','24000','27000','30500','34000','51000','68000','80000','160000','320000','480000','640000','800000');
var Cost_5_1015 = new Array('4500','9000','13000','17500','22000','26500','31000','35000','39500','44000','66000','88000','100000','200000','400000','600000','800000','1000000');
var Cost_5_1016 = new Array('4500','9000','13000','17500','22000','26500','31000','35000','39500','44000','66000','88000','100000','200000','400000','600000','800000','1000000');
var Cost_5_1017 = new Array('4000','8000','11000','15000','18000','22000','26000','29000','33000','36000','54000','72000','90000','180000','360000','540000','720000','900000');
var Cost_5_1018 = new Array('5000','10000','14000','18000','22000','27000','32000','36000','40000','44000','66000','88000','110000','220000','440000','660000','880000','1100000');
var Cost_5_1019 = new Array('5000','10000','14000','18000','22000','27000','32000','36000','40000','44000','66000','88000','110000','220000','440000','660000','880000','1100000');
var Cost_5_1367 = new Array('3500','7000','10500','14000','16000','19500','23000','26500','30000','32000','48000','64000','80000','160000','320000','480000','640000','800000');
var Cost_5_1368 = new Array('5500','11000','16500','22000','26000','31500','37000','42500','48000','52000','78000','104000','130000','260000','520000','780000','1040000','1300000');
var Cost_5_1369 = new Array('5500','11000','16500','22000','26000','31500','37000','42500','48000','52000','78000','104000','130000','260000','520000','780000','1040000','1300000');
var Cost_5_1370 = new Array('3500','7000','10000','13500','17000','20500','24000','27000','30500','34000','51000','68000','80000','160000','320000','480000','640000','800000');
var Cost_5_1371 = new Array('4500','9000','13000','17500','22000','26500','31000','35000','39500','44000','66000','88000','100000','200000','400000','600000','800000','1000000');
var Cost_5_1372 = new Array('4500','9000','13000','17500','22000','26500','31000','35000','39500','44000','66000','88000','100000','200000','400000','600000','800000','1000000');
var Cost_5_1602 = new Array('4000','8000','11000','15000','18000','22000','26000','29000','33000','36000','54000','72000','90000','180000','360000','540000','720000','900000');
var Cost_5_1603 = new Array('5000','10000','14000','18000','22000','27000','32000','36000','40000','44000','66000','88000','110000','220000','440000','660000','880000','1100000');
var Cost_5_1604 = new Array('5000','10000','14000','18000','22000','27000','32000','36000','40000','44000','66000','88000','110000','220000','440000','660000','880000','1100000');
var Cost_5_1605 = new Array('5500','11000','16000','20000','25000','30500','36000','41000','45000','50000','75000','100000','120000','240000','480000','720000','960000','1200000');
var Cost_5_1606 = new Array('6500','13000','19000','24000','30000','36500','43000','49000','54000','60000','90000','120000','140000','280000','560000','840000','1120000','1400000');
var Cost_5_1607 = new Array('6500','13000','19000','24000','30000','36500','43000','49000','54000','60000','90000','120000','140000','280000','560000','840000','1120000','1400000');
var Cost_5_1608 = new Array('5500','11000','16000','20000','25000','30500','36000','41000','45000','50000','75000','100000','120000','240000','480000','720000','960000','1200000');
var Cost_5_1609 = new Array('6500','13000','19000','24000','30000','36500','43000','49000','54000','60000','90000','120000','140000','280000','560000','840000','1120000','1400000');
var Cost_5_1610 = new Array('6500','13000','19000','24000','30000','36500','43000','49000','54000','60000','90000','120000','140000','280000','560000','840000','1120000','1400000');
var Cost_5_1611 = new Array('5500','11000','16000','20000','25000','30500','36000','41000','45000','50000','75000','100000','120000','240000','480000','720000','960000','1200000');
var Cost_5_1612 = new Array('6500','13000','19000','24000','30000','36500','43000','49000','54000','60000','90000','120000','140000','280000','560000','840000','1120000','1400000');
var Cost_5_1613 = new Array('6500','13000','19000','24000','30000','36500','43000','49000','54000','60000','90000','120000','140000','280000','560000','840000','1120000','1400000');
var Cost_5_1614 = new Array('5500','11000','16000','20000','25000','30500','36000','41000','45000','50000','75000','100000','120000','240000','480000','720000','960000','1200000');
var Cost_5_1615 = new Array('6500','13000','19000','24000','30000','36500','43000','49000','54000','60000','90000','120000','140000','280000','560000','840000','1120000','1400000');
var Cost_5_1616 = new Array('6500','13000','19000','24000','30000','36500','43000','49000','54000','60000','90000','120000','140000','280000','560000','840000','1120000','1400000');
var Cost_5_1617 = new Array('5500','11000','16000','20000','25000','30500','36000','41000','45000','50000','75000','100000','120000','240000','480000','720000','960000','1200000');
var Cost_5_1618 = new Array('6500','13000','19000','24000','30000','36500','43000','49000','54000','60000','90000','120000','140000','280000','560000','840000','1120000','1400000');
var Cost_5_1619 = new Array('6500','13000','19000','24000','30000','36500','43000','49000','54000','60000','90000','120000','140000','280000','560000','840000','1120000','1400000');
var Cost_5_1620 = new Array('7500','15000','22000','28000','35000','42500','50000','57000','63000','70000','105000','140000','170000','340000','680000','1020000','1360000','1700000');
var Cost_5_1621 = new Array('8500','17000','25000','32000','40000','48500','57000','65000','72000','80000','120000','160000','195000','390000','780000','1170000','1560000','1950000');
var Cost_5_1622 = new Array('8500','17000','25000','32000','40000','48500','57000','65000','72000','80000','120000','160000','195000','390000','780000','1170000','1560000','1950000');
var Cost_5_1623 = new Array('7500','15000','22000','28000','35000','42500','50000','57000','63000','70000','105000','140000','170000','340000','680000','1020000','1360000','1700000');
var Cost_5_1624 = new Array('8500','17000','25000','32000','40000','48500','57000','65000','72000','80000','120000','160000','195000','390000','780000','1170000','1560000','1950000');
var Cost_5_1625 = new Array('8500','17000','25000','32000','40000','48500','57000','65000','72000','80000','120000','160000','195000','390000','780000','1170000','1560000','1950000');
var Cost_5_1626 = new Array('4000','8000','11000','15000','18000','22000','26000','29000','33000','36000','54000','72000','90000','180000','360000','540000','720000','900000');
var Cost_5_1627 = new Array('5000','10000','14000','18000','22000','27000','32000','36000','40000','44000','66000','88000','110000','220000','440000','660000','880000','1100000');
var Cost_5_1628 = new Array('5000','10000','14000','18000','22000','27000','32000','36000','40000','44000','66000','88000','110000','220000','440000','660000','880000','1100000');
var Cost_5_1714 = new Array('6000','12000','17400','23200','29000','34800','40600','46400','52200','58000','87000','116000','135000','270000','540000','810000','1080000','1350000');
var Cost_5_1715 = new Array('7000','14000','20400','27200','34000','40800','47600','54400','61200','68000','102000','136000','155000','310000','620000','930000','1240000','1550000');
var Quantity_5_count = 18;
var Quantity_5 = new Array('200','400','600','800','1000','1200','1400','1600','1800','2000','3000','4000','5000','10000','20000','30000','40000','50000');
var Kind_5_count = 80;
var Kind_5 = new Array('스타단면4도','스타양면5도','스타양면8도','키칼단면4도','키칼양면5도','키칼양면8도','그레단면4도','그레양면5도','그레양면8도','빌리단면4도','빌리양면5도','빌리양면8도','머쉬단면4도','머쉬양면5도','머쉬양면8도','스코단면4도','스코양면5도','스코양면8도','팝셋단면4도','팝셋양면5도','팝셋양면8도','유포단면4도','유포양면5도','유포양면8도','카멜단면4도','카멜양면5도','카멜양면8도','컨셉단면4도','컨셉양면5도','컨셉양면8도','키칼아이스골드단면4도','키칼아이스골드양면5도','키칼아이스골드양면8도','스타골드단면4도','스타골드양면5도','스타골드양면8도','라레단면4도','라레양면5도','라레양면8도','누브단면4도','누브양면5도','누브양면8도','탄트단면4도','탄트양면5도','탄트양면8도','화인라레단면4도','화인라레양면5도','화인라레양면8도','랑데뷰화이트단면4도','랑데뷰화이트양면5도','랑데뷰화이트양면8도','앙코르단면4도','앙코르양면5도','앙코르양면8도','마제스틱단면4도','마제스틱양면5도','마제스틱양면8도','스타더스트단면4도','스타더스트양면5도','스타더스트양면8도','루프단면4도','루프양면5도','루프양면8도','크라프트단면4도','크라프트양면5도','크라프트양면8도','대례지단면4도','대례지양면5도','대례지양면8도','라레화이트펄단면4도','라레화이트펄양면5도','라레화이트펄양면8도','라레골드펄단면4도','라레골드펄양면5도','라레골드펄양면8도','양면무늬탄트단면4도','양면무늬탄트양면5도','양면무늬탄트양면8도','띤또레또단면4도','띤또레또양면8도');
var Kind_5_Code = new Array('30','31','32','33','34','35','36','37','38','39','40','41','42','43','44','45','46','47','48','49','50','51','52','53','54','55','56','57','58','59','60','61','62','63','64','65','1011','1012','1013','1014','1015','1016','1017','1018','1019','1367','1368','1369','1370','1371','1372','1602','1603','1604','1605','1606','1607','1608','1609','1610','1611','1612','1613','1614','1615','1616','1617','1618','1619','1620','1621','1622','1623','1624','1625','1626','1627','1628','1714','1715');
var Cost_6_66 = new Array('8000','16000','24000','32000','40000','200000');
var Cost_6_67 = new Array('9000','18000','27000','36000','45000','225000');
var Cost_6_68 = new Array('9000','18000','27000','36000','45000','225000');
var Cost_6_69 = new Array('12000','24000','36000','48000','59000','270000');
var Cost_6_70 = new Array('35000','65000','97000','125000','144000','720000');
var Cost_6_71 = new Array('41000','74000','111000','138000','161000','777000');
var Cost_6_72 = new Array('41000','74000','111000','138000','161000','777000');
var Cost_6_73 = new Array('26000','53000','80000','106000','130000','650000');
var Cost_6_74 = new Array('32000','60000','88000','114000','140000','700000');
var Cost_6_75 = new Array('32000','60000','88000','114000','140000','700000');
var Cost_6_76 = new Array('32000','60000','88000','114000','140000','700000');
var Cost_6_77 = new Array('38000','66000','101000','131000','164000','800000');
var Cost_6_78 = new Array('38000','66000','101000','131000','164000','800000');
var Cost_6_79 = new Array('20000','40000','56000','79000','99000','495000');
var Cost_6_80 = new Array('26000','50000','62000','86000','105000','525000');
var Cost_6_81 = new Array('26000','50000','62000','86000','105000','525000');
var Cost_6_82 = new Array('26000','50000','62000','86000','105000','0');
var Cost_6_83 = new Array('26000','50000','62000','86000','105000','0');
var Cost_6_84 = new Array('26000','50000','62000','86000','105000','0');
var Cost_6_85 = new Array('23000','46000','69000','92000','115000','575000');
var Cost_6_86 = new Array('25000','50000','75000','100000','125000','625000');
var Cost_6_87 = new Array('25000','50000','75000','100000','125000','625000');
var Cost_6_88 = new Array('23000','46000','69000','92000','115000','575000');
var Cost_6_89 = new Array('25000','50000','75000','100000','125000','625000');
var Cost_6_90 = new Array('25000','50000','75000','100000','125000','625000');
var Cost_6_91 = new Array('0','0','0','0','0','0');
var Cost_6_92 = new Array('0','0','0','0','0','0');
var Cost_6_93 = new Array('0','0','0','0','0','0');
var Cost_6_1115 = new Array('15000','27000','40000','53000','66000','320000');
var Cost_6_1358 = new Array('8000','16000','24000','32000','40000','200000');
var Cost_6_1359 = new Array('9000','18000','27000','36000','45000','225000');
var Cost_6_1360 = new Array('9000','18000','27000','36000','45000','225000');
var Cost_6_1436 = new Array('15000','27000','40000','53000','66000','320000');
var Cost_6_1437 = new Array('15000','27000','40000','53000','66000','320000');
var Cost_6_1463 = new Array('27000','54000','81000','108000','135000','675000');
var Cost_6_1464 = new Array('32000','64000','96000','128000','160000','800000');
var Cost_6_1465 = new Array('32000','64000','96000','128000','160000','800000');
var Cost_6_1466 = new Array('27000','54000','81000','108000','135000','675000');
var Cost_6_1467 = new Array('32000','64000','96000','128000','160000','800000');
var Cost_6_1468 = new Array('32000','64000','96000','128000','160000','800000');
var Cost_6_1469 = new Array('37000','74000','111000','148000','185000','925000');
var Cost_6_1470 = new Array('42000','84000','126000','168000','210000','1050000');
var Cost_6_1471 = new Array('42000','84000','126000','168000','210000','1050000');
var Cost_6_1472 = new Array('37000','74000','111000','148000','185000','925000');
var Cost_6_1473 = new Array('42000','84000','126000','168000','210000','1050000');
var Cost_6_1474 = new Array('42000','84000','126000','168000','210000','1050000');
var Quantity_6_count = 6;
var Quantity_6 = new Array('200','400','600','800','1000','5000');
var Kind_6_count = 46;
var Kind_6 = new Array('화이트무광단면4도','화이트무광양면5도','화이트무광양면8도','누드단면4도','골드플러스단면4도','골드플러스양면5도','골드플러스양면8도','실버플러스단면4도','실버플러스양면5도','실버플러스양면8도','골드단면4도','골드양면5도','골드양면8도','실버단면4도','실버양면5도','실버양면8도','거울단면4도','거울양면5도','거울양면8도','금펄단면4도','금펄양면5도','금펄양면8도','은펄단면4도','은펄양면5도','은펄양면8도','레인보우단면4도','레인보우양면5도','레인보우양면8도','누드플러스','화이트유광단면4도','화이트유광양면5도','화이트유광양면8도','누드금펄단면4도','누드은펄단면4도','MK은펄플러스단면4도','MK은펄플러스양면5도','MK은펄플러스양면8도','MK금펄플러스단면4도','MK금펄플러스양면5도','MK금펄플러스양면8도','MK헤어라인실버단면4도','MK헤어라인실버양면5도','MK헤어라인실버양면8도','MK헤어라인골드단면4도','MK헤어라인골드양면5도','MK헤어라인골드양면8도');
var Kind_6_Code = new Array('66','67','68','69','70','71','72','73','74','75','76','77','78','79','80','81','82','83','84','85','86','87','88','89','90','91','92','93','1115','1358','1359','1360','1436','1437','1463','1464','1465','1466','1467','1468','1469','1470','1471','1472','1473','1474');
var Cost_7_94 = new Array('3000','6000','8700','11600','14500','17400','20300','23200','26100','29000','43500','58000','70000','140000','280000','420000','560000','700000');
var Cost_7_95 = new Array('4000','8000','11700','15600','19500','23400','27300','31200','35100','39000','58500','78000','95000','190000','380000','570000','760000','950000');
var Cost_7_96 = new Array('4000','8000','11700','15600','19500','23400','27300','31200','35100','39000','58500','78000','95000','190000','380000','570000','760000','950000');
var Cost_7_97 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_7_1475 = new Array('2200','4000','6000','8000','10000','12000','14000','16000','18000','20000','30000','40000','50000','100000','200000','300000','400000','500000');
var Cost_7_1476 = new Array('2700','5000','7500','10000','12500','15000','17500','20000','22500','25000','37500','50000','62500','125000','250000','375000','500000','625000');
var Cost_7_1477 = new Array('2700','5000','7500','10000','12500','15000','17500','20000','22500','25000','37500','50000','62500','125000','250000','375000','500000','625000');
var Cost_7_1657 = new Array('5500','11000','16000','20000','25000','30500','36000','41000','45000','50000','75000','100000','120000','240000','480000','720000','960000','1200000');
var Cost_7_1658 = new Array('6500','13000','19000','24000','30000','36500','43000','49000','54000','60000','90000','120000','140000','280000','560000','840000','1120000','1400000');
var Cost_7_1659 = new Array('5500','11000','16000','20000','25000','30500','36000','41000','45000','50000','75000','100000','120000','240000','480000','720000','960000','1200000');
var Cost_7_1660 = new Array('6500','13000','19000','24000','30000','36500','43000','49000','54000','60000','90000','120000','140000','280000','560000','840000','1120000','1400000');
var Quantity_7_count = 18;
var Quantity_7 = new Array('200','400','600','800','1000','1200','1400','1600','1800','2000','3000','4000','5000','10000','20000','30000','40000','50000');
var Kind_7_count = 11;
var Kind_7 = new Array('300화인스노우단면4도','300화인스노우양면5도','300화인스노우양면8도','스피드카드4도','270울트라화이트단면4도','270울트라화이트양면5도','270울트라화이트양면8도','350엑스트라퓨어단면4도','350엑스트라퓨어양면8도','350엑스트라매트단면4도','350엑스트라매트양면8도');
var Kind_7_Code = new Array('94','95','96','97','1475','1476','1477','1657','1658','1659','1660');
var Cost_8_98 = new Array('9000','18000','27000','36000','45000','54000','63000','72000','81000','90000');
var Cost_8_99 = new Array('13500','27000','40500','54000','67500','81000','94500','108000','121500','135000');
var Cost_8_100 = new Array('12000','24000','36000','48000','60000','72000','84000','96000','108000','120000');
var Cost_8_101 = new Array('18000','36000','54000','72000','90000','108000','126000','144000','162000','180000');
var Cost_8_102 = new Array('9000','18000','27000','36000','45000','54000','63000','72000','81000','90000');
var Cost_8_103 = new Array('13500','27000','40500','54000','67500','81000','94500','108000','121500','135000');
var Cost_8_104 = new Array('9000','18000','27000','36000','45000','54000','63000','72000','81000','90000');
var Cost_8_105 = new Array('13500','27000','40500','54000','67500','81000','94500','108000','121500','135000');
var Cost_8_106 = new Array('9000','18000','27000','36000','45000','54000','63000','72000','81000','90000');
var Cost_8_107 = new Array('13500','27000','40500','54000','67500','81000','94500','108000','121500','135000');
var Cost_8_108 = new Array('12000','24000','36000','48000','60000','72000','84000','96000','108000','120000');
var Cost_8_109 = new Array('18000','36000','54000','72000','90000','108000','126000','144000','162000','180000');
var Cost_8_110 = new Array('9000','18000','27000','36000','45000','54000','63000','72000','81000','90000');
var Cost_8_111 = new Array('13500','27000','40500','54000','67500','81000','94500','108000','121500','135000');
var Cost_8_112 = new Array('9000','18000','27000','36000','45000','54000','63000','72000','81000','90000');
var Cost_8_113 = new Array('13500','27000','40500','54000','67500','81000','94500','108000','121500','135000');
var Cost_8_114 = new Array('10500','19500','29300','39000','48800','58500','68300','78000','87800','97500');
var Cost_8_115 = new Array('13500','27000','40500','54000','67500','81000','94500','108000','121500','135000');
var Cost_8_116 = new Array('14000','26000','39000','52000','65000','78000','91000','104000','117000','130000');
var Cost_8_117 = new Array('18000','36000','54000','72000','90000','108000','126000','144000','162000','180000');
var Cost_8_118 = new Array('10500','19500','29300','39000','48800','58500','68300','78000','87800','97500');
var Cost_8_119 = new Array('13500','27000','40500','54000','67500','81000','94500','108000','121500','135000');
var Cost_8_120 = new Array('10500','19500','29300','39000','48800','58500','68300','78000','87800','97500');
var Cost_8_121 = new Array('13500','27000','40500','54000','67500','81000','94500','108000','121500','135000');
var Cost_8_122 = new Array('10500','19500','29300','39000','48800','58500','68300','78000','87800','97500');
var Cost_8_123 = new Array('13500','27000','40500','54000','67500','81000','94500','108000','121500','135000');
var Cost_8_124 = new Array('14000','26000','39000','52000','65000','78000','91000','104000','117000','130000');
var Cost_8_125 = new Array('18000','36000','54000','72000','90000','108000','126000','144000','162000','180000');
var Cost_8_126 = new Array('10500','19500','29300','39000','48800','58500','68300','78000','87800','97500');
var Cost_8_127 = new Array('13500','27000','40500','54000','67500','81000','94500','108000','121500','135000');
var Cost_8_128 = new Array('10500','19500','29300','39000','48800','58500','68300','78000','87800','97500');
var Cost_8_129 = new Array('13500','27000','40500','54000','67500','81000','94500','108000','121500','135000');
var Quantity_8_count = 10;
var Quantity_8 = new Array('500','1000','1500','2000','2500','3000','3500','4000','4500','5000');
var Kind_8_count = 32;
var Kind_8 = new Array('비코팅160x70단면','비코팅160x70양면','비코팅170x80단면','비코팅170x80양면','비코팅150x70단면','비코팅150x70양면','비코팅155x70단면','비코팅155x70양면','비코팅146x76단면','비코팅146x76양면','비코팅170x70단면','비코팅170x70양면','비코팅156x74단면','비코팅156x74양면','비코팅144x64단면','비코팅144x64양면','코팅160x70단면','코팅160x70양면','코팅170x80단면','코팅170x80양면','코팅150x70단면','코팅150x70양면','코팅155x70단면','코팅155x70양면','코팅146x76단면','코팅146x76양면','코팅170x70단면','코팅170x70양면','코팅156x74단면','코팅156x74양면','코팅144x64단면','코팅144x64양면');
var Kind_8_Code = new Array('98','99','100','101','102','103','104','105','106','107','108','109','110','111','112','113','114','115','116','117','118','119','120','121','122','123','124','125','126','127','128','129');
var Cost_9_130 = new Array('32000','64000','96000','128000','160000','192000','224000','256000','288000','320000');
var Cost_9_131 = new Array('48000','96000','144000','192000','240000','288000','336000','384000','432000','480000');
var Cost_9_132 = new Array('32000','64000','96000','128000','160000','192000','224000','256000','288000','320000');
var Cost_9_133 = new Array('48000','96000','144000','192000','240000','288000','336000','384000','432000','480000');
var Cost_9_134 = new Array('24000','48000','72000','96000','120000','144000','168000','192000','216000','240000');
var Cost_9_135 = new Array('36000','72000','108000','144000','180000','216000','252000','288000','324000','360000');
var Cost_9_136 = new Array('32000','64000','96000','128000','160000','192000','224000','256000','288000','320000');
var Cost_9_137 = new Array('48000','96000','144000','192000','240000','288000','336000','384000','432000','480000');
var Cost_9_138 = new Array('24000','48000','72000','96000','120000','144000','168000','192000','216000','240000');
var Cost_9_139 = new Array('36000','72000','108000','144000','180000','216000','252000','288000','324000','360000');
var Cost_9_140 = new Array('32000','64000','96000','128000','160000','192000','224000','256000','288000','320000');
var Cost_9_141 = new Array('48000','96000','144000','192000','240000','288000','336000','384000','432000','480000');
var Cost_9_142 = new Array('32000','64000','96000','128000','160000','192000','224000','256000','288000','320000');
var Cost_9_143 = new Array('48000','96000','144000','192000','240000','288000','336000','384000','432000','480000');
var Cost_9_144 = new Array('24000','48000','72000','96000','120000','144000','168000','192000','216000','240000');
var Cost_9_145 = new Array('36000','72000','108000','144000','180000','216000','252000','288000','324000','360000');
var Cost_9_146 = new Array('32000','64000','96000','128000','160000','192000','224000','256000','288000','320000');
var Cost_9_147 = new Array('48000','96000','144000','192000','240000','288000','336000','384000','432000','480000');
var Cost_9_148 = new Array('32000','64000','96000','128000','160000','192000','224000','256000','288000','320000');
var Cost_9_149 = new Array('48000','96000','144000','192000','240000','288000','336000','384000','432000','480000');
var Cost_9_150 = new Array('24000','48000','72000','96000','120000','144000','168000','192000','216000','240000');
var Cost_9_151 = new Array('36000','72000','108000','144000','180000','216000','252000','288000','324000','360000');
var Cost_9_152 = new Array('32000','64000','96000','128000','160000','192000','224000','256000','288000','320000');
var Cost_9_153 = new Array('48000','96000','144000','192000','240000','288000','336000','384000','432000','480000');
var Cost_9_154 = new Array('24000','48000','72000','96000','120000','144000','168000','192000','216000','240000');
var Cost_9_155 = new Array('36000','72000','108000','144000','180000','216000','252000','288000','324000','360000');
var Cost_9_156 = new Array('32000','64000','96000','128000','160000','192000','224000','256000','288000','320000');
var Cost_9_157 = new Array('48000','96000','144000','192000','240000','288000','336000','384000','432000','480000');
var Cost_9_158 = new Array('32000','64000','96000','128000','160000','192000','224000','256000','288000','320000');
var Cost_9_159 = new Array('48000','96000','144000','192000','240000','288000','336000','384000','432000','480000');
var Cost_9_160 = new Array('24000','48000','72000','96000','120000','144000','168000','192000','216000','240000');
var Cost_9_161 = new Array('36000','72000','108000','144000','180000','216000','252000','288000','324000','360000');
var Cost_9_162 = new Array('24000','44000','68000','88000','112000','132000','156000','176000','200000','220000');
var Cost_9_163 = new Array('40000','72000','112000','144000','184000','216000','256000','288000','328000','360000');
var Cost_9_164 = new Array('24000','44000','68000','88000','112000','132000','156000','176000','200000','220000');
var Cost_9_165 = new Array('40000','72000','112000','144000','184000','216000','256000','288000','328000','360000');
var Cost_9_166 = new Array('18000','33000','51000','66000','84000','99000','117000','132000','150000','165000');
var Cost_9_167 = new Array('30000','54000','84000','108000','138000','162000','192000','216000','246000','270000');
var Cost_9_168 = new Array('24000','44000','68000','88000','112000','132000','156000','176000','200000','220000');
var Cost_9_169 = new Array('40000','72000','112000','144000','184000','216000','256000','288000','328000','360000');
var Cost_9_170 = new Array('18000','33000','51000','66000','84000','99000','117000','132000','150000','165000');
var Cost_9_171 = new Array('30000','54000','84000','108000','138000','162000','192000','216000','246000','270000');
var Cost_9_172 = new Array('24000','44000','68000','88000','112000','132000','156000','176000','200000','220000');
var Cost_9_173 = new Array('40000','72000','112000','144000','184000','216000','256000','288000','328000','360000');
var Cost_9_174 = new Array('24000','44000','68000','88000','112000','132000','156000','176000','200000','220000');
var Cost_9_175 = new Array('40000','72000','112000','144000','184000','216000','256000','288000','328000','360000');
var Cost_9_176 = new Array('18000','33000','51000','66000','84000','99000','117000','132000','150000','165000');
var Cost_9_177 = new Array('30000','54000','84000','108000','138000','162000','192000','216000','246000','270000');
var Quantity_9_count = 10;
var Quantity_9 = new Array('600','1200','1800','2400','3000','3600','4200','4800','5400','6000');
var Kind_9_count = 48;
var Kind_9 = new Array('라레160x70단면','라레160x70양면','라레170x80단면','라레170x80양면','라레150x70단면','라레150x70양면','라레155x70단면','라레155x70양면','라레146x76단면','라레146x76양면','라레170x70단면','라레170x70양면','라레156x74단면','라레156x74양면','라레144x64단면','라레144x64양면','누브160x70단면','누브160x70양면','누브170x80단면','누브170x80양면','누브150x70단면','누브150x70양면','누브155x70단면','누브155x70양면','누브146x76단면','누브146x76양면','누브170x70단면','누브170x70양면','누브156x74단면','누브156x74양면','누브144x64단면','누브144x64양면','탄트160x70단면','탄트160x70양면','탄트170x80단면','탄트170x80양면','탄트150x70단면','탄트150x70양면','탄트155x70단면','탄트155x70양면','탄트146x76단면','탄트146x76양면','탄트170x70단면','탄트170x70양면','탄트156x74단면','탄트156x74양면','탄트144x64단면','탄트144x64양면');
var Kind_9_Code = new Array('130','131','132','133','134','135','136','137','138','139','140','141','142','143','144','145','146','147','148','149','150','151','152','153','154','155','156','157','158','159','160','161','162','163','164','165','166','167','168','169','170','171','172','173','174','175','176','177');
var Cost_10_178 = new Array('22000','40000','60000','80000','106000','127200','148400','169600','190800','212000','318000','424000','530000','1060000','2120000','3180000','4240000','5300000');
var Cost_10_179 = new Array('26000','52000','78000','104000','130000','156000','182000','208000','234000','260000','390000','520000','650000','1300000','2600000','3900000','5200000','6500000');
var Cost_10_180 = new Array('22000','40000','60000','80000','106000','127200','148400','169600','190800','212000','318000','424000','530000','1060000','2120000','3180000','4240000','5300000');
var Cost_10_181 = new Array('26000','52000','78000','104000','130000','156000','182000','208000','234000','260000','390000','520000','650000','1300000','2600000','3900000','5200000','6500000');
var Cost_10_182 = new Array('16500','30000','45000','60000','79500','95400','111300','127200','143100','159000','238500','318000','397500','795000','1590000','2385000','3180000','3975000');
var Cost_10_183 = new Array('19500','39000','58500','78000','97500','117000','136500','156000','175500','195000','292500','390000','487500','975000','1950000','2925000','3900000','4875000');
var Cost_10_184 = new Array('22000','40000','60000','80000','106000','127200','148400','169600','190800','212000','318000','424000','530000','1060000','2120000','3180000','4240000','5300000');
var Cost_10_185 = new Array('26000','52000','78000','104000','130000','156000','182000','208000','234000','260000','390000','520000','650000','1300000','2600000','3900000','5200000','6500000');
var Cost_10_186 = new Array('16500','30000','45000','60000','79500','95400','111300','127200','143100','159000','238500','318000','397500','795000','1590000','2385000','3180000','3975000');
var Cost_10_187 = new Array('19500','39000','58500','78000','97500','117000','136500','156000','175500','195000','292500','390000','487500','975000','1950000','2925000','3900000','4875000');
var Cost_10_188 = new Array('22000','40000','60000','80000','106000','127200','148400','169600','190800','212000','318000','424000','530000','1060000','2120000','3180000','4240000','5300000');
var Cost_10_189 = new Array('26000','52000','78000','104000','130000','156000','182000','208000','234000','260000','390000','520000','650000','1300000','2600000','3900000','5200000','6500000');
var Cost_10_190 = new Array('22000','40000','60000','80000','106000','127200','148400','169600','190800','212000','318000','424000','530000','1060000','2120000','3180000','4240000','5300000');
var Cost_10_191 = new Array('26000','52000','78000','104000','130000','156000','182000','208000','234000','260000','390000','520000','650000','1300000','2600000','3900000','5200000','6500000');
var Cost_10_192 = new Array('16500','30000','45000','60000','79500','95400','111300','127200','143100','159000','238500','318000','397500','795000','1590000','2385000','3180000','3975000');
var Cost_10_193 = new Array('19500','39000','58500','78000','97500','117000','136500','156000','175500','195000','292500','390000','487500','975000','1950000','2925000','3900000','4875000');
var Cost_10_194 = new Array('22000','40000','60000','80000','106000','127200','148400','169600','190800','212000','318000','424000','530000','1060000','2120000','3180000','4240000','5300000');
var Cost_10_195 = new Array('26000','52000','78000','104000','130000','156000','182000','208000','234000','260000','390000','520000','650000','1300000','2600000','3900000','5200000','6500000');
var Cost_10_196 = new Array('22000','40000','60000','80000','106000','127200','148400','169600','190800','212000','318000','424000','530000','1060000','2120000','3180000','4240000','5300000');
var Cost_10_197 = new Array('26000','52000','78000','104000','130000','156000','182000','208000','234000','260000','390000','520000','650000','1300000','2600000','3900000','5200000','6500000');
var Cost_10_198 = new Array('16500','30000','45000','60000','79500','95400','111300','127200','143100','159000','238500','318000','397500','795000','1590000','2385000','3180000','3975000');
var Cost_10_199 = new Array('19500','39000','58500','78000','97500','117000','136500','156000','175500','195000','292500','390000','487500','975000','1950000','2925000','3900000','4875000');
var Cost_10_200 = new Array('22000','40000','60000','80000','106000','127200','148400','169600','190800','212000','318000','424000','530000','1060000','2120000','3180000','4240000','5300000');
var Cost_10_201 = new Array('26000','52000','78000','104000','130000','156000','182000','208000','234000','260000','390000','520000','650000','1300000','2600000','3900000','5200000','6500000');
var Cost_10_202 = new Array('16500','30000','45000','60000','79500','95400','111300','127200','143100','159000','238500','318000','397500','795000','1590000','2385000','3180000','3975000');
var Cost_10_203 = new Array('19500','39000','58500','78000','97500','117000','136500','156000','175500','195000','292500','390000','487500','975000','1950000','2925000','3900000','4875000');
var Cost_10_204 = new Array('22000','40000','60000','80000','106000','127200','148400','169600','190800','212000','318000','424000','530000','1060000','2120000','3180000','4240000','5300000');
var Cost_10_205 = new Array('26000','52000','78000','104000','130000','156000','182000','208000','234000','260000','390000','520000','650000','1300000','2600000','3900000','5200000','6500000');
var Cost_10_206 = new Array('22000','40000','60000','80000','106000','127200','148400','169600','190800','212000','318000','424000','530000','1060000','2120000','3180000','4240000','5300000');
var Cost_10_207 = new Array('26000','52000','78000','104000','130000','156000','182000','208000','234000','260000','390000','520000','650000','1300000','2600000','3900000','5200000','6500000');
var Cost_10_208 = new Array('16500','30000','45000','60000','79500','95400','111300','127200','143100','159000','238500','318000','397500','795000','1590000','2385000','3180000','3975000');
var Cost_10_209 = new Array('19500','39000','58500','78000','97500','117000','136500','156000','175500','195000','292500','390000','487500','975000','1950000','2925000','3900000','4875000');
var Cost_10_210 = new Array('16000','32000','48000','64000','72000','86400','100800','115200','129600','144000','216000','288000','360000','720000','1440000','2160000','2880000','3600000');
var Cost_10_211 = new Array('20000','40000','60000','80000','88000','105600','123200','140800','158400','176000','264000','352000','440000','880000','1760000','2640000','3520000','4400000');
var Cost_10_212 = new Array('16000','32000','48000','64000','72000','86400','100800','115200','129600','144000','216000','288000','360000','720000','1440000','2160000','2880000','3600000');
var Cost_10_213 = new Array('20000','40000','60000','80000','88000','105600','123200','140800','158400','176000','264000','352000','440000','880000','1760000','2640000','3520000','4400000');
var Cost_10_214 = new Array('12000','24000','36000','48000','54000','64800','75600','86400','97200','108000','162000','216000','270000','540000','1080000','1620000','2160000','2700000');
var Cost_10_215 = new Array('15000','30000','45000','60000','66000','79200','92400','105600','118800','132000','198000','264000','330000','660000','1320000','1980000','2640000','3300000');
var Cost_10_216 = new Array('16000','32000','48000','64000','72000','86400','100800','115200','129600','144000','216000','288000','360000','720000','1440000','2160000','2880000','3600000');
var Cost_10_217 = new Array('20000','40000','60000','80000','88000','105600','123200','140800','158400','176000','264000','352000','440000','880000','1760000','2640000','3520000','4400000');
var Cost_10_218 = new Array('12000','24000','36000','48000','54000','64800','75600','86400','97200','108000','162000','216000','270000','540000','1080000','1620000','2160000','2700000');
var Cost_10_219 = new Array('15000','30000','45000','60000','66000','79200','92400','105600','118800','132000','198000','264000','330000','660000','1320000','1980000','2640000','3300000');
var Cost_10_220 = new Array('16000','32000','48000','64000','72000','86400','100800','115200','129600','144000','216000','288000','360000','720000','1440000','2160000','2880000','3600000');
var Cost_10_221 = new Array('20000','40000','60000','80000','88000','105600','123200','140800','158400','176000','264000','352000','440000','880000','1760000','2640000','3520000','4400000');
var Cost_10_222 = new Array('16000','32000','48000','64000','72000','86400','100800','115200','129600','144000','216000','288000','360000','720000','1440000','2160000','2880000','3600000');
var Cost_10_223 = new Array('20000','40000','60000','80000','88000','105600','123200','140800','158400','176000','264000','352000','440000','880000','1760000','2640000','3520000','4400000');
var Cost_10_224 = new Array('12000','24000','36000','48000','54000','64800','75600','86400','97200','108000','162000','216000','270000','540000','1080000','1620000','2160000','2700000');
var Cost_10_225 = new Array('15000','30000','45000','60000','66000','79200','92400','105600','118800','132000','198000','264000','330000','660000','1320000','1980000','2640000','3300000');
var Quantity_10_count = 18;
var Quantity_10 = new Array('200','400','600','800','1000','1200','1400','1600','1800','2000','3000','4000','5000','10000','20000','30000','40000','50000');
var Kind_10_count = 48;
var Kind_10 = new Array('스타160x70단면','스타160x70양면','스타170x80단면','스타170x80양면','스타150x70단면','스타150x70양면','스타155x70단면','스타155x70양면','스타146x76단면','스타146x76양면','스타170x70단면','스타170x70양면','스타156x74단면','스타156x74양면','스타144x64단면','스타144x64양면','키칼160x70단면','키칼160x70양면','키칼170x80단면','키칼170x80양면','키칼150x70단면','키칼150x70양면','키칼155x70단면','키칼155x70양면','키칼146x76단면','키칼146x76양면','키칼170x70단면','키칼170x70양면','키칼156x74단면','키칼156x74양면','키칼144x64단면','키칼144x64양면','그레160x70단면','그레160x70양면','그레170x80단면','그레170x80양면','그레150x70단면','그레150x70양면','그레155x70단면','그레155x70양면','그레146x76단면','그레146x76양면','그레170x70단면','그레170x70양면','그레156x74단면','그레156x74양면','그레144x64단면','그레144x64양면');
var Kind_10_Code = new Array('178','179','180','181','182','183','184','185','186','187','188','189','190','191','192','193','194','195','196','197','198','199','200','201','202','203','204','205','206','207','208','209','210','211','212','213','214','215','216','217','218','219','220','221','222','223','224','225');
var Cost_11_226 = new Array('16000','32000','48000','64000','72000','86400','100800','115200','129600','144000','216000','288000','360000','720000','1440000','2160000','2880000','3600000');
var Cost_11_227 = new Array('20000','40000','60000','80000','88000','105600','123200','140800','158400','176000','264000','352000','440000','880000','1760000','2640000','3520000','4400000');
var Cost_11_228 = new Array('16000','32000','48000','64000','72000','86400','100800','115200','129600','144000','216000','288000','360000','720000','1440000','2160000','2880000','3600000');
var Cost_11_229 = new Array('20000','40000','60000','80000','88000','105600','123200','140800','158400','176000','264000','352000','440000','880000','1760000','2640000','3520000','4400000');
var Cost_11_230 = new Array('12000','24000','36000','48000','54000','64800','75600','86400','97200','108000','162000','216000','270000','540000','1080000','1620000','2160000','2700000');
var Cost_11_231 = new Array('15000','30000','45000','60000','66000','79200','92400','105600','118800','132000','198000','264000','330000','660000','1320000','1980000','2640000','3300000');
var Cost_11_232 = new Array('16000','32000','48000','64000','72000','86400','100800','115200','129600','144000','216000','288000','360000','720000','1440000','2160000','2880000','3600000');
var Cost_11_233 = new Array('20000','40000','60000','80000','88000','105600','123200','140800','158400','176000','264000','352000','440000','880000','1760000','2640000','3520000','4400000');
var Cost_11_234 = new Array('12000','24000','36000','48000','54000','64800','75600','86400','97200','108000','162000','216000','270000','540000','1080000','1620000','2160000','2700000');
var Cost_11_235 = new Array('15000','30000','45000','60000','66000','79200','92400','105600','118800','132000','198000','264000','330000','660000','1320000','1980000','2640000','3300000');
var Cost_11_236 = new Array('16000','32000','48000','64000','72000','86400','100800','115200','129600','144000','216000','288000','360000','720000','1440000','2160000','2880000','3600000');
var Cost_11_237 = new Array('20000','40000','60000','80000','88000','105600','123200','140800','158400','176000','264000','352000','440000','880000','1760000','2640000','3520000','4400000');
var Cost_11_238 = new Array('16000','32000','48000','64000','72000','86400','100800','115200','129600','144000','216000','288000','360000','720000','1440000','2160000','2880000','3600000');
var Cost_11_239 = new Array('20000','40000','60000','80000','88000','105600','123200','140800','158400','176000','264000','352000','440000','880000','1760000','2640000','3520000','4400000');
var Cost_11_240 = new Array('12000','24000','36000','48000','54000','64800','75600','86400','97200','108000','162000','216000','270000','540000','1080000','1620000','2160000','2700000');
var Cost_11_241 = new Array('15000','30000','45000','60000','66000','79200','92400','105600','118800','132000','198000','264000','330000','660000','1320000','1980000','2640000','3300000');
var Cost_11_242 = new Array('16000','32000','48000','64000','72000','86400','100800','115200','129600','144000','216000','288000','360000','720000','1440000','2160000','2880000','3600000');
var Cost_11_243 = new Array('20000','40000','60000','80000','88000','105600','123200','140800','158400','176000','264000','352000','440000','880000','1760000','2640000','3520000','4400000');
var Cost_11_244 = new Array('16000','32000','48000','64000','72000','86400','100800','115200','129600','144000','216000','288000','360000','720000','1440000','2160000','2880000','3600000');
var Cost_11_245 = new Array('20000','40000','60000','80000','88000','105600','123200','140800','158400','176000','264000','352000','440000','880000','1760000','2640000','3520000','4400000');
var Cost_11_246 = new Array('12000','24000','36000','48000','54000','64800','75600','86400','97200','108000','162000','216000','270000','540000','1080000','1620000','2160000','2700000');
var Cost_11_247 = new Array('15000','30000','45000','60000','66000','79200','92400','105600','118800','132000','198000','264000','330000','660000','1320000','1980000','2640000','3300000');
var Cost_11_248 = new Array('16000','32000','48000','64000','72000','86400','100800','115200','129600','144000','216000','288000','360000','720000','1440000','2160000','2880000','3600000');
var Cost_11_249 = new Array('20000','40000','60000','80000','88000','105600','123200','140800','158400','176000','264000','352000','440000','880000','1760000','2640000','3520000','4400000');
var Cost_11_250 = new Array('12000','24000','36000','48000','54000','64800','75600','86400','97200','108000','162000','216000','270000','540000','1080000','1620000','2160000','2700000');
var Cost_11_251 = new Array('15000','30000','45000','60000','66000','79200','92400','105600','118800','132000','198000','264000','330000','660000','1320000','1980000','2640000','3300000');
var Cost_11_252 = new Array('16000','32000','48000','64000','72000','86400','100800','115200','129600','144000','216000','288000','360000','720000','1440000','2160000','2880000','3600000');
var Cost_11_253 = new Array('20000','40000','60000','80000','88000','105600','123200','140800','158400','176000','264000','352000','440000','880000','1760000','2640000','3520000','4400000');
var Cost_11_254 = new Array('16000','32000','48000','64000','72000','86400','100800','115200','129600','144000','216000','288000','360000','720000','1440000','2160000','2880000','3600000');
var Cost_11_255 = new Array('20000','40000','60000','80000','88000','105600','123200','140800','158400','176000','264000','352000','440000','880000','1760000','2640000','3520000','4400000');
var Cost_11_256 = new Array('12000','24000','36000','48000','54000','64800','75600','86400','97200','108000','162000','216000','270000','540000','1080000','1620000','2160000','2700000');
var Cost_11_257 = new Array('15000','30000','45000','60000','66000','79200','92400','105600','118800','132000','198000','264000','330000','660000','1320000','1980000','2640000','3300000');
var Cost_11_258 = new Array('24000','44000','66000','88000','112000','134400','156800','179200','201600','224000','336000','448000','560000','1120000','2240000','3360000','4480000','5600000');
var Cost_11_259 = new Array('28000','56000','84000','112000','136000','163200','190400','217600','244800','272000','408000','544000','680000','1360000','2720000','4080000','5440000','6800000');
var Cost_11_260 = new Array('24000','44000','66000','88000','112000','134400','156800','179200','201600','224000','336000','448000','560000','1120000','2240000','3360000','4480000','5600000');
var Cost_11_261 = new Array('28000','56000','84000','112000','136000','163200','190400','217600','244800','272000','408000','544000','680000','1360000','2720000','4080000','5440000','6800000');
var Cost_11_262 = new Array('18000','33000','49500','66000','84000','100800','117600','134400','151200','168000','252000','336000','420000','840000','1680000','2520000','3360000','4200000');
var Cost_11_263 = new Array('21000','42000','63000','84000','102000','122400','142800','163200','183600','204000','306000','408000','510000','1020000','2040000','3060000','4080000','5100000');
var Cost_11_264 = new Array('24000','44000','66000','88000','112000','134400','156800','179200','201600','224000','336000','448000','560000','1120000','2240000','3360000','4480000','5600000');
var Cost_11_265 = new Array('28000','56000','84000','112000','136000','163200','190400','217600','244800','272000','408000','544000','680000','1360000','2720000','4080000','5440000','6800000');
var Cost_11_266 = new Array('18000','33000','49500','66000','84000','100800','117600','134400','151200','168000','252000','336000','420000','840000','1680000','2520000','3360000','4200000');
var Cost_11_267 = new Array('21000','42000','63000','84000','102000','122400','142800','163200','183600','204000','306000','408000','510000','1020000','2040000','3060000','4080000','5100000');
var Cost_11_268 = new Array('24000','44000','66000','88000','112000','134400','156800','179200','201600','224000','336000','448000','560000','1120000','2240000','3360000','4480000','5600000');
var Cost_11_269 = new Array('28000','56000','84000','112000','136000','163200','190400','217600','244800','272000','408000','544000','680000','1360000','2720000','4080000','5440000','6800000');
var Cost_11_270 = new Array('24000','44000','66000','88000','112000','134400','156800','179200','201600','224000','336000','448000','560000','1120000','2240000','3360000','4480000','5600000');
var Cost_11_271 = new Array('28000','56000','84000','112000','136000','163200','190400','217600','244800','272000','408000','544000','680000','1360000','2720000','4080000','5440000','6800000');
var Cost_11_272 = new Array('18000','33000','49500','66000','84000','100800','117600','134400','151200','168000','252000','336000','420000','840000','1680000','2520000','3360000','4200000');
var Cost_11_273 = new Array('21000','42000','63000','84000','102000','122400','142800','163200','183600','204000','306000','408000','510000','1020000','2040000','3060000','4080000','5100000');
var Cost_11_1023 = new Array('16000','28000','42000','56000','68000','81600','95200','108800','122400','136000','204000','272000','340000','680000','1360000','2040000','2720000','3400000');
var Cost_11_1024 = new Array('20000','40000','60000','80000','92000','110400','128800','147200','165600','184000','276000','368000','460000','920000','1840000','2760000','3680000','4600000');
var Cost_11_1025 = new Array('16000','28000','42000','56000','68000','81600','95200','108800','122400','136000','204000','272000','340000','680000','1360000','2040000','2720000','3400000');
var Cost_11_1026 = new Array('20000','40000','60000','80000','92000','110400','128800','147200','165600','184000','276000','368000','460000','920000','1840000','2760000','3680000','4600000');
var Cost_11_1027 = new Array('12000','21000','31500','42000','51000','61200','71400','81600','91800','102000','153000','204000','255000','510000','1020000','1530000','2040000','2550000');
var Cost_11_1028 = new Array('15000','30000','45000','60000','69000','82800','96600','110400','124200','138000','207000','276000','345000','690000','1380000','2070000','2760000','3450000');
var Cost_11_1029 = new Array('16000','28000','42000','56000','68000','81600','95200','108800','122400','136000','204000','272000','340000','680000','1360000','2040000','2720000','3400000');
var Cost_11_1030 = new Array('20000','40000','60000','80000','92000','110400','128800','147200','165600','184000','276000','368000','460000','920000','1840000','2760000','3680000','4600000');
var Cost_11_1031 = new Array('12000','21000','31500','42000','51000','61200','71400','81600','91800','102000','153000','204000','255000','510000','1020000','1530000','2040000','2550000');
var Cost_11_1032 = new Array('15000','30000','45000','60000','69000','82800','96600','110400','124200','138000','207000','276000','345000','690000','1380000','2070000','2760000','3450000');
var Cost_11_1033 = new Array('16000','28000','42000','56000','68000','81600','95200','108800','122400','136000','204000','272000','340000','680000','1360000','2040000','2720000','3400000');
var Cost_11_1034 = new Array('20000','40000','60000','80000','92000','110400','128800','147200','165600','184000','276000','368000','460000','920000','1840000','2760000','3680000','4600000');
var Cost_11_1035 = new Array('16000','28000','42000','56000','68000','81600','95200','108800','122400','136000','204000','272000','340000','680000','1360000','2040000','2720000','3400000');
var Cost_11_1036 = new Array('20000','40000','60000','80000','92000','110400','128800','147200','165600','184000','276000','368000','460000','920000','1840000','2760000','3680000','4600000');
var Cost_11_1037 = new Array('12000','21000','31500','42000','51000','61200','71400','81600','91800','102000','153000','204000','255000','510000','1020000','1530000','2040000','2550000');
var Cost_11_1038 = new Array('15000','30000','45000','60000','69000','82800','96600','110400','124200','138000','207000','276000','345000','690000','1380000','2070000','2760000','3450000');
var Cost_11_1039 = new Array('16000','28000','42000','56000','68000','81600','95200','108800','122400','136000','204000','272000','340000','680000','1360000','2040000','2720000','3400000');
var Cost_11_1040 = new Array('20000','40000','60000','80000','92000','110400','128800','147200','165600','184000','276000','368000','460000','920000','1840000','2760000','3680000','4600000');
var Cost_11_1041 = new Array('16000','28000','42000','56000','68000','81600','95200','108800','122400','136000','204000','272000','340000','680000','1360000','2040000','2720000','3400000');
var Cost_11_1042 = new Array('20000','40000','60000','80000','92000','110400','128800','147200','165600','184000','276000','368000','460000','920000','1840000','2760000','3680000','4600000');
var Cost_11_1043 = new Array('12000','21000','31500','42000','51000','61200','71400','81600','91800','102000','153000','204000','255000','510000','1020000','1530000','2040000','2550000');
var Cost_11_1044 = new Array('15000','30000','45000','60000','69000','82800','96600','110400','124200','138000','207000','276000','345000','690000','1380000','2070000','2760000','3450000');
var Cost_11_1045 = new Array('16000','28000','42000','56000','68000','81600','95200','108800','122400','136000','204000','272000','340000','680000','1360000','2040000','2720000','3400000');
var Cost_11_1046 = new Array('20000','40000','60000','80000','92000','110400','128800','147200','165600','184000','276000','368000','460000','920000','1840000','2760000','3680000','4600000');
var Cost_11_1047 = new Array('12000','21000','31500','42000','51000','61200','71400','81600','91800','102000','153000','204000','255000','510000','1020000','1530000','2040000','2550000');
var Cost_11_1048 = new Array('15000','30000','45000','60000','69000','82800','96600','110400','124200','138000','207000','276000','345000','690000','1380000','2070000','2760000','3450000');
var Cost_11_1049 = new Array('16000','28000','42000','56000','68000','81600','95200','108800','122400','136000','204000','272000','340000','680000','1360000','2040000','2720000','3400000');
var Cost_11_1050 = new Array('20000','40000','60000','80000','92000','110400','128800','147200','165600','184000','276000','368000','460000','920000','1840000','2760000','3680000','4600000');
var Cost_11_1051 = new Array('16000','28000','42000','56000','68000','81600','95200','108800','122400','136000','204000','272000','340000','680000','1360000','2040000','2720000','3400000');
var Cost_11_1052 = new Array('20000','40000','60000','80000','92000','110400','128800','147200','165600','184000','276000','368000','460000','920000','1840000','2760000','3680000','4600000');
var Cost_11_1053 = new Array('12000','21000','31500','42000','51000','61200','71400','81600','91800','102000','153000','204000','255000','510000','1020000','1530000','2040000','2550000');
var Cost_11_1054 = new Array('15000','30000','45000','60000','69000','82800','96600','110400','124200','138000','207000','276000','345000','690000','1380000','2070000','2760000','3450000');
var Cost_11_1055 = new Array('16000','28000','42000','56000','68000','81600','95200','108800','122400','136000','204000','272000','340000','680000','1360000','2040000','2720000','3400000');
var Cost_11_1056 = new Array('20000','40000','60000','80000','92000','110400','128800','147200','165600','184000','276000','368000','460000','920000','1840000','2760000','3680000','4600000');
var Cost_11_1057 = new Array('16000','28000','42000','56000','68000','81600','95200','108800','122400','136000','204000','272000','340000','680000','1360000','2040000','2720000','3400000');
var Cost_11_1058 = new Array('20000','40000','60000','80000','92000','110400','128800','147200','165600','184000','276000','368000','460000','920000','1840000','2760000','3680000','4600000');
var Cost_11_1059 = new Array('12000','21000','31500','42000','51000','61200','71400','81600','91800','102000','153000','204000','255000','510000','1020000','1530000','2040000','2550000');
var Cost_11_1060 = new Array('15000','30000','45000','60000','69000','82800','96600','110400','124200','138000','207000','276000','345000','690000','1380000','2070000','2760000','3450000');
var Cost_11_1061 = new Array('16000','28000','42000','56000','68000','81600','95200','108800','122400','136000','204000','272000','340000','680000','1360000','2040000','2720000','3400000');
var Cost_11_1062 = new Array('20000','40000','60000','80000','92000','110400','128800','147200','165600','184000','276000','368000','460000','920000','1840000','2760000','3680000','4600000');
var Cost_11_1063 = new Array('12000','21000','31500','42000','51000','61200','71400','81600','91800','102000','153000','204000','255000','510000','1020000','1530000','2040000','2550000');
var Cost_11_1064 = new Array('15000','30000','45000','60000','69000','82800','96600','110400','124200','138000','207000','276000','345000','690000','1380000','2070000','2760000','3450000');
var Cost_11_1065 = new Array('16000','28000','42000','56000','68000','81600','95200','108800','122400','136000','204000','272000','340000','680000','1360000','2040000','2720000','3400000');
var Cost_11_1066 = new Array('20000','40000','60000','80000','92000','110400','128800','147200','165600','184000','276000','368000','460000','920000','1840000','2760000','3680000','4600000');
var Cost_11_1067 = new Array('16000','28000','42000','56000','68000','81600','95200','108800','122400','136000','204000','272000','340000','680000','1360000','2040000','2720000','3400000');
var Cost_11_1068 = new Array('20000','40000','60000','80000','92000','110400','128800','147200','165600','184000','276000','368000','460000','920000','1840000','2760000','3680000','4600000');
var Cost_11_1069 = new Array('12000','21000','31500','42000','51000','61200','71400','81600','91800','102000','153000','204000','255000','510000','1020000','1530000','2040000','2550000');
var Cost_11_1070 = new Array('15000','30000','45000','60000','69000','82800','96600','110400','124200','138000','207000','276000','345000','690000','1380000','2070000','2760000','3450000');
var Quantity_11_count = 18;
var Quantity_11 = new Array('200','400','600','800','1000','1200','1400','1600','1800','2000','3000','4000','5000','10000','20000','30000','40000','50000');
var Kind_11_count = 96;
var Kind_11 = new Array('빌리160x70단면','빌리160x70양면','빌리170x80단면','빌리170x80양면','빌리150x70단면','빌리150x70양면','빌리155x70단면','빌리155x70양면','빌리146x76단면','빌리146x76양면','빌리170x70단면','빌리170x70양면','빌리156x74단면','빌리156x74양면','빌리144x64단면','빌리144x64양면','머쉬160x70단면','머쉬160x70양면','머쉬170x80단면','머쉬170x80양면','머쉬150x70단면','머쉬150x70양면','머쉬155x70단면','머쉬155x70양면','머쉬146x76단면','머쉬146x76양면','머쉬170x70단면','머쉬170x70양면','머쉬156x74단면','머쉬156x74양면','머쉬144x64단면','머쉬144x64양면','스코160x70단면','스코160x70양면','스코170x80단면','스코170x80양면','스코150x70단면','스코150x70양면','스코155x70단면','스코155x70양면','스코146x76단면','스코146x76양면','스코170x70단면','스코170x70양면','스코156x74단면','스코156x74양면','스코144x64단면','스코144x64양면','라레160x70단면','라레160x70양면','라레170x80단면','라레170x80양면','라레150x70단면','라레150x70양면','라레155x70단면','라레155x70양면','라레146x76단면','라레146x76양면','라레170x70단면','라레170x70양면','라레156x74단면','라레156x74양면','라레144x64단면','라레144x64양면','누브160x70단면','누브160x70양면','누브170x80단면','누브170x80양면','누브150x70단면','누브150x70양면','누브155x70단면','누브155x70양면','누브146x76단면','누브146x76양면','누브170x70단면','누브170x70양면','누브156x74단면','누브156x74양면','누브144x64단면','누브144x64양면','탄트160x70단면','탄트160x70양면','탄트170x80단면','탄트170x80양면','탄트150x70단면','탄트150x70양면','탄트155x70단면','탄트155x70양면','탄트146x76단면','탄트146x76양면','탄트170x70단면','탄트170x70양면','탄트156x74단면','탄트156x74양면','탄트144x64단면','탄트144x64양면');
var Kind_11_Code = new Array('226','227','228','229','230','231','232','233','234','235','236','237','238','239','240','241','242','243','244','245','246','247','248','249','250','251','252','253','254','255','256','257','258','259','260','261','262','263','264','265','266','267','268','269','270','271','272','273','1023','1024','1025','1026','1027','1028','1029','1030','1031','1032','1033','1034','1035','1036','1037','1038','1039','1040','1041','1042','1043','1044','1045','1046','1047','1048','1049','1050','1051','1052','1053','1054','1055','1056','1057','1058','1059','1060','1061','1062','1063','1064','1065','1066','1067','1068','1069','1070');
var Cost_12_274 = new Array('36000','72000','108000','144000','180000','216000','252000','288000','324000','360000');
var Cost_12_275 = new Array('54000','108000','162000','216000','270000','324000','378000','432000','486000','540000');
var Cost_12_276 = new Array('48000','96000','144000','192000','240000','288000','336000','384000','432000','480000');
var Cost_12_277 = new Array('72000','144000','216000','288000','360000','432000','504000','576000','648000','720000');
var Cost_12_278 = new Array('24000','48000','72000','96000','120000','144000','168000','192000','216000','240000');
var Cost_12_279 = new Array('36000','72000','108000','144000','180000','216000','252000','288000','324000','360000');
var Cost_12_280 = new Array('42000','78000','117000','156000','195000','234000','273000','312000','351000','390000');
var Cost_12_281 = new Array('54000','108000','162000','216000','270000','324000','378000','432000','486000','540000');
var Cost_12_282 = new Array('56000','104000','156000','208000','260000','312000','364000','416000','468000','520000');
var Cost_12_283 = new Array('72000','144000','216000','288000','360000','432000','504000','576000','648000','720000');
var Cost_12_284 = new Array('28000','52000','78000','104000','130000','156000','182000','208000','234000','260000');
var Cost_12_285 = new Array('36000','72000','108000','144000','180000','216000','252000','288000','324000','360000');
var Quantity_12_count = 10;
var Quantity_12 = new Array('500','1000','1500','2000','2500','3000','3500','4000','4500','5000');
var Kind_12_count = 12;
var Kind_12 = new Array('비코팅16절단면','비코팅16절양면','비코팅A4단면','비코팅A4양면','비코팅A5단면','비코팅A5양면','코팅16절단면','코팅16절양면','코팅A4단면','코팅A4양면','코팅A5단면','코팅A5양면');
var Kind_12_Code = new Array('274','275','276','277','278','279','280','281','282','283','284','285');
var Cost_13_286 = new Array('48000','96000','144000','192000','240000','288000','336000','384000','432000','480000');
var Cost_13_287 = new Array('72000','144000','216000','288000','360000','432000','504000','576000','648000','720000');
var Cost_13_288 = new Array('72000','144000','216000','288000','360000','432000','504000','576000','648000','720000');
var Cost_13_289 = new Array('108000','216000','324000','432000','540000','648000','756000','864000','972000','1080000');
var Cost_13_290 = new Array('36000','72000','108000','144000','180000','216000','252000','288000','324000','360000');
var Cost_13_291 = new Array('54000','108000','162000','216000','270000','324000','378000','432000','486000','540000');
var Cost_13_292 = new Array('48000','96000','144000','192000','240000','288000','336000','384000','432000','480000');
var Cost_13_293 = new Array('72000','144000','216000','288000','360000','432000','504000','576000','648000','720000');
var Cost_13_294 = new Array('72000','144000','216000','288000','360000','432000','504000','576000','648000','720000');
var Cost_13_295 = new Array('108000','216000','324000','432000','540000','648000','756000','864000','972000','1080000');
var Cost_13_296 = new Array('36000','72000','108000','144000','180000','216000','252000','288000','324000','360000');
var Cost_13_297 = new Array('54000','108000','162000','216000','270000','324000','378000','432000','486000','540000');
var Cost_13_298 = new Array('36000','72000','108000','144000','180000','216000','252000','288000','324000','360000');
var Cost_13_299 = new Array('60000','120000','180000','240000','300000','360000','420000','480000','540000','600000');
var Cost_13_300 = new Array('54000','108000','162000','216000','270000','324000','378000','432000','486000','540000');
var Cost_13_301 = new Array('90000','180000','270000','360000','450000','540000','630000','720000','810000','900000');
var Cost_13_302 = new Array('27000','54000','81000','108000','135000','162000','189000','216000','243000','270000');
var Cost_13_303 = new Array('45000','90000','135000','180000','225000','270000','315000','360000','405000','450000');
var Quantity_13_count = 10;
var Quantity_13 = new Array('300','600','900','1200','1500','1800','2100','2400','2700','3000');
var Kind_13_count = 18;
var Kind_13 = new Array('라레16절단면','라레16절양면','라레A4단면','라레A4양면','라레A5단면','라레A5양면','누브16절단면','누브16절양면','누브A4단면','누브A4양면','누브A5단면','누브A5양면','탄트16절단면','탄트16절양면','탄트A4단면','탄트A4양면','탄트A5단면','탄트A5양면');
var Kind_13_Code = new Array('286','287','288','289','290','291','292','293','294','295','296','297','298','299','300','301','302','303');
var Cost_14_304 = new Array('67100','122200','183300','244400','323500','388200','452900','517600','582300','647000','970500','1294000','1617500','3235000','6470000','9650000','12940000','16175000');
var Cost_14_305 = new Array('79100','158200','237300','316400','395500','474600','553700','632800','711900','791000','1186500','1582000','1977500','3955000','7910000','11810000','15820000','19775000');
var Cost_14_306 = new Array('100100','182200','273300','364400','482500','579000','675500','772000','868500','965000','1447500','1930000','2412500','4825000','9650000','14420000','19300000','24125000');
var Cost_14_307 = new Array('118100','236200','354300','472400','590500','708600','826700','944800','1062900','1181000','1771500','2362000','2952500','5905000','11810000','17660000','23620000','29525000');
var Cost_14_308 = new Array('50600','92200','138300','184400','244000','292800','341600','390400','439200','488000','732000','976000','1220000','2440000','4880000','7265000','9760000','12200000');
var Cost_14_309 = new Array('59600','119200','178800','238400','298000','357600','417200','476800','536400','596000','894000','1192000','1490000','2980000','5960000','8885000','11920000','14900000');
var Cost_14_310 = new Array('67100','122200','183300','244400','323500','388200','452900','517600','582300','647000','970500','1294000','1617500','3235000','6470000','9650000','12940000','16175000');
var Cost_14_311 = new Array('79100','158200','237300','316400','395500','474600','553700','632800','711900','791000','1186500','1582000','1977500','3955000','7910000','11810000','15820000','19775000');
var Cost_14_312 = new Array('100100','182200','273300','364400','482500','579000','675500','772000','868500','965000','1447500','1930000','2412500','4825000','9650000','14420000','19300000','24125000');
var Cost_14_313 = new Array('118100','236200','354300','472400','590500','708600','826700','944800','1062900','1181000','1771500','2362000','2952500','5905000','11810000','17660000','23620000','29525000');
var Cost_14_314 = new Array('50600','92200','138300','184400','244000','292800','341600','390400','439200','488000','732000','976000','1220000','2440000','4880000','7265000','9760000','12200000');
var Cost_14_315 = new Array('59600','119200','178800','238400','298000','357600','417200','476800','536400','596000','894000','1192000','1490000','2980000','5960000','8885000','11920000','14900000');
var Cost_14_316 = new Array('49100','98200','147300','196400','221500','265800','310100','354400','398700','443000','664500','886000','1107500','2215000','4430000','6590000','8860000','11075000');
var Cost_14_317 = new Array('61100','122200','183300','244400','269500','323400','377300','431200','485100','539000','808500','1078000','1347500','2695000','5390000','8030000','10780000','13475000');
var Cost_14_318 = new Array('73100','146200','219300','292400','329500','395400','461300','527200','593100','659000','988500','1318000','1647500','3295000','6590000','9830000','13180000','16475000');
var Cost_14_319 = new Array('91100','182200','273300','364400','401500','481800','562100','642400','722700','803000','1204500','1606000','2007500','4015000','8030000','11990000','16060000','20075000');
var Cost_14_320 = new Array('37100','74200','111300','148400','167500','201000','234500','268000','301500','335000','502500','670000','837500','1675000','3350000','4970000','6700000','8375000');
var Cost_14_321 = new Array('46100','92200','138300','184400','203500','244200','284900','325600','366300','407000','610500','814000','1017500','2035000','4070000','6050000','8140000','10175000');
var Cost_14_322 = new Array('49100','98200','147300','196400','221500','265800','310100','354400','398700','443000','664500','886000','1107500','2215000','4430000','6590000','8860000','11075000');
var Cost_14_323 = new Array('61100','122200','183300','244400','269500','323400','377300','431200','485100','539000','808500','1078000','1347500','2695000','5390000','8030000','10780000','13475000');
var Cost_14_324 = new Array('73100','146200','219300','292400','329500','395400','461300','527200','593100','659000','988500','1318000','1647500','3295000','6590000','9830000','13180000','16475000');
var Cost_14_325 = new Array('91100','182200','273300','364400','401500','481800','562100','642400','722700','803000','1204500','1606000','2007500','4015000','8030000','11990000','16060000','20075000');
var Cost_14_326 = new Array('37100','74200','111300','148400','167500','201000','234500','268000','301500','335000','502500','670000','837500','1675000','3350000','4970000','6700000','8375000');
var Cost_14_327 = new Array('46100','92200','138300','184400','203500','244200','284900','325600','366300','407000','610500','814000','1017500','2035000','4070000','6050000','8140000','10175000');
var Cost_14_328 = new Array('49100','98200','99300','100400','101500','121800','142100','162400','182700','203000','304500','406000','507500','1015000','2030000','2990000','4060000','5075000');
var Cost_14_329 = new Array('61100','122200','123300','124400','125500','150600','175700','200800','225900','251000','376500','502000','627500','1255000','2510000','3710000','5020000','6275000');
var Cost_14_330 = new Array('73100','146200','147300','148400','149500','179400','209300','239200','269100','299000','448500','598000','747500','1495000','2990000','4430000','5980000','7475000');
var Cost_14_331 = new Array('91100','182200','183300','184400','185500','222600','259700','296800','333900','371000','556500','742000','927500','1855000','3710000','5510000','7420000','9275000');
var Cost_14_332 = new Array('37100','74200','75300','76400','77500','93000','108500','124000','139500','155000','232500','310000','387500','775000','1550000','2270000','3100000','3875000');
var Cost_14_333 = new Array('46100','92200','93300','94400','95500','114600','133700','152800','171900','191000','286500','382000','477500','955000','1910000','2810000','3820000','4775000');
var Cost_14_334 = new Array('73100','134200','201300','268400','341500','409800','478100','546400','614700','683000','1024500','1366000','1707500','3415000','6830000','10190000','13660000','17075000');
var Cost_14_335 = new Array('85100','170200','255300','340400','413500','496200','578900','661600','744300','827000','1240500','1654000','2067500','4135000','8270000','12350000','16540000','20675000');
var Cost_14_336 = new Array('109100','200200','300300','400400','509500','611400','713300','815200','917100','1019000','1528500','2038000','2547500','5095000','10190000','15230000','20380000','25475000');
var Cost_14_337 = new Array('127100','254200','381300','508400','617500','741000','864500','988000','1111500','1235000','1852500','2470000','3087500','6175000','12350000','18470000','24700000','30875000');
var Cost_14_338 = new Array('55100','101200','151800','202400','257500','309000','360500','412000','463500','515000','772500','1030000','1287500','2575000','5150000','7670000','10300000','12875000');
var Cost_14_339 = new Array('64100','128200','192300','256400','311500','373800','436100','498400','560700','623000','934500','1246000','1557500','3115000','6230000','9290000','12460000','15575000');
var Cost_14_1071 = new Array('49100','86200','129300','172400','209500','251400','293300','335200','377100','419000','628500','838000','1047500','2095000','4190000','6230000','8380000','10475000');
var Cost_14_1072 = new Array('61100','122200','183300','244400','281500','337800','394100','450400','506700','563000','844500','1126000','1407500','2815000','5630000','8390000','11260000','14075000');
var Cost_14_1073 = new Array('73100','128200','192300','256400','311500','373800','436100','498400','560700','623000','934500','1246000','1557500','3115000','6230000','9290000','12460000','15575000');
var Cost_14_1074 = new Array('91100','182200','273300','364400','419500','503400','587300','671200','755100','839000','1258500','1678000','2097500','4195000','8390000','12530000','16780000','20975000');
var Cost_14_1075 = new Array('37100','65200','97800','130400','158500','190200','221900','253600','285300','317000','475500','634000','792500','1585000','3170000','4700000','6340000','7925000');
var Cost_14_1076 = new Array('46100','92200','138300','184400','212500','255000','297500','340000','382500','425000','637500','850000','1062500','2125000','4250000','6320000','8500000','10625000');
var Cost_14_1077 = new Array('49100','86200','129300','172400','209500','251400','293300','335200','377100','419000','628500','838000','1047500','2095000','4190000','6230000','8380000','10475000');
var Cost_14_1078 = new Array('61100','122200','183300','244400','281500','337800','394100','450400','506700','563000','844500','1126000','1407500','2815000','5630000','8390000','11260000','14075000');
var Cost_14_1079 = new Array('73100','128200','192300','256400','311500','373800','436100','498400','560700','623000','934500','1246000','1557500','3115000','6230000','9290000','12460000','15575000');
var Cost_14_1080 = new Array('91100','182200','273300','364400','419500','503400','587300','671200','755100','839000','1258500','1678000','2097500','4195000','8390000','12530000','16780000','20975000');
var Cost_14_1081 = new Array('37100','65200','97800','130400','158500','190200','221900','253600','285300','317000','475500','634000','792500','1585000','3170000','4700000','6340000','7925000');
var Cost_14_1082 = new Array('46100','92200','138300','184400','212500','255000','297500','340000','382500','425000','637500','850000','1062500','2125000','4250000','6320000','8500000','10625000');
var Cost_14_1083 = new Array('49100','86200','129300','172400','209500','251400','293300','335200','377100','419000','628500','838000','1047500','2095000','4190000','6230000','8380000','10475000');
var Cost_14_1084 = new Array('61100','122200','183300','244400','281500','337800','394100','450400','506700','563000','844500','1126000','1407500','2815000','5630000','8390000','11260000','14075000');
var Cost_14_1085 = new Array('73100','128200','192300','256400','311500','373800','436100','498400','560700','623000','934500','1246000','1557500','3115000','6230000','9290000','12460000','15575000');
var Cost_14_1086 = new Array('91100','182200','273300','364400','419500','503400','587300','671200','755100','839000','1258500','1678000','2097500','4195000','8390000','12530000','16780000','20975000');
var Cost_14_1087 = new Array('37100','65200','97800','130400','158500','190200','221900','253600','285300','317000','475500','634000','792500','1585000','3170000','4700000','6340000','7925000');
var Cost_14_1088 = new Array('46100','92200','138300','184400','212500','255000','297500','340000','382500','425000','637500','850000','1062500','2125000','4250000','6320000','8500000','10625000');
var Quantity_14_count = 18;
var Quantity_14 = new Array('200','400','600','800','1000','1200','1400','1600','1800','2000','3000','4000','5000','10000','20000','30000','40000','50000');
var Kind_14_count = 54;
var Kind_14 = new Array('스타16절단면','스타16절양면','스타A4단면','스타A4양면','스타A5단면','스타A5양면','키칼16절단면','키칼16절양면','키칼A4단면','키칼A4양면','키칼A5단면','키칼A5양면','그레16절단면','그레16절양면','그레A4단면','그레A4양면','그레A5단면','그레A5양면','빌리16절단면','빌리16절양면','빌리A4단면','빌리A4양면','빌리A5단면','빌리A5양면','머쉬16절단면','머쉬16절양면','머쉬A4단면','머쉬A4양면','머쉬A5단면','머쉬A5양면','스코16절단면','스코16절양면','스코A4단면','스코A4양면','스코A5단면','스코A5양면','라레16절단면','라레16절양면','라레A4단면','라레A4양면','라레A5단면','라레A5양면','누브16절단면','누브16절양면','누브A4단면','누브A4양면','누브A5단면','누브A5양면','탄트16절단면','탄트16절양면','탄트A4단면','탄트A4양면','탄트A5단면','탄트A5양면');
var Kind_14_Code = new Array('304','305','306','307','308','309','310','311','312','313','314','315','316','317','318','319','320','321','322','323','324','325','326','327','328','329','330','331','332','333','334','335','336','337','338','339','1071','1072','1073','1074','1075','1076','1077','1078','1079','1080','1081','1082','1083','1084','1085','1086','1087','1088');
var Cost_15_340 = new Array('33300','60500','93800','108900','142200','167000','200300','217800','251100','266200','326700','375100','433200','484000','532400','1064800','1597200','2129600','2662000');
var Cost_15_341 = new Array('33300','60500','93800','108900','142200','167000','200300','217800','251100','266200','326700','375100','433200','484000','532400','1064800','1597200','2129600','2662000');
var Cost_15_342 = new Array('33300','60500','93800','108900','142200','167000','200300','217800','251100','266200','326700','375100','433200','484000','532400','1064800','1597200','2129600','2662000');
var Cost_15_343 = new Array('40600','78700','119300','152500','193100','225100','265700','295300','335900','363000','441700','515500','588100','658300','726000','1452000','2178000','2904000','3630000');
var Cost_15_344 = new Array('40600','78700','119300','152500','193100','225100','265700','295300','335900','363000','441700','515500','588100','658300','726000','1452000','2178000','2904000','3630000');
var Cost_15_345 = new Array('40600','78700','119300','152500','193100','225100','265700','295300','335900','363000','441700','515500','588100','658300','726000','1452000','2178000','2904000','3630000');
var Cost_15_346 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_15_347 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_15_348 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_15_349 = new Array('40600','78700','119300','152500','193100','225100','265700','295300','335900','363000','441700','515500','588100','658300','726000','1452000','2178000','2904000','3630000');
var Cost_15_350 = new Array('40600','78700','119300','152500','193100','225100','265700','295300','335900','363000','441700','515500','588100','658300','726000','1452000','2178000','2904000','3630000');
var Cost_15_351 = new Array('40600','78700','119300','152500','193100','225100','265700','295300','335900','363000','441700','515500','588100','658300','726000','1452000','2178000','2904000','3630000');
var Cost_15_352 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_15_353 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_15_354 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_15_355 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_15_356 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_15_357 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_15_358 = new Array('60000','115000','172500','230000','287500','345000','402500','460000','510000','510000','612000','714000','816000','918000','1020000','2040000','3060000','4080000','5100000');
var Cost_15_359 = new Array('60000','115000','172500','230000','287500','345000','402500','460000','510000','510000','612000','714000','816000','918000','1020000','2040000','3060000','4080000','5100000');
var Cost_15_360 = new Array('60000','115000','172500','230000','287500','345000','402500','460000','510000','510000','612000','714000','816000','918000','1020000','2040000','3060000','4080000','5100000');
var Cost_15_361 = new Array('60000','115000','172500','230000','287500','345000','402500','460000','510000','510000','612000','714000','816000','918000','1020000','2040000','3060000','4080000','5100000');
var Cost_15_362 = new Array('60000','115000','172500','230000','287500','345000','402500','460000','510000','510000','612000','714000','816000','918000','1020000','2040000','3060000','4080000','5100000');
var Cost_15_363 = new Array('60000','115000','172500','230000','287500','345000','402500','460000','510000','510000','612000','714000','816000','918000','1020000','2040000','3060000','4080000','5100000');
var Quantity_15_count = 19;
var Quantity_15 = new Array('500','1000','1500','2000','2500','3000','3500','4000','4500','5000','6000','7000','8000','9000','10000','20000','30000','40000','50000');
var Kind_15_count = 24;
var Kind_15 = new Array('88x54단면4도','88x54양면5도','88x54양면8도','88x108단면4도','88x108양면5도','88x108양면8도','88x135단면4도','88x135양면5도','88x135양면8도','91x61단면4도','91x61양면5도','91x61양면8도','112x77단면4도','112x77양면5도','112x77양면8도','122x86단면4도','122x86양면5도','122x86양면8도','132x94단면4도','132x94양면5도','132x94양면8도','156x106단면4도','156x106양면5도','156x106양면8도');
var Kind_15_Code = new Array('340','341','342','343','344','345','346','347','348','349','350','351','352','353','354','355','356','357','358','359','360','361','362','363');
var Cost_16_364 = new Array('40600','78700','119300','152500','193100','225100','265700','295300','335900','363000','441700','515500','588100','658300','726000','1452000','2178000','2904000','3630000');
var Cost_16_365 = new Array('40600','78700','119300','152500','193100','225100','265700','295300','335900','363000','441700','515500','588100','658300','726000','1452000','2178000','2904000','3630000');
var Cost_16_366 = new Array('40600','78700','119300','152500','193100','225100','265700','295300','335900','363000','441700','515500','588100','658300','726000','1452000','2178000','2904000','3630000');
var Cost_16_367 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_16_368 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_16_369 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_16_370 = new Array('60000','115000','172500','230000','287500','345000','402500','460000','510000','510000','612000','714000','816000','918000','1020000','2040000','3060000','4080000','5100000');
var Cost_16_371 = new Array('60000','115000','172500','230000','287500','345000','402500','460000','510000','510000','612000','714000','816000','918000','1020000','2040000','3060000','4080000','5100000');
var Cost_16_372 = new Array('60000','115000','172500','230000','287500','345000','402500','460000','510000','510000','612000','714000','816000','918000','1020000','2040000','3060000','4080000','5100000');
var Cost_16_373 = new Array('60000','115000','172500','230000','287500','345000','402500','460000','510000','510000','612000','714000','816000','918000','1020000','2040000','3060000','4080000','5100000');
var Cost_16_374 = new Array('60000','115000','172500','230000','287500','345000','402500','460000','510000','510000','612000','714000','816000','918000','1020000','2040000','3060000','4080000','5100000');
var Cost_16_375 = new Array('60000','115000','172500','230000','287500','345000','402500','460000','510000','510000','612000','714000','816000','918000','1020000','2040000','3060000','4080000','5100000');
var Cost_16_376 = new Array('60000','115000','172500','230000','287500','345000','402500','460000','510000','510000','612000','714000','816000','918000','1020000','2040000','3060000','4080000','5100000');
var Cost_16_377 = new Array('60000','115000','172500','230000','287500','345000','402500','460000','510000','510000','612000','714000','816000','918000','1020000','2040000','3060000','4080000','5100000');
var Cost_16_378 = new Array('60000','115000','172500','230000','287500','345000','402500','460000','510000','510000','612000','714000','816000','918000','1020000','2040000','3060000','4080000','5100000');
var Cost_16_379 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_16_380 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_16_381 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_16_382 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_16_383 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_16_384 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_16_385 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_16_386 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_16_387 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_16_388 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_16_389 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_16_390 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_16_391 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_16_392 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_16_393 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_16_394 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_16_395 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_16_396 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_16_397 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_16_398 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Cost_16_399 = new Array('46000','90000','135000','180000','225000','270000','315000','360000','380000','380000','456000','532000','608000','684000','760000','1520000','2280000','3040000','3800000');
var Quantity_16_count = 19;
var Quantity_16 = new Array('500','1000','1500','2000','2500','3000','3500','4000','4500','5000','6000','7000','8000','9000','10000','20000','30000','40000','50000');
var Kind_16_count = 36;
var Kind_16 = new Array('곰76x87단면4도','곰76x87양면5도','곰76x87양면8도','타원114x62단면4도','타원114x62양면5도','타원114x62양면8도','발88x115단면4도','발88x115양면5도','발88x115양면8도','사과90x100단면4도','사과90x100양면5도','사과90x100양면8도','타원꼭지154x100단면4도','타원꼭지154x100양면5도','타원꼭지154x100양면8도','차114x79단면4도','차114x79양면5도','차114x79양면8도','집114x79단면4도','집114x79양면5도','집114x79양면8도','하트112x81단면4도','하트112x81양면5도','하트112x81양면8도','반원108x83단면4도','반원108x83양면5도','반원108x83양면8도','원반120x70단면4도','원반120x70양면5도','원반120x70양면8도','복주머니110x80단면4도','복주머니110x80양면5도','복주머니110x80양면8도','토끼110x80단면4도','토끼110x80양면5도','토끼110x80양면8도');
var Kind_16_Code = new Array('364','365','366','367','368','369','370','371','372','373','374','375','376','377','378','379','380','381','382','383','384','385','386','387','388','389','390','391','392','393','394','395','396','397','398','399');
var Cost_17_400 = new Array('95000','160000','240000','320000','415000','468000','563000','628000','708000','750000');
var Cost_17_401 = new Array('100000','160000','240000','312000','412000','468000','568000','628000','708000','750000');
var Cost_17_402 = new Array('100000','160000','240000','312000','412000','468000','568000','628000','708000','750000');
var Cost_17_403 = new Array('100000','160000','240000','312000','412000','468000','568000','628000','708000','750000');
var Cost_17_404 = new Array('100000','160000','240000','312000','412000','468000','568000','628000','708000','750000');
var Cost_17_405 = new Array('100000','160000','240000','312000','412000','468000','568000','628000','708000','750000');
var Cost_17_406 = new Array('100000','160000','240000','312000','412000','468000','568000','628000','708000','750000');
var Cost_17_407 = new Array('105000','180000','270000','360000','465000','528000','633000','708000','798000','850000');
var Cost_17_408 = new Array('150000','260000','390000','520000','670000','768000','918000','1028000','1158000','1200000');
var Cost_17_409 = new Array('95000','160000','240000','312000','407000','468000','563000','628000','708000','750000');
var Cost_17_410 = new Array('95000','160000','240000','312000','407000','468000','563000','628000','708000','750000');
var Cost_17_411 = new Array('95000','160000','240000','312000','407000','468000','563000','628000','708000','750000');
var Cost_17_412 = new Array('85000','130000','195000','200000','285000','288000','373000','418000','483000','450000');
var Cost_17_413 = new Array('95000','160000','240000','312000','407000','468000','563000','628000','708000','750000');
var Cost_17_414 = new Array('95000','160000','240000','312000','407000','468000','563000','628000','708000','750000');
var Cost_17_415 = new Array('95000','160000','240000','312000','407000','468000','563000','628000','708000','750000');
var Cost_17_416 = new Array('105000','180000','270000','360000','465000','528000','633000','708000','798000','850000');
var Cost_17_417 = new Array('85000','140000','210000','242000','327000','348000','433000','488000','558000','550000');
var Cost_17_418 = new Array('105000','180000','270000','360000','465000','528000','700000','708000','798000','850000');
var Cost_17_419 = new Array('130000','240000','360000','470000','600000','696000','826000','936000','1056000','1100000');
var Quantity_17_count = 10;
var Quantity_17 = new Array('1000','2000','3000','4000','5000','6000','7000','8000','9000','10000');
var Kind_17_count = 20;
var Kind_17 = new Array('곰모양','복주머니모양','타원모양114x82','반원모양','발모양','사과모양','토끼모양','타원모양134x98','타원모양168x114','차모양','집모양','하트모양','86x52','106x86','116x81','126x90','139x92','95x65','136x98','154x104');
var Kind_17_Code = new Array('400','401','402','403','404','405','406','407','408','409','410','411','412','413','414','415','416','417','418','419');
var Cost_18_420 = new Array('0');
var Quantity_18_count = 1;
var Quantity_18 = new Array('500');
var Kind_18_count = 1;
var Kind_18 = new Array('세트품목');
var Kind_18_Code = new Array('420');
var Cost_19_421 = new Array('6000','11000','17000','23000','29000','31000','36000','41000','48000','52000','58000','63000','69000','75000','81000','83000','88000','93000','100000','104000','110000','115000','121000','127000','133000','135000','140000','145000','152000','156000','162000','167000','173000','179000','185000','187000','192000','197000','204000','208000','214000','219000','225000','231000','237000','239000','244000','249000','256000','260000','266000','271000','277000','283000','289000','291000','296000','301000','308000','312000','318000','323000','329000','335000','341000','343000','348000','353000','360000','364000','370000','375000','381000','387000','393000','395000','400000','405000','412000','416000','422000','427000','433000','439000','445000','447000','452000','457000','464000','468000','474000','479000','485000','491000','497000','499000','504000','509000','516000','520000');
var Cost_19_422 = new Array('6600','13200','19800','26400','30800','34400','40100','45800','51500','52800','58100','63400','68700','74000','79200','84500','89800','95100','100400','105600','110900','116200','121500','126800','132000','137300','142600','147900','153200','158400','163700','169000','174300','179600','184800','190100','195400','200700','206000','211200','216500','221800','227100','232400','237600','242900','248200','253500','258800','242000','246900','251700','256600','261400','266200','271100','275900','280800','285600','290400','295300','300100','305000','309800','314600','319500','324300','329200','334000','338800','343700','348500','353400','358200','363000','367900','372700','377600','382400','387200','392100','396900','401800','406600','411400','416300','421100','426000','430800','435600','440500','445300','450200','455000','459800','464700','469500','474400','479200','484000');
var Cost_19_423 = new Array('7500','14300','20900','29700','36300','42500','49600','56700','63800','64900','71900','78500','85000','91500','98100','104600','111100','117700','124200','130700','137300','143800','150300','156900','163400','169900','176500','183000','189500','196100','202600','209100','215700','222200','228700','235300','241800','248300','254900','261400','267900','274500','281000','287500','294100','300600','307100','313700','320200','299500','305500','311500','317500','323500','329500','335500','341500','347400','353400','359400','365400','371400','377400','383400','389400','395400','401300','407300','413300','419300','425300','431300','437300','443300','449300','455300','461200','467200','473200','479200','485200','491200','497200','503200','509200','515100','521100','527100','533100','539100','545100','551100','557100','563100','569100','575000','581000','587000','593000','599000');
var Cost_19_424 = new Array('8900','17800','26700','35600','41600','46400','54100','61800','69500','71300','78500','85600','92700','99800','107000','114100','121200','128400','135500','142600','149700','156900','164000','171100','178200','185400','192500','199600','206800','213900','221000','228100','235300','242400','249500','256700','263800','270900','278000','285200','292300','299400','306600','313700','320800','327900','335100','342200','349300','326700','333300','339800','346400','352900','359400','366000','372500','379000','385600','392100','398600','405200','411700','418200','424800','431300','437800','444400','450900','457400','464000','470500','477000','483600','490100','496600','503200','509700','516200','522800','529300','535800','542400','548900','555400','562000','568500','575000','581600','588100','594600','601200','607700','614200','620800','627300','633800','640400','646900','653400');
var Cost_19_425 = new Array('10400','20800','31200','41600','48600','54100','63100','72100','81100','83200','91500','99800','108200','116500','124800','133100','141400','149700','158100','166400','174700','183000','191300','199600','207900','216300','224600','232900','241200','249500','257800','266200','274500','282800','291100','299400','307700','316100','324400','332700','341000','349300','357600','366000','374300','382600','390900','399200','407500','381200','388800','396400','404100','411700','419300','426900','434600','442200','449800','457400','465100','472700','480300','487900','495500','503200','510800','518400','526000','533700','541300','548900','556500','564200','571800','579400','587000','594600','602300','609900','617500','625100','632800','640400','648000','655600','663300','670900','678500','686100','693700','701400','709000','716600','724200','731900','739500','747100','754700','762300');
var Cost_19_426 = new Array('11900','23800','35700','47600','55500','61800','72100','82400','92700','95100','104600','114100','123600','133100','142600','152100','161600','171100','180600','190100','199600','209100','218600','228100','237600','247200','256700','266200','275700','285200','294700','304200','313700','323200','332700','342200','351700','361200','370700','380200','389700','399200','408700','418200','427700','437200','446700','456200','465700','435600','444400','453100','461800','470500','479200','487900','496600','505300','514100','522800','531500','540200','548900','557600','566300','575000','583800','592500','601200','609900','618600','627300','636000','644700','653400','662200','670900','679600','688300','697000','705700','714400','723100','731900','740600','749300','758000','766700','775400','784100','792800','801600','810300','819000','827700','836400','845100','853800','862500','871200');
var Cost_19_427 = new Array('13400','26800','40100','53500','62400','69500','81100','92700','104300','107000','117700','128400','139000','149700','160400','171100','181800','192500','203200','213900','224600','235300','246000','256700','267300','278000','288700','299400','310100','320800','331500','342200','352900','363600','374300','385000','395700','406300','417000','427700','438400','449100','459800','470500','481200','491900','502600','513300','524000','490100','499900','509700','519500','529300','539100','548900','558700','568500','578300','588100','597900','607700','617500','627300','637100','646900','656700','666500','676300','686100','695900','705700','715500','725300','735100','744900','754700','764500','774300','784100','793900','803700','813500','823300','833100','842900','852700','862500','872300','882100','891900','901700','911500','921300','931100','940900','950700','960500','970300','980100');
var Cost_19_428 = new Array('14900','29700','44600','59400','69300','77300','90100','103000','115900','118800','130700','142600','154500','166400','178200','190100','202000','213900','225800','237600','249500','261400','273300','285200','297000','308900','320800','332700','344600','356400','368300','380200','392100','404000','415800','427700','439600','451500','463400','475200','487100','499000','510900','522800','534600','546500','558400','570300','582200','544500','555400','566300','577200','588100','599000','609900','620800','631700','642600','653400','664300','675200','686100','697000','707900','718800','729700','740600','751500','762300','773200','784100','795000','805900','816800','827700','838600','849500','860400','871200','882100','893000','903900','914800','925700','936600','947500','958400','969300','980100','991000','1001900','1012800','1023700','1034600','1045500','1056400','1067300','1078200','1089000');
var Cost_19_429 = new Array('16400','32700','49100','65400','76300','85000','99100','113300','127500','130700','143800','156900','169900','183000','196100','209100','222200','235300','248300','261400','274500','287500','300600','313700','326700','339800','352900','366000','379000','392100','405200','418200','431300','444400','457400','470500','483600','496600','509700','522800','535800','548900','562000','575000','588100','601200','614200','627300','640400','599000','611000','623000','634900','646900','658900','670900','682900','694800','706800','718800','730800','742700','754700','766700','778700','790700','802600','814600','826600','838600','850600','862500','874500','886500','898500','910500','922400','934400','946400','958400','970300','982300','994300','1006300','1018300','1030200','1042200','1054200','1066200','1078200','1090100','1102100','1114100','1126100','1138100','1150000','1162000','1174000','1186000','1197900');
var Cost_19_430 = new Array('17900','35700','53500','71300','83200','92700','108200','123600','139000','142600','156900','171100','185400','199600','213900','228100','242400','256700','270900','285200','299400','313700','327900','342200','356400','370700','385000','399200','413500','427700','442000','456200','470500','484800','499000','513300','527500','541800','556000','570300','584500','598800','613100','627300','641600','655800','670100','684300','698600','653400','666500','679600','692700','705700','718800','731900','744900','758000','771100','784100','797200','810300','823300','836400','849500','862500','875600','888700','901700','914800','927900','940900','954000','967100','980100','993200','1006300','1019400','1032400','1045500','1058600','1071600','1084700','1097800','1110800','1123900','1137000','1150000','1163100','1176200','1189200','1202300','1215400','1228400','1241500','1254600','1267600','1280700','1293800','1306800');
var Cost_19_431 = new Array('19300','38700','58000','77300','90100','100400','117200','133900','150600','154500','169900','185400','200800','216300','231700','247200','262600','278000','293500','308900','324400','339800','355300','370700','386100','401600','417000','432500','447900','463400','478800','494300','509700','525100','540600','556000','571500','586900','602400','617800','633300','648700','664100','679600','695000','710500','725900','741400','756800','707900','722100','736200','750400','764500','778700','792800','807000','821200','835300','849500','863600','877800','891900','906100','920300','934400','948600','962700','976900','991000','1005200','1019400','1033500','1047700','1061800','1076000','1090100','1104300','1118500','1132600','1146800','1160900','1175100','1189200','1203400','1217600','1231700','1245900','1260000','1274200','1288300','1302500','1316700','1330800','1345000','1359100','1373300','1387400','1401600','1415700');
var Cost_19_432 = new Array('20800','41600','62400','83200','97100','108200','126200','144200','162200','166400','183000','199600','216300','232900','249500','266200','282800','299400','316100','332700','349300','366000','382600','399200','415800','432500','449100','465700','482400','499000','515600','532300','548900','565500','582200','598800','615400','632100','648700','665300','682000','698600','715200','731900','748500','765100','781800','798400','815000','762300','777600','792800','808100','823300','838600','853800','869100','884300','899600','914800','930100','945300','960500','975800','991000','1006300','1021500','1036800','1052000','1067300','1082500','1097800','1113000','1128300','1143500','1158700','1174000','1189200','1204500','1219700','1235000','1250200','1265500','1280700','1296000','1311200','1326500','1341700','1356900','1372200','1387400','1402700','1417900','1433200','1448400','1463700','1478900','1494200','1509400','1524600');
var Cost_19_433 = new Array('22300','44600','66900','89100','104000','115900','135200','154500','173800','178200','196100','213900','231700','249500','267300','285200','303000','320800','338600','356400','374300','392100','409900','427700','445500','463400','481200','499000','516800','534600','552500','570300','588100','605900','623700','641600','659400','677200','695000','712800','730700','748500','766300','784100','801900','819800','837600','855400','873200','816800','833100','849500','865800','882100','898500','914800','931100','947500','963800','980100','996500','1012800','1029200','1045500','1061800','1078200','1094500','1110800','1127200','1143500','1159800','1176200','1192500','1208800','1225200','1241500','1257800','1274200','1290500','1306800','1323200','1339500','1355900','1372200','1388500','1404900','1421200','1437500','1453900','1470200','1486500','1502900','1519200','1535500','1551900','1568200','1584500','1600900','1617200','1633500');
var Cost_19_434 = new Array('6000','11000','17000','23000','29000','31000','36000','41000','48000','52000','58000','63000','69000','75000','81000','83000','88000','93000','100000','104000','110000','115000','121000','127000','133000','135000','140000','145000','152000','156000','162000','167000','173000','179000','185000','187000','192000','197000','204000','208000','214000','219000','225000','231000','237000','239000','244000','249000','256000','260000','266000','271000','277000','283000','289000','291000','296000','301000','308000','312000','318000','323000','329000','335000','341000','343000','348000','353000','360000','364000','370000','375000','381000','387000','393000','395000','400000','405000','412000','416000','422000','427000','433000','439000','445000','447000','452000','457000','464000','468000','474000','479000','485000','491000','497000','499000','504000','509000','516000','520000');
var Cost_19_435 = new Array('6600','13200','19800','26400','30800','34400','40100','45800','51500','52800','58100','63400','68700','74000','79200','84500','89800','95100','100400','105600','110900','116200','121500','126800','132000','137300','142600','147900','153200','158400','163700','169000','174300','179600','184800','190100','195400','200700','206000','211200','216500','221800','227100','232400','237600','242900','248200','253500','258800','242000','246900','251700','256600','261400','266200','271100','275900','280800','285600','290400','295300','300100','305000','309800','314600','319500','324300','329200','334000','338800','343700','348500','353400','358200','363000','367900','372700','377600','382400','387200','392100','396900','401800','406600','411400','416300','421100','426000','430800','435600','440500','445300','450200','455000','459800','464700','469500','474400','479200','484000');
var Cost_19_436 = new Array('7500','14300','20900','29700','36300','42500','49600','56700','63800','64900','71900','78500','85000','91500','98100','104600','111100','117700','124200','130700','137300','143800','150300','156900','163400','169900','176500','183000','189500','196100','202600','209100','215700','222200','228700','235300','241800','248300','254900','261400','267900','274500','281000','287500','294100','300600','307100','313700','320200','299500','305500','311500','317500','323500','329500','335500','341500','347400','353400','359400','365400','371400','377400','383400','389400','395400','401300','407300','413300','419300','425300','431300','437300','443300','449300','455300','461200','467200','473200','479200','485200','491200','497200','503200','509200','515100','521100','527100','533100','539100','545100','551100','557100','563100','569100','575000','581000','587000','593000','599000');
var Cost_19_437 = new Array('8900','17800','26700','35600','41600','46400','54100','61800','69500','71300','78500','85600','92700','99800','107000','114100','121200','128400','135500','142600','149700','156900','164000','171100','178200','185400','192500','199600','206800','213900','221000','228100','235300','242400','249500','256700','263800','270900','278000','285200','292300','299400','306600','313700','320800','327900','335100','342200','349300','326700','333300','339800','346400','352900','359400','366000','372500','379000','385600','392100','398600','405200','411700','418200','424800','431300','437800','444400','450900','457400','464000','470500','477000','483600','490100','496600','503200','509700','516200','522800','529300','535800','542400','548900','555400','562000','568500','575000','581600','588100','594600','601200','607700','614200','620800','627300','633800','640400','646900','653400');
var Cost_19_438 = new Array('10400','20800','31200','41600','48600','54100','63100','72100','81100','83200','91500','99800','108200','116500','124800','133100','141400','149700','158100','166400','174700','183000','191300','199600','207900','216300','224600','232900','241200','249500','257800','266200','274500','282800','291100','299400','307700','316100','324400','332700','341000','349300','357600','366000','374300','382600','390900','399200','407500','381200','388800','396400','404100','411700','419300','426900','434600','442200','449800','457400','465100','472700','480300','487900','495500','503200','510800','518400','526000','533700','541300','548900','556500','564200','571800','579400','587000','594600','602300','609900','617500','625100','632800','640400','648000','655600','663300','670900','678500','686100','693700','701400','709000','716600','724200','731900','739500','747100','754700','762300');
var Cost_19_439 = new Array('11900','23800','35700','47600','55500','61800','72100','82400','92700','95100','104600','114100','123600','133100','142600','152100','161600','171100','180600','190100','199600','209100','218600','228100','237600','247200','256700','266200','275700','285200','294700','304200','313700','323200','332700','342200','351700','361200','370700','380200','389700','399200','408700','418200','427700','437200','446700','456200','465700','435600','444400','453100','461800','470500','479200','487900','496600','505300','514100','522800','531500','540200','548900','557600','566300','575000','583800','592500','601200','609900','618600','627300','636000','644700','653400','662200','670900','679600','688300','697000','705700','714400','723100','731900','740600','749300','758000','766700','775400','784100','792800','801600','810300','819000','827700','836400','845100','853800','862500','871200');
var Cost_19_440 = new Array('13400','26800','40100','53500','62400','69500','81100','92700','104300','107000','117700','128400','139000','149700','160400','171100','181800','192500','203200','213900','224600','235300','246000','256700','267300','278000','288700','299400','310100','320800','331500','342200','352900','363600','374300','385000','395700','406300','417000','427700','438400','449100','459800','470500','481200','491900','502600','513300','524000','490100','499900','509700','519500','529300','539100','548900','558700','568500','578300','588100','597900','607700','617500','627300','637100','646900','656700','666500','676300','686100','695900','705700','715500','725300','735100','744900','754700','764500','774300','784100','793900','803700','813500','823300','833100','842900','852700','862500','872300','882100','891900','901700','911500','921300','931100','940900','950700','960500','970300','980100');
var Cost_19_441 = new Array('14900','29700','44600','59400','69300','77300','90100','103000','115900','118800','130700','142600','154500','166400','178200','190100','202000','213900','225800','237600','249500','261400','273300','285200','297000','308900','320800','332700','344600','356400','368300','380200','392100','404000','415800','427700','439600','451500','463400','475200','487100','499000','510900','522800','534600','546500','558400','570300','582200','544500','555400','566300','577200','588100','599000','609900','620800','631700','642600','653400','664300','675200','686100','697000','707900','718800','729700','740600','751500','762300','773200','784100','795000','805900','816800','827700','838600','849500','860400','871200','882100','893000','903900','914800','925700','936600','947500','958400','969300','980100','991000','1001900','1012800','1023700','1034600','1045500','1056400','1067300','1078200','1089000');
var Cost_19_442 = new Array('16400','32700','49100','65400','76300','85000','99100','113300','127500','130700','143800','156900','169900','183000','196100','209100','222200','235300','248300','261400','274500','287500','300600','313700','326700','339800','352900','366000','379000','392100','405200','418200','431300','444400','457400','470500','483600','496600','509700','522800','535800','548900','562000','575000','588100','601200','614200','627300','640400','599000','611000','623000','634900','646900','658900','670900','682900','694800','706800','718800','730800','742700','754700','766700','778700','790700','802600','814600','826600','838600','850600','862500','874500','886500','898500','910500','922400','934400','946400','958400','970300','982300','994300','1006300','1018300','1030200','1042200','1054200','1066200','1078200','1090100','1102100','1114100','1126100','1138100','1150000','1162000','1174000','1186000','1197900');
var Cost_19_443 = new Array('17900','35700','53500','71300','83200','92700','108200','123600','139000','142600','156900','171100','185400','199600','213900','228100','242400','256700','270900','285200','299400','313700','327900','342200','356400','370700','385000','399200','413500','427700','442000','456200','470500','484800','499000','513300','527500','541800','556000','570300','584500','598800','613100','627300','641600','655800','670100','684300','698600','653400','666500','679600','692700','705700','718800','731900','744900','758000','771100','784100','797200','810300','823300','836400','849500','862500','875600','888700','901700','914800','927900','940900','954000','967100','980100','993200','1006300','1019400','1032400','1045500','1058600','1071600','1084700','1097800','1110800','1123900','1137000','1150000','1163100','1176200','1189200','1202300','1215400','1228400','1241500','1254600','1267600','1280700','1293800','1306800');
var Cost_19_444 = new Array('19300','38700','58000','77300','90100','100400','117200','133900','150600','154500','169900','185400','200800','216300','231700','247200','262600','278000','293500','308900','324400','339800','355300','370700','386100','401600','417000','432500','447900','463400','478800','494300','509700','525100','540600','556000','571500','586900','602400','617800','633300','648700','664100','679600','695000','710500','725900','741400','756800','707900','722100','736200','750400','764500','778700','792800','807000','821200','835300','849500','863600','877800','891900','906100','920300','934400','948600','962700','976900','991000','1005200','1019400','1033500','1047700','1061800','1076000','1090100','1104300','1118500','1132600','1146800','1160900','1175100','1189200','1203400','1217600','1231700','1245900','1260000','1274200','1288300','1302500','1316700','1330800','1345000','1359100','1373300','1387400','1401600','1415700');
var Cost_19_445 = new Array('20800','41600','62400','83200','97100','108200','126200','144200','162200','166400','183000','199600','216300','232900','249500','266200','282800','299400','316100','332700','349300','366000','382600','399200','415800','432500','449100','465700','482400','499000','515600','532300','548900','565500','582200','598800','615400','632100','648700','665300','682000','698600','715200','731900','748500','765100','781800','798400','815000','762300','777600','792800','808100','823300','838600','853800','869100','884300','899600','914800','930100','945300','960500','975800','991000','1006300','1021500','1036800','1052000','1067300','1082500','1097800','1113000','1128300','1143500','1158700','1174000','1189200','1204500','1219700','1235000','1250200','1265500','1280700','1296000','1311200','1326500','1341700','1356900','1372200','1387400','1402700','1417900','1433200','1448400','1463700','1478900','1494200','1509400','1524600');
var Cost_19_446 = new Array('22300','44600','66900','89100','104000','115900','135200','154500','173800','178200','196100','213900','231700','249500','267300','285200','303000','320800','338600','356400','374300','392100','409900','427700','445500','463400','481200','499000','516800','534600','552500','570300','588100','605900','623700','641600','659400','677200','695000','712800','730700','748500','766300','784100','801900','819800','837600','855400','873200','816800','833100','849500','865800','882100','898500','914800','931100','947500','963800','980100','996500','1012800','1029200','1045500','1061800','1078200','1094500','1110800','1127200','1143500','1159800','1176200','1192500','1208800','1225200','1241500','1257800','1274200','1290500','1306800','1323200','1339500','1355900','1372200','1388500','1404900','1421200','1437500','1453900','1470200','1486500','1502900','1519200','1535500','1551900','1568200','1584500','1600900','1617200','1633500');
var Cost_19_447 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_19_448 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_19_449 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_19_450 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_19_451 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_19_452 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_19_1361 = new Array('6000','11000','17000','23000','29000','31000','36000','41000','48000','52000','58000','63000','69000','75000','81000','83000','88000','93000','100000','104000','110000','115000','121000','127000','133000','135000','140000','145000','152000','156000','162000','167000','173000','179000','185000','187000','192000','197000','204000','208000','214000','219000','225000','231000','237000','239000','244000','249000','256000','260000','266000','271000','277000','283000','289000','291000','296000','301000','308000','312000','318000','323000','329000','335000','341000','343000','348000','353000','360000','364000','370000','375000','381000','387000','393000','395000','400000','405000','412000','416000','422000','427000','433000','439000','445000','447000','452000','457000','464000','468000','474000','479000','485000','491000','497000','499000','504000','509000','516000','520000');
var Cost_19_1362 = new Array('6000','11000','17000','23000','29000','31000','36000','41000','48000','52000','58000','63000','69000','75000','81000','83000','88000','93000','100000','104000','110000','115000','121000','127000','133000','135000','140000','145000','152000','156000','162000','167000','173000','179000','185000','187000','192000','197000','204000','208000','214000','219000','225000','231000','237000','239000','244000','249000','256000','260000','266000','271000','277000','283000','289000','291000','296000','301000','308000','312000','318000','323000','329000','335000','341000','343000','348000','353000','360000','364000','370000','375000','381000','387000','393000','395000','400000','405000','412000','416000','422000','427000','433000','439000','445000','447000','452000','457000','464000','468000','474000','479000','485000','491000','497000','499000','504000','509000','516000','520000');
var Quantity_19_count = 100;
var Quantity_19 = new Array('1000','2000','3000','4000','5000','6000','7000','8000','9000','10000','11000','12000','13000','14000','15000','16000','17000','18000','19000','20000','21000','22000','23000','24000','25000','26000','27000','28000','29000','30000','31000','32000','33000','34000','35000','36000','37000','38000','39000','40000','41000','42000','43000','44000','45000','46000','47000','48000','49000','50000','51000','52000','53000','54000','55000','56000','57000','58000','59000','60000','61000','62000','63000','64000','65000','66000','67000','68000','69000','70000','71000','72000','73000','74000','75000','76000','77000','78000','79000','80000','81000','82000','83000','84000','85000','86000','87000','88000','89000','90000','91000','92000','93000','94000','95000','96000','97000','98000','99000','100000');
var Kind_19_count = 34;
var Kind_19 = new Array('코팅60x40','코팅80x50','코팅90x55','코팅90x60','코팅90x70','코팅90x80','코팅90x90','코팅90x100','코팅90x110','코팅90x120','코팅90x130','코팅90x140','코팅90x150','비코팅60x40','비코팅80x50','비코팅90x55','비코팅90x60','비코팅90x70','비코팅90x80','비코팅90x90','비코팅90x100','비코팅90x110','비코팅90x120','비코팅90x130','비코팅90x140','비코팅90x150','코팅별사이즈','코팅투터치','비코팅별사이즈','비코팅투터치','도무송코팅','도무송비코팅','코팅70x40','무코팅70x40');
var Kind_19_Code = new Array('421','422','423','424','425','426','427','428','429','430','431','432','433','434','435','436','437','438','439','440','441','442','443','444','445','446','447','448','449','450','451','452','1361','1362');
var Cost_20_453 = new Array('7000','13000','20000','27000','34000','39600','45500','51200','56700','62000','69000','75000','82000','89000','96000','101600','107500','113200','118700','124000','131000','137000','144000','151000','158000','163600','169500','175200','180700','186000','193000','199000','206000','213000','220000','225600','231500','237200','242700','248000','255000','261000','268000','275000','282000','287600','293500','299200','304700','310000','317000','323000','330000','337000','344000','349600','355500','361200','366700','372000','379000','385000','392000','399000','406000','411600','417500','423200','428700','434000','441000','447000','454000','461000','468000','473600','479500','485200','490700','496000','503000','509000','516000','523000','530000','535600','541500','547200','552700','558000','565000','571000','578000','585000','592000','597600','603500','609200','614700','620000');
var Cost_20_454 = new Array('8000','15900','23800','31700','37400','42300','49300','56400','63400','66000','72600','79200','85800','92400','99000','105600','112200','118800','125400','132000','138600','145200','151800','158400','165000','171600','178200','184800','191400','198000','204600','211200','217800','224400','231000','237600','244200','250800','257400','264000','270600','277200','283800','290400','297000','303600','310200','316800','323400','308000','314200','320400','326500','332700','338800','345000','351200','357300','363500','369600','375800','382000','388100','394300','400400','406600','412800','418900','425100','431200','437400','443600','449700','455900','462000','468200','474400','480500','486700','492800','499000','505200','511300','517500','523600','529800','536000','542100','548300','554400','560600','566800','572900','579100','585200','591400','597600','603700','609900','616000');
var Cost_20_455 = new Array('10000','19700','29500','39300','46300','52300','61000','69700','78500','81700','89900','98100','106200','114400','122600','130700','138900','147100','155200','163400','171600','179700','187900','196100','204200','212400','220600','228700','236900','245100','253200','261400','269600','277700','285900','294100','302200','310400','318600','326700','334900','343100','351300','359400','367600','375800','383900','392100','400300','381200','388800','396400','404100','411700','419300','426900','434600','442200','449800','457400','465100','472700','480300','487900','495500','503200','510800','518400','526000','533700','541300','548900','556500','564200','571800','579400','587000','594600','602300','609900','617500','625100','632800','640400','648000','655600','663300','670900','678500','686100','693700','701400','709000','716600','724200','731900','739500','747100','754700','762300');
var Cost_20_456 = new Array('10700','21400','32100','42800','50500','57100','66600','76100','85600','89100','98100','107000','115900','124800','133700','142600','151500','160400','169300','178200','187200','196100','205000','213900','222800','231700','240600','249500','258400','267300','276300','285200','294100','303000','311900','320800','329700','338600','347500','356400','365400','374300','383200','392100','401000','409900','418800','427700','436600','415800','424200','432500','440800','449100','457400','465700','474100','482400','490700','499000','507300','515600','524000','532300','540600','548900','557200','565500','573900','582200','590500','598800','607100','615400','623700','632100','640400','648700','657000','665300','673600','682000','690300','698600','706900','715200','723500','731900','740200','748500','756800','765100','773400','781800','790100','798400','806700','815000','823300','831600');
var Cost_20_457 = new Array('12500','25000','37500','49900','59000','66600','77700','88800','99800','104000','114400','124800','135200','145600','156000','166400','176800','187200','197600','207900','218300','228700','239100','249500','259900','270300','280700','291100','301500','311900','322300','332700','343100','353500','363900','374300','384700','395100','405500','415800','426200','436600','447000','457400','467800','478200','488600','499000','509400','485100','494900','504600','514300','524000','533700','543400','553100','562800','572500','582200','591900','601600','611300','621000','630700','640400','650100','659800','669500','679200','688900','698600','708300','718000','727700','737400','747100','756800','766500','776200','785900','795600','805300','815000','824700','834400','844100','853800','863500','873200','882900','892600','902300','912000','921700','931400','941100','950800','960500','970200');
var Cost_20_458 = new Array('14300','28600','42800','57100','67400','76100','88800','101400','114100','118800','130700','142600','154500','166400','178200','190100','202000','213900','225800','237600','249500','261400','273300','285200','297000','308900','320800','332700','344600','356400','368300','380200','392100','404000','415800','427700','439600','451500','463400','475200','487100','499000','510900','522800','534600','546500','558400','570300','582200','554400','565500','576600','587700','598800','609900','621000','632100','643200','654200','665300','676400','687500','698600','709700','720800','731900','742900','754000','765100','776200','787300','798400','809500','820600','831600','842700','853800','864900','876000','887100','898200','909300','920400','931400','942500','953600','964700','975800','986900','998000','1009100','1020100','1031200','1042300','1053400','1064500','1075600','1086700','1097800','1108800');
var Cost_20_459 = new Array('16100','32100','48200','64200','75800','85600','99800','114100','128400','133700','147100','160400','173800','187200','200500','213900','227300','240600','254000','267300','280700','294100','307400','320800','334200','347500','360900','374300','387600','401000','414400','427700','441100','454500','467800','481200','494600','507900','521300','534600','548000','561400','574700','588100','601500','614800','628200','641600','654900','623700','636200','648700','661200','673600','686100','698600','711100','723500','736000','748500','761000','773400','785900','798400','810900','823300','835800','848300','860800','873200','885700','898200','910700','923100','935600','948100','960500','973000','985500','998000','1010400','1022900','1035400','1047900','1060300','1072800','1085300','1097800','1110200','1122700','1135200','1147700','1160100','1172600','1185100','1197600','1210000','1222500','1235000','1247400');
var Cost_20_460 = new Array('17900','35700','53500','71300','84200','95100','110900','126800','142600','148500','163400','178200','193100','207900','222800','237600','252500','267300','282200','297000','311900','326700','341600','356400','371300','386100','401000','415800','430700','445500','460400','475200','490100','504900','519800','534600','549500','564300','579200','594000','608900','623700','638600','653400','668300','683100','698000','712800','727700','693000','706900','720800','734600','748500','762300','776200','790100','803900','817800','831600','845500','859400','873200','887100','900900','914800','928700','942500','956400','970200','984100','998000','1011800','1025700','1039500','1053400','1067300','1081100','1095000','1108800','1122700','1136600','1150400','1164300','1178100','1192000','1205900','1219700','1233600','1247400','1261300','1275200','1289000','1302900','1316700','1330600','1344500','1358300','1372200','1386000');
var Cost_20_461 = new Array('19700','39300','58900','78500','92600','104600','122000','139400','156900','163400','179700','196100','212400','228700','245100','261400','277700','294100','310400','326700','343100','359400','375800','392100','408400','424800','441100','457400','473800','490100','506400','522800','539100','555400','571800','588100','604400','620800','637100','653400','669800','686100','702500','718800','735100','751500','767800','784100','800500','762300','777600','792800','808100','823300','838600','853800','869100','884300','899600','914800','930100','945300','960500','975800','991000','1006300','1021500','1036800','1052000','1067300','1082500','1097800','1113000','1128300','1143500','1158700','1174000','1189200','1204500','1219700','1235000','1250200','1265500','1280700','1296000','1311200','1326500','1341700','1356900','1372200','1387400','1402700','1417900','1433200','1448400','1463700','1478900','1494200','1509400','1524600');
var Cost_20_462 = new Array('21400','42800','64200','85600','101000','114100','133100','152100','171100','178200','196100','213900','231700','249500','267300','285200','303000','320800','338600','356400','374300','392100','409900','427700','445500','463400','481200','499000','516800','534600','552500','570300','588100','605900','623700','641600','659400','677200','695000','712800','730700','748500','766300','784100','801900','819800','837600','855400','873200','831600','848300','864900','881500','898200','914800','931400','948100','964700','981300','998000','1014600','1031200','1047900','1064500','1081100','1097800','1114400','1131000','1147700','1164300','1180900','1197600','1214200','1230800','1247400','1264100','1280700','1297300','1314000','1330600','1347200','1363900','1380500','1397100','1413800','1430400','1447000','1463700','1480300','1496900','1513600','1530200','1546800','1563500','1580100','1596700','1613400','1630000','1646600','1663200');
var Cost_20_463 = new Array('23200','46400','69500','92700','109400','123600','144200','164800','185400','193100','212400','231700','251000','270300','289600','308900','328200','347500','366800','386100','405500','424800','444100','463400','482700','502000','521300','540600','559900','579200','598500','617800','637100','656400','675700','695000','714300','733600','752900','772200','791600','810900','830200','849500','868800','888100','907400','926700','946000','900900','919000','937000','955000','973000','991000','1009100','1027100','1045100','1063100','1081100','1099100','1117200','1135200','1153200','1171200','1189200','1207300','1225300','1243300','1261300','1279300','1297300','1315400','1333400','1351400','1369400','1387400','1405500','1423500','1441500','1459500','1477500','1495500','1513600','1531600','1549600','1567600','1585600','1603700','1621700','1639700','1657700','1675700','1693700','1711800','1729800','1747800','1765800','1783800','1801800');
var Cost_20_464 = new Array('25000','49900','74900','99800','117900','133100','155300','177500','199600','207900','228700','249500','270300','291100','311900','332700','353500','374300','395100','415800','436600','457400','478200','499000','519800','540600','561400','582200','603000','623700','644500','665300','686100','706900','727700','748500','769300','790100','810900','831600','852400','873200','894000','914800','935600','956400','977200','998000','1018800','970200','989700','1009100','1028500','1047900','1067300','1086700','1106100','1125500','1144900','1164300','1183700','1203100','1222500','1241900','1261300','1280700','1300100','1319500','1338900','1358300','1377700','1397100','1416500','1435900','1455300','1474800','1494200','1513600','1533000','1552400','1571800','1591200','1610600','1630000','1649400','1668800','1688200','1707600','1727000','1746400','1765800','1785200','1804600','1824000','1843400','1862800','1882200','1901600','1921000','1940400');
var Cost_20_465 = new Array('26800','53500','80200','107000','126300','142600','166400','190100','213900','222800','245100','267300','289600','311900','334200','356400','378700','401000','423300','445500','467800','490100','512400','534600','556900','579200','601500','623700','646000','668300','690600','712800','735100','757400','779700','801900','824200','846500','868800','891000','913300','935600','957900','980100','1002400','1024700','1047000','1069200','1091500','1039500','1060300','1081100','1101900','1122700','1143500','1164300','1185100','1205900','1226700','1247400','1268200','1289000','1309800','1330600','1351400','1372200','1393000','1413800','1434600','1455300','1476100','1496900','1517700','1538500','1559300','1580100','1600900','1621700','1642500','1663200','1684000','1704800','1725600','1746400','1767200','1788000','1808800','1829600','1850400','1871100','1891900','1912700','1933500','1954300','1975100','1995900','2016700','2037500','2058300','2079000');
var Cost_20_466 = new Array('7000','13000','20000','27000','34000','39600','45500','51200','56700','62000','69000','75000','82000','89000','96000','101600','107500','113200','118700','124000','131000','137000','144000','151000','158000','163600','169500','175200','180700','186000','193000','199000','206000','213000','220000','225600','231500','237200','242700','248000','255000','261000','268000','275000','282000','287600','293500','299200','304700','310000','317000','323000','330000','337000','344000','349600','355500','361200','366700','372000','379000','385000','392000','399000','406000','411600','417500','423200','428700','434000','441000','447000','454000','461000','468000','473600','479500','485200','490700','496000','503000','509000','516000','523000','530000','535600','541500','547200','552700','558000','565000','571000','578000','585000','592000','597600','603500','609200','614700','620000');
var Cost_20_467 = new Array('8000','15900','23800','31700','37400','42300','49300','56400','63400','66000','72600','79200','85800','92400','99000','105600','112200','118800','125400','132000','138600','145200','151800','158400','165000','171600','178200','184800','191400','198000','204600','211200','217800','224400','231000','237600','244200','250800','257400','264000','270600','277200','283800','290400','297000','303600','310200','316800','323400','308000','314200','320400','326500','332700','338800','345000','351200','357300','363500','369600','375800','382000','388100','394300','400400','406600','412800','418900','425100','431200','437400','443600','449700','455900','462000','468200','474400','480500','486700','492800','499000','505200','511300','517500','523600','529800','536000','542100','548300','554400','560600','566800','572900','579100','585200','591400','597600','603700','609900','616000');
var Cost_20_468 = new Array('10000','19700','29500','39300','46300','52300','61000','69700','78500','81700','89900','98100','106200','114400','122600','130700','138900','147100','155200','163400','171600','179700','187900','196100','204200','212400','220600','228700','236900','245100','253200','261400','269600','277700','285900','294100','302200','310400','318600','326700','334900','343100','351300','359400','367600','375800','383900','392100','400300','381200','388800','396400','404100','411700','419300','426900','434600','442200','449800','457400','465100','472700','480300','487900','495500','503200','510800','518400','526000','533700','541300','548900','556500','564200','571800','579400','587000','594600','602300','609900','617500','625100','632800','640400','648000','655600','663300','670900','678500','686100','693700','701400','709000','716600','724200','731900','739500','747100','754700','762300');
var Cost_20_469 = new Array('10700','21400','32100','42800','50500','57100','66600','76100','85600','89100','98100','107000','115900','124800','133700','142600','151500','160400','169300','178200','187200','196100','205000','213900','222800','231700','240600','249500','258400','267300','276300','285200','294100','303000','311900','320800','329700','338600','347500','356400','365400','374300','383200','392100','401000','409900','418800','427700','436600','415800','424200','432500','440800','449100','457400','465700','474100','482400','490700','499000','507300','515600','524000','532300','540600','548900','557200','565500','573900','582200','590500','598800','607100','615400','623700','632100','640400','648700','657000','665300','673600','682000','690300','698600','706900','715200','723500','731900','740200','748500','756800','765100','773400','781800','790100','798400','806700','815000','823300','831600');
var Cost_20_470 = new Array('12500','25000','37500','49900','59000','66600','77700','88800','99800','104000','114400','124800','135200','145600','156000','166400','176800','187200','197600','207900','218300','228700','239100','249500','259900','270300','280700','291100','301500','311900','322300','332700','343100','353500','363900','374300','384700','395100','405500','415800','426200','436600','447000','457400','467800','478200','488600','499000','509400','485100','494900','504600','514300','524000','533700','543400','553100','562800','572500','582200','591900','601600','611300','621000','630700','640400','650100','659800','669500','679200','688900','698600','708300','718000','727700','737400','747100','756800','766500','776200','785900','795600','805300','815000','824700','834400','844100','853800','863500','873200','882900','892600','902300','912000','921700','931400','941100','950800','960500','970200');
var Cost_20_471 = new Array('14300','28600','42800','57100','67400','76100','88800','101400','114100','118800','130700','142600','154500','166400','178200','190100','202000','213900','225800','237600','249500','261400','273300','285200','297000','308900','320800','332700','344600','356400','368300','380200','392100','404000','415800','427700','439600','451500','463400','475200','487100','499000','510900','522800','534600','546500','558400','570300','582200','554400','565500','576600','587700','598800','609900','621000','632100','643200','654200','665300','676400','687500','698600','709700','720800','731900','742900','754000','765100','776200','787300','798400','809500','820600','831600','842700','853800','864900','876000','887100','898200','909300','920400','931400','942500','953600','964700','975800','986900','998000','1009100','1020100','1031200','1042300','1053400','1064500','1075600','1086700','1097800','1108800');
var Cost_20_472 = new Array('16100','32100','48200','64200','75800','85600','99800','114100','128400','133700','147100','160400','173800','187200','200500','213900','227300','240600','254000','267300','280700','294100','307400','320800','334200','347500','360900','374300','387600','401000','414400','427700','441100','454500','467800','481200','494600','507900','521300','534600','548000','561400','574700','588100','601500','614800','628200','641600','654900','623700','636200','648700','661200','673600','686100','698600','711100','723500','736000','748500','761000','773400','785900','798400','810900','823300','835800','848300','860800','873200','885700','898200','910700','923100','935600','948100','960500','973000','985500','998000','1010400','1022900','1035400','1047900','1060300','1072800','1085300','1097800','1110200','1122700','1135200','1147700','1160100','1172600','1185100','1197600','1210000','1222500','1235000','1247400');
var Cost_20_473 = new Array('17900','35700','53500','71300','84200','95100','110900','126800','142600','148500','163400','178200','193100','207900','222800','237600','252500','267300','282200','297000','311900','326700','341600','356400','371300','386100','401000','415800','430700','445500','460400','475200','490100','504900','519800','534600','549500','564300','579200','594000','608900','623700','638600','653400','668300','683100','698000','712800','727700','693000','706900','720800','734600','748500','762300','776200','790100','803900','817800','831600','845500','859400','873200','887100','900900','914800','928700','942500','956400','970200','984100','998000','1011800','1025700','1039500','1053400','1067300','1081100','1095000','1108800','1122700','1136600','1150400','1164300','1178100','1192000','1205900','1219700','1233600','1247400','1261300','1275200','1289000','1302900','1316700','1330600','1344500','1358300','1372200','1386000');
var Cost_20_474 = new Array('19700','39300','58900','78500','92600','104600','122000','139400','156900','163400','179700','196100','212400','228700','245100','261400','277700','294100','310400','326700','343100','359400','375800','392100','408400','424800','441100','457400','473800','490100','506400','522800','539100','555400','571800','588100','604400','620800','637100','653400','669800','686100','702500','718800','735100','751500','767800','784100','800500','762300','777600','792800','808100','823300','838600','853800','869100','884300','899600','914800','930100','945300','960500','975800','991000','1006300','1021500','1036800','1052000','1067300','1082500','1097800','1113000','1128300','1143500','1158700','1174000','1189200','1204500','1219700','1235000','1250200','1265500','1280700','1296000','1311200','1326500','1341700','1356900','1372200','1387400','1402700','1417900','1433200','1448400','1463700','1478900','1494200','1509400','1524600');
var Cost_20_475 = new Array('21400','42800','64200','85600','101000','114100','133100','152100','171100','178200','196100','213900','231700','249500','267300','285200','303000','320800','338600','356400','374300','392100','409900','427700','445500','463400','481200','499000','516800','534600','552500','570300','588100','605900','623700','641600','659400','677200','695000','712800','730700','748500','766300','784100','801900','819800','837600','855400','873200','831600','848300','864900','881500','898200','914800','931400','948100','964700','981300','998000','1014600','1031200','1047900','1064500','1081100','1097800','1114400','1131000','1147700','1164300','1180900','1197600','1214200','1230800','1247400','1264100','1280700','1297300','1314000','1330600','1347200','1363900','1380500','1397100','1413800','1430400','1447000','1463700','1480300','1496900','1513600','1530200','1546800','1563500','1580100','1596700','1613400','1630000','1646600','1663200');
var Cost_20_476 = new Array('23200','46400','69500','92700','109400','123600','144200','164800','185400','193100','212400','231700','251000','270300','289600','308900','328200','347500','366800','386100','405500','424800','444100','463400','482700','502000','521300','540600','559900','579200','598500','617800','637100','656400','675700','695000','714300','733600','752900','772200','791600','810900','830200','849500','868800','888100','907400','926700','946000','900900','919000','937000','955000','973000','991000','1009100','1027100','1045100','1063100','1081100','1099100','1117200','1135200','1153200','1171200','1189200','1207300','1225300','1243300','1261300','1279300','1297300','1315400','1333400','1351400','1369400','1387400','1405500','1423500','1441500','1459500','1477500','1495500','1513600','1531600','1549600','1567600','1585600','1603700','1621700','1639700','1657700','1675700','1693700','1711800','1729800','1747800','1765800','1783800','1801800');
var Cost_20_477 = new Array('25000','49900','74900','99800','117900','133100','155300','177500','199600','207900','228700','249500','270300','291100','311900','332700','353500','374300','395100','415800','436600','457400','478200','499000','519800','540600','561400','582200','603000','623700','644500','665300','686100','706900','727700','748500','769300','790100','810900','831600','852400','873200','894000','914800','935600','956400','977200','998000','1018800','970200','989700','1009100','1028500','1047900','1067300','1086700','1106100','1125500','1144900','1164300','1183700','1203100','1222500','1241900','1261300','1280700','1300100','1319500','1338900','1358300','1377700','1397100','1416500','1435900','1455300','1474800','1494200','1513600','1533000','1552400','1571800','1591200','1610600','1630000','1649400','1668800','1688200','1707600','1727000','1746400','1765800','1785200','1804600','1824000','1843400','1862800','1882200','1901600','1921000','1940400');
var Cost_20_478 = new Array('26800','53500','80200','107000','126300','142600','166400','190100','213900','222800','245100','267300','289600','311900','334200','356400','378700','401000','423300','445500','467800','490100','512400','534600','556900','579200','601500','623700','646000','668300','690600','712800','735100','757400','779700','801900','824200','846500','868800','891000','913300','935600','957900','980100','1002400','1024700','1047000','1069200','1091500','1039500','1060300','1081100','1101900','1122700','1143500','1164300','1185100','1205900','1226700','1247400','1268200','1289000','1309800','1330600','1351400','1372200','1393000','1413800','1434600','1455300','1476100','1496900','1517700','1538500','1559300','1580100','1600900','1621700','1642500','1663200','1684000','1704800','1725600','1746400','1767200','1788000','1808800','1829600','1850400','1871100','1891900','1912700','1933500','1954300','1975100','1995900','2016700','2037500','2058300','2079000');
var Cost_20_479 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_20_480 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_20_481 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_20_482 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_20_483 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_20_484 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_20_1363 = new Array('7000','13000','20000','27000','34000','39600','45500','51200','56700','62000','69000','75000','82000','89000','96000','101600','107500','113200','118700','124000','131000','137000','144000','151000','158000','163600','169500','175200','180700','186000','193000','199000','206000','213000','220000','225600','231500','237200','242700','248000','255000','261000','268000','275000','282000','287600','293500','299200','304700','310000','317000','323000','330000','337000','344000','349600','355500','361200','366700','372000','379000','385000','392000','399000','406000','411600','417500','423200','428700','434000','441000','447000','454000','461000','468000','473600','479500','485200','490700','496000','503000','509000','516000','523000','530000','535600','541500','547200','552700','558000','565000','571000','578000','585000','592000','597600','603500','609200','614700','620000');
var Cost_20_1364 = new Array('7000','13000','20000','27000','34000','39600','45500','51200','56700','62000','69000','75000','82000','89000','96000','101600','107500','113200','118700','124000','131000','137000','144000','151000','158000','163600','169500','175200','180700','186000','193000','199000','206000','213000','220000','225600','231500','237200','242700','248000','255000','261000','268000','275000','282000','287600','293500','299200','304700','310000','317000','323000','330000','337000','158000','349600','355500','361200','366700','372000','379000','385000','392000','399000','406000','411600','417500','423200','428700','434000','441000','447000','454000','461000','468000','473600','479500','485200','490700','496000','503000','509000','516000','523000','530000','535600','541500','547200','552700','558000','565000','571000','578000','585000','592000','597600','603500','609200','614700','620000');
var Quantity_20_count = 100;
var Quantity_20 = new Array('1000','2000','3000','4000','5000','6000','7000','8000','9000','10000','11000','12000','13000','14000','15000','16000','17000','18000','19000','20000','21000','22000','23000','24000','25000','26000','27000','28000','29000','30000','31000','32000','33000','34000','35000','36000','37000','38000','39000','40000','41000','42000','43000','44000','45000','46000','47000','48000','49000','50000','51000','52000','53000','54000','55000','56000','57000','58000','59000','60000','61000','62000','63000','64000','65000','66000','67000','68000','69000','70000','71000','72000','73000','74000','75000','76000','77000','78000','79000','80000','81000','82000','83000','84000','85000','86000','87000','88000','89000','90000','91000','92000','93000','94000','95000','96000','97000','98000','99000','100000');
var Kind_20_count = 34;
var Kind_20 = new Array('코팅60x40','코팅80x50','코팅90x55','코팅90x60','코팅90x70','코팅90x80','코팅90x90','코팅90x100','코팅90x110','코팅90x120','코팅90x130','코팅90x140','코팅90x150','비코팅60x40','비코팅80x50','비코팅90x55','비코팅90x60','비코팅90x70','비코팅90x80','비코팅90x90','비코팅90x100','비코팅90x110','비코팅90x120','비코팅90x130','비코팅90x140','비코팅90x150','코팅별사이즈','비코팅별사이즈','코팅투터치','비코팅투터치','도무송코팅','도무송비코팅','코팅70x40','무코팅70x40');
var Kind_20_Code = new Array('453','454','455','456','457','458','459','460','461','462','463','464','465','466','467','468','469','470','471','472','473','474','475','476','477','478','479','480','481','482','483','484','1363','1364');
var Cost_21_485 = new Array('15400','30000','44900','59900','70400','81900','95500','109200','122800','132000','145200','158400','171600','184800','198000','211200','224400','237600','250800','264000','330000','396000','462000','528000','594000','550000','1100000');
var Cost_21_486 = new Array('19100','37100','55600','74100','87200','101300','118200','135100','152000','163400','179700','196100','212400','228700','245100','261400','277700','294100','310400','326700','408400','490100','571800','653400','735100','680700','1361300');
var Cost_21_487 = new Array('20800','40400','60600','80800','95100','110500','128900','147400','165800','178200','196100','213900','231700','249500','267300','285200','303000','320800','338600','356400','445500','534600','623700','712800','801900','742500','1485000');
var Cost_21_488 = new Array('24300','47200','70700','94300','110900','128900','150400','171900','193400','207900','228700','249500','270300','291100','311900','332700','353500','374300','395100','415800','519800','623700','727700','831600','935600','866300','1732500');
var Cost_21_489 = new Array('27800','53900','80800','107800','126800','147400','171900','196500','221000','237600','261400','285200','308900','332700','356400','380200','404000','427700','451500','475200','594000','712800','831600','950400','1069200','990000','1980000');
var Cost_21_490 = new Array('31200','60600','90900','121200','142600','165800','193400','221000','248600','267300','294100','320800','347500','374300','401000','427700','454500','481200','507900','534600','668300','801900','935600','1069200','1202900','1113800','2227500');
var Cost_21_491 = new Array('34700','67400','101000','134700','158400','184200','214900','245600','276300','297000','326700','356400','386100','415800','445500','475200','504900','534600','564300','594000','742500','891000','1039500','1188000','1336500','1237500','2475000');
var Cost_21_492 = new Array('38200','74100','111100','148200','174300','202600','236400','270100','303900','326700','359400','392100','424800','457400','490100','522800','555400','588100','620800','653400','816800','980100','1143500','1306800','1470200','1361300','2722500');
var Cost_21_493 = new Array('41600','80800','121200','161600','190100','221000','257800','294700','331500','356400','392100','427700','463400','499000','534600','570300','605900','641600','677200','712800','891000','1069200','1247400','1425600','1603800','1485000','2970000');
var Cost_21_494 = new Array('45100','87600','131300','175100','206000','239400','279300','319200','359100','386100','424800','463400','502000','540600','579200','617800','656400','695000','733600','772200','965300','1158300','1351400','1544400','1737500','1608800','3217500');
var Cost_21_495 = new Array('48600','94300','141400','188500','221800','257800','300800','343800','386700','415800','457400','499000','540600','582200','623700','665300','706900','748500','790100','831600','1039500','1247400','1455300','1663200','1871100','1732500','3465000');
var Cost_21_496 = new Array('52000','101000','151500','202000','237600','276300','322300','368300','414400','445500','490100','534600','579200','623700','668300','712800','757400','801900','846500','891000','1113800','1336500','1559300','1782000','2004800','1856300','3712500');
var Cost_21_497 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_21_498 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_21_975 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Quantity_21_count = 27;
var Quantity_21 = new Array('1000','2000','3000','4000','5000','6000','7000','8000','9000','10000','11000','12000','13000','14000','15000','16000','17000','18000','19000','20000','25000','30000','35000','40000','45000','50000','100000');
var Kind_21_count = 15;
var Kind_21 = new Array('80x50','90x55','90x60','90x70','90x80','90x90','90x100','90x110','90x120','90x130','90x140','90x150','별사이즈','투터치','도무송');
var Kind_21_Code = new Array('485','486','487','488','489','490','491','492','493','494','495','496','497','498','975');
var Cost_22_499 = new Array('15400','30000','44900','59900','70400','81900','95500','109200','122800','132000','145200','158400','171600','184800','198000','211200','224400','237600','250800','264000','330000','396000','462000','528000','594000','550000','1100000');
var Cost_22_500 = new Array('19100','37100','55600','74100','87200','101300','118200','135100','152000','163400','179700','196100','212400','228700','245100','261400','277700','294100','310400','326700','408400','490100','571800','653400','735100','680700','1361300');
var Cost_22_501 = new Array('20800','40400','60600','80800','95100','110500','128900','147400','165800','178200','196100','213900','231700','249500','267300','285200','303000','320800','338600','356400','445500','534600','623700','712800','801900','742500','1485000');
var Cost_22_502 = new Array('24300','47200','70700','94300','110900','128900','150400','171900','193400','207900','228700','249500','270300','291100','311900','332700','353500','374300','395100','415800','519800','623700','727700','831600','935600','866300','1732500');
var Cost_22_503 = new Array('27800','53900','80800','107800','126800','147400','171900','196500','221000','237600','261400','285200','308900','332700','356400','380200','404000','427700','451500','475200','594000','712800','831600','950400','1069200','990000','1980000');
var Cost_22_504 = new Array('31200','60600','90900','121200','142600','165800','193400','221000','248600','267300','294100','320800','347500','374300','401000','427700','454500','481200','507900','534600','668300','801900','935600','1069200','1202900','1113800','2227500');
var Cost_22_505 = new Array('34700','67400','101000','134700','158400','184200','214900','245600','276300','297000','326700','356400','386100','415800','445500','475200','504900','534600','564300','594000','742500','891000','1039500','1188000','1336500','1237500','2475000');
var Cost_22_506 = new Array('38200','74100','111100','148200','174300','202600','236400','270100','303900','326700','359400','392100','424800','457400','490100','522800','555400','588100','620800','653400','816800','980100','1143500','1306800','1470200','1361300','2722500');
var Cost_22_507 = new Array('41600','80800','121200','161600','190100','221000','257800','294700','331500','356400','392100','427700','463400','499000','534600','570300','605900','641600','677200','712800','891000','1069200','1247400','1425600','1603800','1485000','2970000');
var Cost_22_508 = new Array('45100','87600','131300','175100','206000','239400','279300','319200','359100','386100','424800','463400','502000','540600','579200','617800','656400','695000','733600','772200','965300','1158300','1351400','1544400','1737500','1608800','3217500');
var Cost_22_509 = new Array('48600','94300','141400','188500','221800','257800','300800','343800','386700','415800','457400','499000','540600','582200','623700','665300','706900','748500','790100','831600','1039500','1247400','1455300','1663200','1871100','1732500','3465000');
var Cost_22_510 = new Array('52000','101000','151500','202000','237600','276300','322300','368300','414400','445500','490100','534600','579200','623700','668300','712800','757400','801900','846500','891000','1113800','1336500','1559300','1782000','2004800','1856300','3712500');
var Cost_22_511 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_22_512 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_22_976 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Quantity_22_count = 27;
var Quantity_22 = new Array('1000','2000','3000','4000','5000','6000','7000','8000','9000','10000','11000','12000','13000','14000','15000','16000','17000','18000','19000','20000','25000','30000','35000','40000','45000','50000','100000');
var Kind_22_count = 15;
var Kind_22 = new Array('80x50','90x55','90x60','90x70','90x80','90x90','90x100','90x110','90x120','90x130','90x140','90x150','별사이즈','투터치','도무송');
var Kind_22_Code = new Array('499','500','501','502','503','504','505','506','507','508','509','510','511','512','976');
var Cost_23_513 = new Array('6000','11000','17000','23000','29000','31000','36000','41000','48000','52000');
var Cost_23_514 = new Array('6000','11000','17000','23000','29000','31000','36000','41000','48000','52000');
var Cost_23_515 = new Array('6000','11000','17000','23000','29000','31000','36000','41000','48000','52000');
var Cost_23_516 = new Array('6000','11000','17000','23000','29000','31000','36000','41000','48000','52000');
var Cost_23_517 = new Array('6000','11000','17000','23000','29000','31000','36000','41000','48000','52000');
var Quantity_23_count = 10;
var Quantity_23 = new Array('1000','2000','3000','4000','5000','6000','7000','8000','9000','10000');
var Kind_23_count = 5;
var Kind_23 = new Array('55x24','55x33','50x30','50x20','50x17');
var Kind_23_Code = new Array('513','514','515','516','517');
var Cost_24_518 = new Array('11000','16500','22000','27500','33000','39600','43000','49200','55300','58000','63800','69600','75400','81200','87000','92800','98600','104400','110200','116000','145000','174000','203000','232000','261000','290000','580000');
var Cost_24_519 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_24_520 = new Array('12500','19500','26500','33500','40500','48600','53500','61200','68800','71500','78700','85800','93000','100100','107300','114400','121600','128700','135900','143000','178800','214500','250300','286000','321800','357500','715000');
var Cost_24_521 = new Array('14000','23000','32000','41000','50000','60000','66000','75500','84900','87000','95700','104400','113100','121800','130500','139200','147900','156600','165300','174000','217500','261000','304500','348000','391500','435000','870000');
var Cost_24_522 = new Array('11000','16500','22000','27500','33000','39600','43000','49200','55300','58000','63800','69600','75400','81200','87000','92800','98600','104400','110200','116000','145000','174000','203000','232000','261000','290000','580000');
var Cost_24_523 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_24_524 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_24_525 = new Array('12500','19500','26500','33500','40500','48600','53500','61200','68800','71500','78700','85800','93000','100100','107300','114400','121600','128700','135900','143000','178800','214500','250300','286000','321800','357500','715000');
var Cost_24_526 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_24_527 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_24_528 = new Array('12000','19500','26500','33500','40500','48600','53500','61200','68800','71500','78700','85800','93000','100100','107300','114400','121600','128700','135900','143000','178800','214500','250300','286000','321800','357500','715000');
var Cost_24_529 = new Array('12500','21000','30000','39000','48000','57600','64000','73200','82300','85000','93500','102000','110500','119000','127500','136000','144500','153000','161500','170000','212500','255000','297500','340000','382500','425000','850000');
var Cost_24_530 = new Array('14000','23000','32000','41000','50000','60000','66000','75500','84900','87000','95700','104400','113100','121800','130500','139200','147900','156600','165300','174000','217500','261000','304500','348000','391500','435000','870000');
var Cost_24_531 = new Array('11000','16500','22000','27500','33000','39600','43000','49200','55300','58000','63800','69600','75400','81200','87000','92800','98600','104400','110200','116000','145000','174000','203000','232000','261000','290000','580000');
var Cost_24_532 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_24_533 = new Array('11000','16500','22000','27500','33000','39600','43000','49200','55300','58000','63800','69600','75400','81200','87000','92800','98600','104400','110200','116000','145000','174000','203000','232000','261000','290000','580000');
var Cost_24_534 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_24_535 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_24_536 = new Array('12500','19500','26500','33500','40500','48600','53500','61200','68800','71500','78700','85800','93000','100100','107300','114400','121600','128700','135900','143000','178800','214500','250300','286000','321800','357500','715000');
var Cost_24_537 = new Array('14000','23000','32000','41000','50000','60000','66000','75500','84900','87000','95700','104400','113100','121800','130500','139200','147900','156600','165300','174000','217500','261000','304500','348000','391500','435000','870000');
var Cost_24_538 = new Array('9500','14500','19500','24500','29500','35400','39000','44600','50200','52500','57800','63000','68300','73500','78800','84000','89300','94500','99800','105000','131300','157500','183800','210000','236300','262500','525000');
var Cost_24_539 = new Array('10000','15000','20000','25000','30000','36000','39500','45200','50800','53000','58300','63600','68900','74200','79500','84800','90100','95400','100700','106000','132500','159000','185500','212000','238500','265000','530000');
var Cost_24_540 = new Array('10500','16800','22300','27800','33300','40000','43300','49500','55700','58300','64200','70000','75800','81700','87500','93300','99200','105000','110800','116600','145800','174900','204100','233200','262400','291500','583000');
var Cost_24_541 = new Array('11000','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_24_542 = new Array('11500','19500','26500','33500','40500','48600','53500','61200','68800','71500','78700','85800','93000','100100','107300','114400','121600','128700','135900','143000','178800','214500','250300','286000','321800','357500','715000');
var Cost_24_543 = new Array('12000','23000','32000','41000','50000','60000','66000','75500','84900','87000','95700','104400','113100','121800','130500','139200','147900','156600','165300','174000','217500','261000','304500','348000','391500','435000','870000');
var Cost_24_544 = new Array('13500','25000','39500','51500','61500','66500','77000','88000','98000','105000','124900','136200','147600','158900','170300','181600','193000','204300','215700','227000','283800','340500','397300','454000','510800','567500','1135000');
var Cost_24_1089 = new Array('17000','29000','41000','53000','65000','78000','85000','97200','109300','110000','121000','132000','143000','154000','165000','176000','187000','198000','209000','220000','275000','330000','385000','440000','495000','550000','1100000');
var Cost_24_1090 = new Array('18500','31000','43500','56000','68500','82200','89500','102300','115100','115500','127100','138600','150200','161700','173300','184800','196400','207900','219500','231000','288800','346500','404300','462000','519800','577500','1155000');
var Cost_24_1091 = new Array('20000','33500','47000','60500','74000','88800','97000','110900','124800','125000','137500','150000','162500','175000','187500','200000','212500','225000','237500','250000','312500','375000','437500','500000','562500','625000','1250000');
var Cost_24_1092 = new Array('21500','36000','50500','65000','79500','95400','104500','119500','134400','134500','148000','161400','174900','188300','201800','215200','228700','242100','255600','269000','336300','403500','470800','538000','605300','672500','1345000');
var Cost_24_1093 = new Array('23000','38500','54000','69500','85000','102000','112000','128000','144000','144000','158400','172800','187200','201600','216000','230400','244800','259200','273600','288000','360000','432000','504000','576000','648000','720000','1440000');
var Cost_24_1094 = new Array('24500','41000','57500','74000','90500','108700','119500','136600','153500','153500','168900','184200','199600','214900','230300','245600','261000','276300','291700','307000','383800','460500','537300','614000','690800','767500','1535000');
var Cost_24_1095 = new Array('26000','43500','61000','78500','96000','115200','127000','145200','163000','163000','179300','195600','211900','228200','244500','260800','277100','293400','309700','326000','407500','489000','570500','652000','733500','815000','1630000');
var Cost_24_1096 = new Array('27500','46500','65500','84500','103500','124200','137500','157200','176500','176500','194200','211800','229500','247100','264800','282400','300100','317700','335400','353000','441300','529500','617800','706000','794300','882500','1765000');
var Cost_24_1097 = new Array('29000','49500','70000','90500','111000','133200','148000','169200','190000','190000','209000','228000','247000','266000','285000','304000','323000','342000','361000','380000','475000','570000','665000','760000','855000','950000','1900000');
var Cost_24_1098 = new Array('30500','52500','74500','96500','118500','142200','158500','181200','203500','203500','223900','244300','264600','284900','305300','325600','346000','366300','386700','407000','508800','610500','712300','814000','915800','1017600','2035100');
var Cost_24_1099 = new Array('32000','56000','80000','104000','128000','153600','172000','196600','221000','221000','243200','265200','287300','309400','331500','353600','375700','397800','419900','442000','552500','663000','773500','884000','994600','1105000','2210000');
var Quantity_24_count = 27;
var Quantity_24 = new Array('1000','2000','3000','4000','5000','6000','7000','8000','9000','10000','11000','12000','13000','14000','15000','16000','17000','18000','19000','20000','25000','30000','35000','40000','45000','50000','100000');
var Kind_24_count = 38;
var Kind_24 = new Array('AR-10','AR-11','AR-12','AR-13','AR-14','AR-15','AR-16','AR-17','AR-18','AR-19','AR-20','AR-21','AR-22','AR-25','AR-28','AR-30','AR-33','AR-35','AR-38','AR-40','AR-43','AR-45','AR-48','AR-50','AR-55','AR-60','AR-65','AR-70','AR-75','AR-80','AR-85','AR-90','AR-95','AR-100','AR-105','AR-110','AR-115','AR-200');
var Kind_24_Code = new Array('518','519','520','521','522','523','524','525','526','527','528','529','530','531','532','533','534','535','536','537','538','539','540','541','542','543','544','1089','1090','1091','1092','1093','1094','1095','1096','1097','1098','1099');
var Cost_25_545 = new Array('9500','14500','19500','24500','29500','35400','39000','44600','50200','52500','57800','63000','68300','73500','78800','84000','89300','94500','99800','105000','131300','157500','183800','210000','236300','262500','525000');
var Cost_25_546 = new Array('11000','16500','22000','27500','33000','39600','43000','49200','55300','58000','63800','69600','75400','81200','87000','92800','98600','104400','110200','116000','145000','174000','203000','232000','261000','290000','580000');
var Cost_25_547 = new Array('12500','19500','26500','33500','40500','48600','53500','61200','68800','71500','78700','85800','93000','100100','107300','114400','121600','128700','135900','143000','178800','214500','250300','286000','321800','357500','715000');
var Cost_25_548 = new Array('9500','14500','19500','24500','29500','35400','39000','44600','50200','52500','57800','63000','68300','73500','78800','84000','89300','94500','99800','105000','131300','157500','183800','210000','236300','262500','525000');
var Cost_25_549 = new Array('11000','16500','22000','27500','33000','39600','43000','49200','55300','58000','63800','69600','75400','81200','87000','92800','98600','104400','110200','116000','145000','174000','203000','232000','261000','290000','580000');
var Cost_25_550 = new Array('9500','14500','19500','24500','29500','35400','39000','44600','50200','52500','57800','63000','68300','73500','78800','84000','89300','94500','99800','105000','131300','157500','183800','210000','236300','262500','525000');
var Cost_25_551 = new Array('9500','14500','19500','24500','29500','35400','39000','44600','50200','52500','57800','63000','68300','73500','78800','84000','89300','94500','99800','105000','131300','157500','183800','210000','236300','262500','525000');
var Cost_25_552 = new Array('11300','16800','22300','27800','33300','40000','43300','49500','55700','58300','64200','70000','75800','81700','87500','93300','99200','105000','110800','116600','145800','174900','204100','233200','262400','291500','583000');
var Cost_25_553 = new Array('12500','19500','26500','33500','40500','48600','53500','61200','68800','71500','78700','85800','93000','100100','107300','114400','121600','128700','135900','143000','178800','214500','250300','286000','321800','357500','715000');
var Cost_25_554 = new Array('12500','19500','26500','33500','40500','48600','53500','61200','68800','71500','78700','85800','93000','100100','107300','114400','121600','128700','135900','143000','178800','214500','250300','286000','321800','357500','715000');
var Cost_25_555 = new Array('9500','14500','19500','24500','29500','35400','39000','44600','50200','52500','57800','63000','68300','73500','78800','84000','89300','94500','99800','105000','131300','157500','183800','210000','236300','262500','525000');
var Cost_25_556 = new Array('12500','19500','26500','33500','40500','48600','53500','61200','68800','71500','78700','85800','93000','100100','107300','114400','121600','128700','135900','143000','178800','214500','250300','286000','321800','357500','715000');
var Cost_25_992 = new Array('12000','24000','36000','48000','60000','72000','78000','89200','100300','101000','111100','121200','131300','141400','151500','161600','171700','181800','191900','202000','252500','303000','353500','404000','454500','505000','1010000');
var Cost_25_993 = new Array('14000','26500','39000','51500','64000','76800','83000','94900','106800','108000','118900','129700','140400','151200','162000','172800','183600','194400','205200','216000','270000','324000','378000','432000','486100','540000','1080000');
var Cost_25_994 = new Array('15000','27500','40000','52500','65000','78000','84000','96000','108000','109000','119900','130800','141700','152600','163500','174400','185300','196200','207100','218000','272500','327000','381500','436000','490500','545000','1090000');
var Cost_25_995 = new Array('16000','29000','42000','55000','68000','81600','88000','100600','113200','114000','125400','136800','148200','159600','171000','182400','193800','205200','216600','228000','285000','342000','399000','456000','513000','570000','1140000');
var Cost_25_996 = new Array('18000','31500','45000','58500','72000','86400','93000','106300','119600','121000','133100','145200','157300','169400','181500','193600','205700','217800','229900','242000','302500','363000','423500','484000','544500','605000','1210000');
var Cost_25_997 = new Array('20000','34000','48000','62000','76000','91200','98000','112000','126000','128000','140800','153600','166400','179200','192000','204800','217600','230400','243200','256000','320000','384000','448000','512000','576000','640000','1280000');
var Cost_25_998 = new Array('22000','36500','51000','65500','80000','96000','105000','120000','135000','140000','154000','168000','182000','196000','210000','224000','238000','252000','266000','280000','350000','420000','490000','560000','630000','700000','1400000');
var Cost_25_999 = new Array('24000','39000','54000','69000','84000','100800','112000','128000','144000','152000','167200','182400','197600','212800','228000','243200','258400','273600','288800','304000','380000','456000','532000','608000','684000','760000','1520000');
var Cost_25_1100 = new Array('12000','24000','36000','48000','60000','72000','78000','89200','100300','101000','111100','121200','131300','141400','151500','161600','171700','181800','191900','202000','252500','303000','353500','404000','454500','505000','1010000');
var Cost_25_1101 = new Array('14000','26500','39000','51500','64000','76800','83000','94900','106800','108000','118900','129700','140400','151200','162000','172800','183600','194400','205200','216000','270000','324000','378000','432000','486100','540000','1080000');
var Cost_25_1102 = new Array('15000','27500','40000','52500','65000','78000','84000','96000','108000','109000','119900','130800','141700','152600','163500','174400','185300','196200','207100','218000','272500','327000','381500','436000','490500','545000','1090000');
var Cost_25_1103 = new Array('16000','29000','42000','55000','68000','81600','88000','100600','113200','114000','125400','136800','148200','159600','171000','182400','193800','205200','216600','228000','285000','342000','399000','456000','513000','570000','1140000');
var Cost_25_1104 = new Array('18000','31500','45000','58500','72000','86400','93000','106300','119600','121000','133100','145200','157300','169400','181500','193600','205700','217800','229900','242000','302500','363000','423500','484000','544500','605000','1210000');
var Cost_25_1105 = new Array('20000','34000','48000','62000','76000','91200','98000','112000','126000','128000','140800','153600','166400','179200','192000','204800','217600','230400','243200','256000','320000','384000','448000','512000','576000','640000','1280000');
var Cost_25_1106 = new Array('22000','36500','51000','65500','80000','96000','105000','120000','135000','140000','154000','168000','182000','196000','210000','224000','238000','252000','266000','280000','350000','420000','490000','560000','630000','700000','1400000');
var Cost_25_1107 = new Array('24000','39000','54000','69000','84000','100800','112000','128000','144000','152000','167200','182400','197600','212800','228000','243200','258400','273600','288800','304000','380000','456000','532000','608000','684000','760000','1520000');
var Quantity_25_count = 27;
var Quantity_25 = new Array('1000','2000','3000','4000','5000','6000','7000','8000','9000','10000','11000','12000','13000','14000','15000','16000','17000','18000','19000','20000','25000','30000','35000','40000','45000','50000','100000');
var Kind_25_count = 28;
var Kind_25 = new Array('ARR-5017','ARR-5020','ARR-5030','ARR-4220','ARR-4223','ARR-5515','ARR-5517','ARR-5520','ARR-5524','ARR-5533','ARR-3525','ARR-4030','ARR-090040','ARR-090050','ARR-090055','ARR-090060','ARR-090070','ARR-090080','ARR-090090','ARR-090100','ARR-9040','ARR-9050','ARR-9055','ARR-9060','ARR-9070','ARR-9080','ARR-9090','ARR-90100');
var Kind_25_Code = new Array('545','546','547','548','549','550','551','552','553','554','555','556','992','993','994','995','996','997','998','999','1100','1101','1102','1103','1104','1105','1106','1107');
var Cost_26_557 = new Array('11000','16500','22000','27500','33000','39600','43000','49200','55300','58000','63800','69600','75400','81200','87000','92800','98600','104400','110200','116000','145000','174000','203000','232000','261000','290000','580000');
var Cost_26_558 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_26_559 = new Array('12500','19500','26500','33500','40500','48600','53500','61200','68800','71500','78700','85800','93000','100100','107300','114400','121600','128700','135900','143000','178800','214500','250300','286000','321800','357500','715000');
var Cost_26_560 = new Array('14000','23000','32000','41000','50000','60000','66000','75500','84900','87000','95700','104400','113100','121800','130500','139200','147900','156600','165300','174000','217500','261000','304500','348000','391500','435000','870000');
var Cost_26_561 = new Array('11000','16500','22000','27500','33000','39600','43000','49200','55300','58000','63800','69600','75400','81200','87000','92800','98600','104400','110200','116000','145000','174000','203000','232000','261000','290000','580000');
var Cost_26_562 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_26_563 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_26_564 = new Array('12500','19500','26500','33500','40500','48600','53500','61200','68800','71500','78700','85800','93000','100100','107300','114400','121600','128700','135900','143000','178800','214500','250300','286000','321800','357500','715000');
var Cost_26_565 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_26_566 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_26_567 = new Array('12000','19500','26500','33500','40500','48600','53500','61200','68800','71500','78700','85800','93000','100100','107300','114400','121600','128700','135900','143000','178800','214500','250300','286000','321800','357500','715000');
var Cost_26_568 = new Array('12500','21000','30000','39000','48000','57600','64000','73200','82300','85000','93500','102000','110500','119000','127500','136000','144500','153000','161500','170000','212500','255000','297500','340000','382500','425000','850000');
var Cost_26_569 = new Array('14000','23000','32000','41000','50000','60000','66000','75500','84900','87000','95700','104400','113100','121800','130500','139200','147900','156600','165300','174000','217500','261000','304500','348000','391500','435000','870000');
var Cost_26_570 = new Array('11000','16500','22000','27500','33000','39600','43000','49200','55300','58000','63800','69600','75400','81200','87000','92800','98600','104400','110200','116000','145000','174000','203000','232000','261000','290000','580000');
var Cost_26_571 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_26_572 = new Array('11000','16500','22000','27500','33000','39600','43000','49200','55300','58000','63800','69600','75400','81200','87000','92800','98600','104400','110200','116000','145000','174000','203000','232000','261000','290000','580000');
var Cost_26_573 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_26_574 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_26_575 = new Array('12500','19500','26500','33500','40500','48600','53500','61200','68800','71500','78700','85800','93000','100100','107300','114400','121600','128700','135900','143000','178800','214500','250300','286000','321800','357500','715000');
var Cost_26_576 = new Array('14000','23000','32000','41000','50000','60000','66000','75500','84900','87000','95700','104400','113100','121800','130500','139200','147900','156600','165300','174000','217500','261000','304500','348000','391500','435000','870000');
var Cost_26_577 = new Array('9500','14500','19500','24500','29500','35400','39000','44600','50200','52500','57800','63000','68300','73500','78800','84000','89300','94500','99800','105000','131300','157500','183800','210000','236300','262500','525000');
var Cost_26_578 = new Array('10000','15000','20000','25000','30000','36000','39500','45200','50800','53000','58300','63600','68900','74200','79500','84800','90100','95400','100700','106000','132500','159000','185500','212000','238500','265000','530000');
var Cost_26_579 = new Array('10500','16800','22300','27800','33300','40000','43300','49500','55700','58300','64200','70000','75800','81700','87500','93300','99200','105000','110800','116600','145800','174900','204100','233200','262400','291500','583000');
var Cost_26_580 = new Array('11000','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_26_581 = new Array('11500','19500','26500','33500','40500','48600','53500','61200','68800','71500','78700','85800','93000','100100','107300','114400','121600','128700','135900','143000','178800','214500','250300','286000','321800','357500','715000');
var Cost_26_582 = new Array('12000','23000','32000','41000','50000','60000','66000','75500','84900','87000','95700','104400','113100','121800','130500','139200','147900','156600','165300','174000','217500','261000','304500','348000','391500','435000','870000');
var Cost_26_583 = new Array('13500','25000','39500','51500','61500','66500','77000','88000','98000','105000','124900','136200','147600','158900','170300','181600','193000','204300','215700','227000','283800','340500','397300','454000','510800','567500','1135000');
var Cost_26_1000 = new Array('15500','29000','41000','53000','65000','78000','85000','97200','109300','110000','121000','132000','143000','154000','165000','176000','187000','198000','209000','220000','275000','330000','385000','440000','495000','550000','1100000');
var Cost_26_1001 = new Array('16500','31000','43500','56000','68500','82200','89500','102300','115100','115500','127100','138600','150200','161700','173300','184800','196400','207900','219500','231000','288800','346500','404300','462000','519800','577500','1155000');
var Cost_26_1002 = new Array('18000','33500','47000','60500','74000','88800','97000','110900','124800','125000','137500','150000','162500','175000','187500','200000','212500','225000','237500','250000','312500','375000','437500','500000','562500','625000','1250000');
var Cost_26_1003 = new Array('19500','36000','50500','65000','79500','95400','104500','119500','134400','134500','148000','161400','174900','188300','201800','215200','228700','242100','255600','269000','336300','403500','470800','538000','605300','672500','1345000');
var Cost_26_1004 = new Array('21000','38500','54000','69500','85000','102000','112000','128000','144000','144000','158400','172800','187200','201600','216000','230400','244800','259200','273600','288000','360000','432000','504000','576000','648000','720000','1440000');
var Cost_26_1005 = new Array('22500','41000','57500','74000','90500','108700','119500','136600','153500','153500','168900','184200','199600','214900','230300','245600','261000','276300','291700','307000','383800','460500','537300','614000','690800','767500','1535000');
var Cost_26_1006 = new Array('24500','43500','61000','78500','96000','115200','127000','145200','163000','163000','179300','195600','211900','228200','244500','260800','277100','293400','309700','326000','407500','489000','570500','652000','733500','815000','1630000');
var Cost_26_1007 = new Array('26000','46500','65500','84500','103500','124200','137500','157200','176500','176500','194200','211800','229500','247100','264800','282400','300100','317700','335400','353000','441300','529500','617800','706000','794300','882500','1765000');
var Cost_26_1008 = new Array('28000','49500','70000','90500','111000','133200','148000','169200','190000','190000','209000','228000','247000','266000','285000','304000','323000','342000','361000','380000','475000','570000','665000','760000','855000','950000','1900000');
var Cost_26_1009 = new Array('30500','52500','74500','96500','118500','142200','158500','181200','203500','203500','223900','244300','264600','284900','305300','325600','346000','366300','386700','407000','508800','610500','712300','814000','915800','1017600','2035100');
var Cost_26_1010 = new Array('32000','56000','80000','104000','128000','153600','172000','196600','221000','221000','243200','265200','287300','309400','331500','353600','375700','397800','419900','442000','552500','663000','773500','884000','994600','1105000','2210000');
var Quantity_26_count = 27;
var Quantity_26 = new Array('1000','2000','3000','4000','5000','6000','7000','8000','9000','10000','11000','12000','13000','14000','15000','16000','17000','18000','19000','20000','25000','30000','35000','40000','45000','50000','100000');
var Kind_26_count = 38;
var Kind_26 = new Array('AC-10','AC-11','AC-12','AC-13','AC-14','AC-15','AC-16','AC-17','AC-18','AC-19','AC-20','AC-21','AC-22','AC-25','AC-28','AC-30','AC-33','AC-35','AC-38','AC-40','AC-43','AC-45','AC-48','AC-50','AC-55','AC-60','AC-65','AC-70','AC-75','AC-80','AC-85','AC-90','AC-95','AC-100','AC-105','AC-110','AC-115','AC-120');
var Kind_26_Code = new Array('557','558','559','560','561','562','563','564','565','566','567','568','569','570','571','572','573','574','575','576','577','578','579','580','581','582','583','1000','1001','1002','1003','1004','1005','1006','1007','1008','1009','1010');
var Cost_27_584 = new Array('9500','14500','19500','24500','29500','35400','39000','44600','50200','52500','57800','63000','68300','73500','78800','84000','89300','94500','99800','105000','131300','157500','183800','210000','236300','262500','525000');
var Cost_27_585 = new Array('11000','16500','22000','27500','33000','39600','43000','49200','55300','58000','63800','69600','75400','81200','87000','92800','98600','104400','110200','116000','145000','174000','203000','232000','261000','290000','580000');
var Cost_27_586 = new Array('12500','21000','30000','39000','48000','57600','64000','73200','82300','85000','93500','102000','110500','119000','127500','136000','144500','153000','161500','170000','212500','255000','297500','340000','382500','425000','850000');
var Cost_27_587 = new Array('12000','19500','26500','33500','40500','48600','53500','61200','68800','71500','78700','85800','93000','100100','107300','114400','121600','128700','135900','143000','178800','214500','250300','286000','321800','357500','715000');
var Cost_27_588 = new Array('14000','23000','32000','41000','50000','60000','66000','75500','84900','87000','95700','104400','113100','121800','130500','139200','147900','156600','165300','174000','217500','261000','304500','348000','391500','435000','870000');
var Cost_27_589 = new Array('12500','21000','30000','39000','48000','57600','64000','73200','82300','85000','93500','102000','110500','119000','127500','136000','144500','153000','161500','170000','212500','255000','297500','340000','382500','425000','850000');
var Cost_27_590 = new Array('14000','23000','32000','41000','50000','60000','66000','75500','84900','87000','95700','104400','113100','121800','130500','139200','147900','156600','165300','174000','217500','261000','304500','348000','391500','435000','870000');
var Quantity_27_count = 27;
var Quantity_27 = new Array('1000','2000','3000','4000','5000','6000','7000','8000','9000','10000','11000','12000','13000','14000','15000','16000','17000','18000','19000','20000','25000','30000','35000','40000','45000','50000','100000');
var Kind_27_count = 7;
var Kind_27 = new Array('AE-5020','AE-5025','AE-5030','AE-5525','AE-5530','AE-6025','AE-6030');
var Kind_27_Code = new Array('584','585','586','587','588','589','590');
var Cost_28_591 = new Array('11000','16500','22000','27500','33000','39600','43000','49200','55300','58000','63800','69600','75400','81200','87000','92800','98600','104400','110200','116000','145000','174000','203000','232000','261000','290000','580000');
var Cost_28_592 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_28_593 = new Array('12500','19500','26500','33500','40500','48600','53500','61200','68800','71500','78700','85800','93000','100100','107300','114400','121600','128700','135900','143000','178800','214500','250300','286000','321800','357500','715000');
var Cost_28_594 = new Array('14000','23000','32000','41000','50000','60000','66000','75500','84900','87000','95700','104400','113100','121800','130500','139200','147900','156600','165300','174000','217500','261000','304500','348000','391500','435000','870000');
var Cost_28_595 = new Array('11000','16500','22000','27500','33000','39600','43000','49200','55300','58000','63800','69600','75400','81200','87000','92800','98600','104400','110200','116000','145000','174000','203000','232000','261000','290000','580000');
var Cost_28_596 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_28_597 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_28_598 = new Array('12500','19500','26500','33500','40500','48600','53500','61200','68800','71500','78700','85800','93000','100100','107300','114400','121600','128700','135900','143000','178800','214500','250300','286000','321800','357500','715000');
var Cost_28_599 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_28_600 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_28_601 = new Array('12000','19500','26500','33500','40500','48600','53500','61200','68800','71500','78700','85800','93000','100100','107300','114400','121600','128700','135900','143000','178800','214500','250300','286000','321800','357500','715000');
var Cost_28_602 = new Array('12500','21000','30000','39000','48000','57600','64000','73200','82300','85000','93500','102000','110500','119000','127500','136000','144500','153000','161500','170000','212500','255000','297500','340000','382500','425000','850000');
var Cost_28_603 = new Array('14000','23000','32000','41000','50000','60000','66000','75500','84900','87000','95700','104400','113100','121800','130500','139200','147900','156600','165300','174000','217500','261000','304500','348000','391500','435000','870000');
var Cost_28_604 = new Array('11000','16500','22000','27500','33000','39600','43000','49200','55300','58000','63800','69600','75400','81200','87000','92800','98600','104400','110200','116000','145000','174000','203000','232000','261000','290000','580000');
var Cost_28_605 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_28_606 = new Array('11000','16500','22000','27500','33000','39600','43000','49200','55300','58000','63800','69600','75400','81200','87000','92800','98600','104400','110200','116000','145000','174000','203000','232000','261000','290000','580000');
var Cost_28_607 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_28_608 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_28_609 = new Array('12500','19500','26500','33500','40500','48600','53500','61200','68800','71500','78700','85800','93000','100100','107300','114400','121600','128700','135900','143000','178800','214500','250300','286000','321800','357500','715000');
var Cost_28_610 = new Array('14000','23000','32000','41000','50000','60000','66000','75500','84900','87000','95700','104400','113100','121800','130500','139200','147900','156600','165300','174000','217500','261000','304500','348000','391500','435000','870000');
var Cost_28_611 = new Array('9500','14500','19500','24500','29500','35400','39000','44600','50200','52500','57800','63000','68300','73500','78800','84000','89300','94500','99800','105000','131300','157500','183800','210000','236300','262500','525000');
var Cost_28_612 = new Array('10000','15000','20000','25000','30000','36000','39500','45200','50800','53000','58300','63600','68900','74200','79500','84800','90100','95400','100700','106000','132500','159000','185500','212000','238500','265000','530000');
var Cost_28_613 = new Array('10500','16800','22300','27800','33300','40000','43300','49500','55700','58300','64200','70000','75800','81700','87500','93300','99200','105000','110800','116600','145800','174900','204100','233200','262400','291500','583000');
var Cost_28_614 = new Array('11000','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_28_615 = new Array('11500','19500','26500','33500','40500','48600','53500','61200','68800','71500','78700','85800','93000','100100','107300','114400','121600','128700','135900','143000','178800','214500','250300','286000','321800','357500','715000');
var Cost_28_616 = new Array('12000','23000','32000','41000','50000','60000','66000','75500','84900','87000','95700','104400','113100','121800','130500','139200','147900','156600','165300','174000','217500','261000','304500','348000','391500','435000','870000');
var Cost_28_617 = new Array('13500','25000','39500','51500','61500','66500','77000','88000','98000','105000','124900','136200','147600','158900','170300','181600','193000','204300','215700','227000','283800','340500','397300','454000','510800','567500','1135000');
var Quantity_28_count = 27;
var Quantity_28 = new Array('1000','2000','3000','4000','5000','6000','7000','8000','9000','10000','11000','12000','13000','14000','15000','16000','17000','18000','19000','20000','25000','30000','35000','40000','45000','50000','100000');
var Kind_28_count = 27;
var Kind_28 = new Array('AS-10','AS-11','AS-12','AS-13','AS-14','AS-15','AS-16','AS-17','AS-18','AS-19','AS-20','AS-21','AS-22','AS-25','AS-28','AS-30','AS-33','AS-35','AS-38','AS-40','AS-43','AS-45','AS-48','AS-50','AS-55','AS-60','AS-65');
var Kind_28_Code = new Array('591','592','593','594','595','596','597','598','599','600','601','602','603','604','605','606','607','608','609','610','611','612','613','614','615','616','617');
var Cost_29_618 = new Array('11000','16500','22000','27500','33000','39600','43000','49200','55300','58000','63800','69600','75400','81200','87000','92800','98600','104400','110200','116000','145000','174000','203000','232000','261000','290000','580000');
var Cost_29_619 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_29_620 = new Array('12500','19500','26500','33500','40500','48600','53500','61200','68800','71500','78700','85800','93000','100100','107300','114400','121600','128700','135900','143000','178800','214500','250300','286000','321800','357500','715000');
var Cost_29_621 = new Array('14000','23000','32000','41000','50000','60000','66000','75500','84900','87000','95700','104400','113100','121800','130500','139200','147900','156600','165300','174000','217500','261000','304500','348000','391500','435000','870000');
var Cost_29_622 = new Array('11000','16500','22000','27500','33000','39600','43000','49200','55300','58000','63800','69600','75400','81200','87000','92800','98600','104400','110200','116000','145000','174000','203000','232000','261000','290000','580000');
var Cost_29_623 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_29_624 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_29_625 = new Array('12500','19500','26500','33500','40500','48600','53500','61200','68800','71500','78700','85800','93000','100100','107300','114400','121600','128700','135900','143000','178800','214500','250300','286000','321800','357500','715000');
var Cost_29_626 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_29_627 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_29_628 = new Array('12000','19500','26500','33500','40500','48600','53500','61200','68800','71500','78700','85800','93000','100100','107300','114400','121600','128700','135900','143000','178800','214500','250300','286000','321800','357500','715000');
var Cost_29_629 = new Array('12500','21000','30000','39000','48000','57600','64000','73200','82300','85000','93500','102000','110500','119000','127500','136000','144500','153000','161500','170000','212500','255000','297500','340000','382500','425000','850000');
var Cost_29_630 = new Array('14000','23000','32000','41000','50000','60000','66000','75500','84900','87000','95700','104400','113100','121800','130500','139200','147900','156600','165300','174000','217500','261000','304500','348000','391500','435000','870000');
var Cost_29_631 = new Array('11000','16500','22000','27500','33000','39600','43000','49200','55300','58000','63800','69600','75400','81200','87000','92800','98600','104400','110200','116000','145000','174000','203000','232000','261000','290000','580000');
var Cost_29_632 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_29_633 = new Array('11000','16500','22000','27500','33000','39600','43000','49200','55300','58000','63800','69600','75400','81200','87000','92800','98600','104400','110200','116000','145000','174000','203000','232000','261000','290000','580000');
var Cost_29_634 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_29_635 = new Array('11500','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_29_636 = new Array('12500','19500','26500','33500','40500','48600','53500','61200','68800','71500','78700','85800','93000','100100','107300','114400','121600','128700','135900','143000','178800','214500','250300','286000','321800','357500','715000');
var Cost_29_637 = new Array('14000','23000','32000','41000','50000','60000','66000','75500','84900','87000','95700','104400','113100','121800','130500','139200','147900','156600','165300','174000','217500','261000','304500','348000','391500','435000','870000');
var Cost_29_638 = new Array('9500','14500','19500','24500','29500','35400','39000','44600','50200','52500','57800','63000','68300','73500','78800','84000','89300','94500','99800','105000','131300','157500','183800','210000','236300','262500','525000');
var Cost_29_639 = new Array('10000','15000','20000','25000','30000','36000','39500','45200','50800','53000','58300','63600','68900','74200','79500','84800','90100','95400','100700','106000','132500','159000','185500','212000','238500','265000','530000');
var Cost_29_640 = new Array('10500','16800','22300','27800','33300','40000','43300','49500','55700','58300','64200','70000','75800','81700','87500','93300','99200','105000','110800','116600','145800','174900','204100','233200','262400','291500','583000');
var Cost_29_641 = new Array('11000','17500','23500','29500','35500','42600','46500','53200','59800','62500','68800','75000','81300','87500','93800','100000','106300','112500','118800','125000','156300','187500','218800','250000','281300','312500','625000');
var Cost_29_642 = new Array('11500','19500','26500','33500','40500','48600','53500','61200','68800','71500','78700','85800','93000','100100','107300','114400','121600','128700','135900','143000','178800','214500','250300','286000','321800','357500','715000');
var Cost_29_643 = new Array('12000','23000','32000','41000','50000','60000','66000','75500','84900','87000','95700','104400','113100','121800','130500','139200','147900','156600','165300','174000','217500','261000','304500','348000','391500','435000','870000');
var Cost_29_644 = new Array('13500','25000','39500','51500','61500','66500','77000','88000','98000','105000','124900','136200','147600','158900','170300','181600','193000','204300','215700','227000','283800','340500','397300','454000','510800','567500','1135000');
var Quantity_29_count = 27;
var Quantity_29 = new Array('1000','2000','3000','4000','5000','6000','7000','8000','9000','10000','11000','12000','13000','14000','15000','16000','17000','18000','19000','20000','25000','30000','35000','40000','45000','50000','100000');
var Kind_29_count = 27;
var Kind_29 = new Array('AH-10','AH-11','AH-12','AH-13','AH-14','AH-15','AH-16','AH-17','AH-18','AH-19','AH-20','AH-21','AH-22','AH-25','AH-28','AH-30','AH-33','AH-35','AH-38','AH-40','AH-43','AH-45','AH-48','AH-50','AH-55','AH-60','AH-65');
var Kind_29_Code = new Array('618','619','620','621','622','623','624','625','626','627','628','629','630','631','632','633','634','635','636','637','638','639','640','641','642','643','644');
var Cost_30_645 = new Array('29000','53000','80000','105000','125000','133000','153000','174000','195000','202000');
var Cost_30_646 = new Array('30000','55000','81000','106000','126000','134000','155000','174000','195000','203000');
var Cost_30_647 = new Array('17000','32000','46000','61000','73000','86000','96000','107000','118000','122000');
var Quantity_30_count = 10;
var Quantity_30 = new Array('1000','2000','3000','4000','5000','6000','7000','8000','9000','10000');
var Kind_30_count = 3;
var Kind_30 = new Array('비디오1','비디오2','비디오3');
var Kind_30_Code = new Array('645','646','647');
var Cost_31_648 = new Array('18000','34000','51000');
var Cost_31_649 = new Array('20000','38000','56000');
var Quantity_31_count = 3;
var Quantity_31 = new Array('1000','2000','3000');
var Kind_31_count = 2;
var Kind_31 = new Array('Akey-5423','Akey-6527');
var Kind_31_Code = new Array('648','649');
var Cost_32_650 = new Array('30000','57000','86000','114000','128000','136000','159000','181000','204000','211000');
var Cost_32_651 = new Array('37000','71000','107000','143000','170000','204000','238000','272000','306000','340000');
var Quantity_32_count = 10;
var Quantity_32 = new Array('1000','2000','3000','4000','5000','6000','7000','8000','9000','10000');
var Kind_32_count = 2;
var Kind_32 = new Array('카세트테이프','CD');
var Kind_32_Code = new Array('650','651');
var Cost_33_652 = new Array('46000','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200');
var Cost_33_653 = new Array('57000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000');
var Cost_33_654 = new Array('46000','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200');
var Cost_33_655 = new Array('57000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000');
var Cost_33_656 = new Array('46000','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200');
var Cost_33_657 = new Array('57000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000');
var Cost_33_658 = new Array('0','71000','47200','61666.66667','47000','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200');
var Cost_33_659 = new Array('0','111000','58000','76666.66667','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000');
var Cost_33_660 = new Array('31000','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900');
var Cost_33_661 = new Array('41000','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800');
var Cost_33_662 = new Array('31000','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900');
var Cost_33_663 = new Array('41000','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800');
var Cost_33_664 = new Array('31000','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900');
var Cost_33_665 = new Array('41000','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800');
var Cost_33_666 = new Array('0','62000','32900','42000','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900');
var Cost_33_667 = new Array('0','84000','42800','56000','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800');
var Cost_33_668 = new Array('0','0','0','0','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200','47200');
var Cost_33_669 = new Array('0','0','0','0','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000','58000');
var Cost_33_670 = new Array('0','0','0','0','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900','32900');
var Cost_33_671 = new Array('0','0','0','0','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800','42800');
var Quantity_33_count = 36;
var Quantity_33 = new Array('0.5','1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20','21','22','23','24','25','26','27','28','29','30','35','40','45','50','100');
var Kind_33_count = 20;
var Kind_33 = new Array('64절단면4도','64절양면8도','32절단면4도','32절양면8도','16절단면4도','16절양면8도','8절단면4도','8절양면8도','A6단면4도','A6양면8도','A5단면4도','A5양면8도','A4단면4도','A4양면8도','A3단면4도','A3양면8도','4절단면4도','4절양면8도','A2단면4도','A2양면8도');
var Kind_33_Code = new Array('652','653','654','655','656','657','658','659','660','661','662','663','664','665','666','667','668','669','670','671');
var Cost_34_672 = new Array('0','137000','248000','0','0');
var Cost_34_673 = new Array('0','170000','294000','0','0');
var Cost_34_674 = new Array('0','121000','220000','0','0');
var Cost_34_675 = new Array('0','143000','261000','0','0');
var Quantity_34_count = 5;
var Quantity_34 = new Array('0.5','1','2','3','4');
var Kind_34_count = 4;
var Kind_34 = new Array('16절단면4도','16절양면8도','A4단면4도','A4양면8도');
var Kind_34_Code = new Array('672','673','674','675');
var Cost_35_676 = new Array('70000','70000','69500','68000','67500');
var Cost_35_677 = new Array('100000','100000','96000','92666.66667','89500');
var Cost_35_678 = new Array('70000','70000','69500','68000','67500');
var Cost_35_679 = new Array('100000','100000','96000','92666.66667','89500');
var Cost_35_680 = new Array('134000','134000','69500','94000','67500');
var Cost_35_681 = new Array('156000','156000','96000','112000','89500');
var Cost_35_682 = new Array('59000','59000','58500','56666.66667','55750');
var Cost_35_683 = new Array('85000','85000','81000','76666.66667','75000');
var Cost_35_684 = new Array('59000','59000','58500','56666.66667','55750');
var Cost_35_685 = new Array('85000','85000','81000','76666.66667','75000');
var Cost_35_686 = new Array('112000','112000','58500','78000','55750');
var Cost_35_687 = new Array('138000','138000','81000','96000','75000');
var Quantity_35_count = 5;
var Quantity_35 = new Array('0.5','1','2','3','4');
var Kind_35_count = 12;
var Kind_35 = new Array('32절단면4도','32절양면8도','16절단면4도','16절양면8도','8절단면4도','8절양면8도','A5단면4도','A5양면8도','A4단면4도','A4양면8도','A3단면4도','A3양면8도');
var Kind_35_Code = new Array('676','677','678','679','680','681','682','683','684','685','686','687');
var Cost_36_688 = new Array('118000','218000','315000','412000');
var Cost_36_689 = new Array('152000','268000','393000','520000');
var Cost_36_690 = new Array('118000','218000','315000','412000');
var Cost_36_691 = new Array('152000','268000','393000','520000');
var Cost_36_692 = new Array('0','218000','0','412000');
var Cost_36_693 = new Array('0','268000','0','520000');
var Cost_36_694 = new Array('95000','175000','252000','318000');
var Cost_36_695 = new Array('118000','197000','288000','379000');
var Cost_36_696 = new Array('95000','175000','252000','318000');
var Cost_36_697 = new Array('118000','197000','288000','379000');
var Cost_36_698 = new Array('0','175000','0','318000');
var Cost_36_699 = new Array('0','197000','0','379000');
var Quantity_36_count = 4;
var Quantity_36 = new Array('1','2','3','4');
var Kind_36_count = 12;
var Kind_36 = new Array('32절단면4도','32절양면8도','16절단면4도','16절양면8도','8절단면4도','8절양면8도','A5단면4도','A5양면8도','A4단면4도','A4양면8도','A3단면4도','A3양면8도');
var Kind_36_Code = new Array('688','689','690','691','692','693','694','695','696','697','698','699');
var Cost_37_700 = new Array('230000','460000','690000','880000');
var Cost_37_701 = new Array('230000','460000','690000','880000');
var Cost_37_702 = new Array('230000','460000','690000','880000');
var Cost_37_703 = new Array('250000','500000','750000','960000');
var Quantity_37_count = 4;
var Quantity_37 = new Array('1','2','3','4');
var Kind_37_count = 4;
var Kind_37 = new Array('64절양면8도','32절양면8도','16절양면8도','8절양면8도');
var Kind_37_Code = new Array('700','701','702','703');
var Cost_38_704 = new Array('98000','138000','123000','118000','109000','107000','106000','105000','103000','102000','100000','98000','96000','96000','95000','93000','92000');
var Cost_38_705 = new Array('137000','195000','164000','155000','136000','127000','126000','125000','120000','119000','115000','114000','109000','109000','108000','104000','103000');
var Cost_38_706 = new Array('98000','138000','123000','118000','109000','107000','106000','105000','103000','102000','100000','98000','96000','96000','95000','93000','92000');
var Cost_38_707 = new Array('137000','195000','164000','155000','136000','127000','126000','125000','120000','119000','115000','114000','109000','109000','108000','104000','103000');
var Cost_38_708 = new Array('98000','138000','123000','118000','109000','107000','106000','105000','103000','102000','100000','98000','96000','96000','95000','93000','92000');
var Cost_38_709 = new Array('137000','195000','164000','155000','136000','127000','126000','125000','120000','119000','115000','114000','109000','109000','108000','104000','103000');
var Cost_38_710 = new Array('98000','138000','123000','118000','109000','107000','106000','105000','103000','102000','100000','98000','96000','96000','95000','93000','92000');
var Cost_38_711 = new Array('137000','195000','164000','155000','136000','127000','126000','125000','120000','119000','115000','114000','109000','109000','108000','104000','103000');
var Cost_38_712 = new Array('98000','138000','123000','118000','109000','107000','106000','105000','103000','102000','100000','98000','96000','96000','95000','93000','92000');
var Cost_38_713 = new Array('137000','195000','164000','155000','136000','127000','126000','125000','120000','119000','115000','114000','109000','109000','108000','104000','103000');
var Cost_38_714 = new Array('98000','138000','123000','118000','109000','107000','106000','105000','103000','102000','100000','98000','96000','96000','95000','93000','92000');
var Cost_38_715 = new Array('137000','195000','164000','155000','136000','127000','126000','125000','120000','119000','115000','114000','109000','109000','108000','104000','103000');
var Cost_38_716 = new Array('86000','114000','96000','92000','81000','79000','78000','77000','75000','74000','72000','71000','70000','69000','68000','67000','66000');
var Cost_38_717 = new Array('116000','162000','131000','123000','103000','100000','99000','98000','95000','92000','87000','85000','83000','81000','80000','77000','75000');
var Cost_38_718 = new Array('86000','114000','96000','92000','81000','79000','78000','77000','75000','74000','72000','71000','70000','69000','68000','67000','66000');
var Cost_38_719 = new Array('116000','162000','131000','123000','103000','100000','99000','98000','95000','92000','87000','85000','83000','81000','80000','77000','75000');
var Cost_38_720 = new Array('86000','114000','96000','92000','81000','79000','78000','77000','75000','74000','72000','71000','70000','69000','68000','67000','66000');
var Cost_38_721 = new Array('116000','162000','131000','123000','103000','100000','99000','98000','95000','92000','87000','85000','83000','81000','80000','77000','75000');
var Cost_38_722 = new Array('86000','114000','96000','92000','81000','79000','78000','77000','75000','74000','72000','71000','70000','69000','68000','67000','66000');
var Cost_38_723 = new Array('116000','162000','131000','123000','103000','100000','99000','98000','95000','92000','87000','85000','83000','81000','80000','77000','75000');
var Cost_38_724 = new Array('86000','114000','96000','92000','81000','79000','78000','77000','75000','74000','72000','71000','70000','69000','68000','67000','66000');
var Cost_38_725 = new Array('116000','162000','131000','123000','103000','100000','99000','98000','95000','92000','87000','85000','83000','81000','80000','77000','75000');
var Cost_38_726 = new Array('86000','114000','96000','92000','81000','79000','78000','77000','75000','74000','72000','71000','70000','69000','68000','67000','66000');
var Cost_38_727 = new Array('116000','162000','131000','123000','103000','100000','99000','98000','95000','92000','87000','85000','83000','81000','80000','77000','75000');
var Quantity_38_count = 17;
var Quantity_38 = new Array('0.5','1','2','3','4','5','6','7','8','9','10','15','20','25','30','40','50');
var Kind_38_count = 24;
var Kind_38 = new Array('64절단면4도','64절양면8도','32절단면4도','32절양면8도','16절단면4도','16절양면8도','8절단면4도','8절양면8도','4절단면4도','4절양면8도','2절단면4도','2절양면8도','A6단면4도','A6양면8도','A5단면4도','A5양면8도','A4단면4도','A4양면8도','A3단면4도','A3양면8도','A2단면4도','A2양면8도','국전지단면4도','국전지양면8도');
var Kind_38_Code = new Array('704','705','706','707','708','709','710','711','712','713','714','715','716','717','718','719','720','721','722','723','724','725','726','727');
var Cost_39_728 = new Array('98000','138000','123000','118000','109000','107000','106000','105000','103000','102000','100000','98000','96000','96000','95000','93000','92000');
var Cost_39_729 = new Array('137000','195000','164000','155000','136000','127000','126000','125000','120000','119000','115000','114000','109000','109000','108000','104000','103000');
var Cost_39_730 = new Array('98000','138000','123000','118000','109000','107000','106000','105000','103000','102000','100000','98000','96000','96000','95000','93000','92000');
var Cost_39_731 = new Array('137000','195000','164000','155000','136000','127000','126000','125000','120000','119000','115000','114000','109000','109000','108000','104000','103000');
var Cost_39_732 = new Array('98000','138000','123000','118000','109000','107000','106000','105000','103000','102000','100000','98000','96000','96000','95000','93000','92000');
var Cost_39_733 = new Array('137000','195000','164000','155000','136000','127000','126000','125000','120000','119000','115000','114000','109000','109000','108000','104000','103000');
var Cost_39_734 = new Array('86000','114000','96000','92000','81000','79000','78000','77000','75000','74000','72000','71000','70000','69000','68000','67000','66000');
var Cost_39_735 = new Array('116000','162000','131000','123000','103000','100000','99000','98000','95000','92000','87000','85000','83000','81000','80000','77000','75000');
var Cost_39_736 = new Array('86000','114000','96000','92000','81000','79000','78000','77000','75000','74000','72000','71000','70000','69000','68000','67000','66000');
var Cost_39_737 = new Array('116000','162000','131000','123000','103000','100000','99000','98000','95000','92000','87000','85000','83000','81000','80000','77000','75000');
var Quantity_39_count = 17;
var Quantity_39 = new Array('0.5','1','2','3','4','5','6','7','8','9','10','12','15','20','25','30','50');
var Kind_39_count = 10;
var Kind_39 = new Array('16절단면4도','16절양면8도','8절단면4도','8절양면8도','4절단면4도','4절양면8도','A4단면4도','A4양면8도','A3단면4도','A3양면8도');
var Kind_39_Code = new Array('728','729','730','731','732','733','734','735','736','737');
var Cost_40_738 = new Array('98000','138000','123000','118000','109000','107000','106000','105000','103000','102000','100000','98000','96000','96000','95000','93000','92000');
var Cost_40_739 = new Array('137000','195000','164000','155000','136000','127000','126000','125000','120000','119000','115000','114000','109000','109000','108000','104000','103000');
var Cost_40_740 = new Array('86000','114000','96000','92000','81000','79000','78000','77000','75000','74000','72000','71000','70000','69000','68000','67000','66000');
var Cost_40_741 = new Array('116000','162000','131000','123000','103000','100000','99000','98000','95000','92000','87000','85000','83000','81000','80000','77000','75000');
var Cost_40_1629 = new Array('98000','138000','123000','118000','109000','107000','106000','105000','103000','102000','100000','98000','96000','96000','95000','93000','92000');
var Cost_40_1630 = new Array('137000','195000','164000','155000','136000','127000','126000','125000','120000','119000','115000','114000','109000','109000','108000','104000','103000');
var Cost_40_1631 = new Array('86000','114000','96000','92000','81000','79000','78000','77000','75000','74000','72000','71000','70000','69000','68000','67000','66000');
var Cost_40_1632 = new Array('116000','162000','131000','123000','103000','100000','99000','98000','95000','92000','87000','85000','83000','81000','80000','77000','75000');
var Quantity_40_count = 17;
var Quantity_40 = new Array('0.5','1','2','3','4','5','6','7','8','9','10','12','15','20','25','30','50');
var Kind_40_count = 8;
var Kind_40 = new Array('구형장32절단면4도','구형장32절양면8도','구형장A5단면4도','구형장A5양면8도','신형장32절단면4도','신형장32절양면8도','신형장A5단면4도','신형장A5양면8도');
var Kind_40_Code = new Array('738','739','740','741','1629','1630','1631','1632');
var Cost_41_742 = new Array('59000','81000','76000','74000','72000','70000','68000','66000','64000','64000','62000','62000','62000','59000','59000','57000','56000');
var Cost_41_743 = new Array('88000','115000','100000','88000','84000','81000','79000','77000','75000','75000','71000','71000','71000','66000','66000','64000','61000');
var Cost_41_744 = new Array('59000','81000','76000','74000','72000','70000','68000','66000','64000','64000','62000','62000','62000','59000','59000','57000','56000');
var Cost_41_745 = new Array('88000','115000','100000','88000','84000','81000','79000','77000','75000','75000','71000','71000','71000','66000','66000','64000','61000');
var Cost_41_746 = new Array('59000','81000','76000','74000','72000','70000','68000','66000','64000','64000','62000','62000','62000','59000','59000','57000','56000');
var Cost_41_747 = new Array('88000','115000','100000','88000','84000','81000','79000','77000','75000','75000','71000','71000','71000','66000','66000','64000','61000');
var Cost_41_748 = new Array('59000','81000','76000','74000','72000','70000','68000','66000','64000','64000','62000','62000','62000','59000','59000','57000','56000');
var Cost_41_749 = new Array('88000','115000','100000','88000','84000','81000','79000','77000','75000','75000','71000','71000','71000','66000','66000','64000','61000');
var Cost_41_750 = new Array('59000','81000','76000','74000','72000','70000','68000','66000','64000','64000','62000','62000','62000','59000','59000','57000','56000');
var Cost_41_751 = new Array('88000','115000','100000','88000','84000','81000','79000','77000','75000','75000','71000','71000','71000','66000','66000','64000','61000');
var Cost_41_752 = new Array('51000','69000','64000','60000','56000','50000','49000','48000','46000','46000','45000','45000','45000','44000','44000','43000','42000');
var Cost_41_753 = new Array('82000','100000','80000','74000','70000','63000','61000','59000','57000','57000','54000','54000','54000','52000','52000','51000','48000');
var Cost_41_754 = new Array('51000','69000','64000','60000','56000','50000','49000','48000','46000','46000','45000','45000','45000','44000','44000','43000','42000');
var Cost_41_755 = new Array('82000','100000','80000','74000','70000','63000','61000','59000','57000','57000','54000','54000','54000','52000','52000','51000','48000');
var Cost_41_756 = new Array('51000','69000','64000','60000','56000','50000','49000','48000','46000','46000','45000','45000','45000','44000','44000','43000','42000');
var Cost_41_757 = new Array('82000','100000','80000','74000','70000','63000','61000','59000','57000','57000','54000','54000','54000','52000','52000','51000','48000');
var Cost_41_758 = new Array('51000','69000','64000','60000','56000','50000','49000','48000','46000','46000','45000','45000','45000','44000','44000','43000','42000');
var Cost_41_759 = new Array('82000','100000','80000','74000','70000','63000','61000','59000','57000','57000','54000','54000','54000','52000','52000','51000','48000');
var Cost_41_760 = new Array('51000','69000','64000','60000','56000','50000','49000','48000','46000','46000','45000','45000','45000','44000','44000','43000','42000');
var Cost_41_761 = new Array('82000','100000','80000','74000','70000','63000','61000','59000','57000','57000','54000','54000','54000','52000','52000','51000','48000');
var Cost_41_1108 = new Array('139000','159000','120000','108000','101000','85000','80000','75000','72000','70000','65000','65000','65000','62000','62000','60000','57000');
var Cost_41_1109 = new Array('125000','145000','125000','115000','110000','102000','98000','96000','93000','90000','85000','85000','85000','82000','82000','80000','75000');
var Cost_41_1365 = new Array('61000','77000','74000','70000','66000','59000','58000','57000','55000','55000','52000','52000','52000','51000','51000','49000','48000');
var Cost_41_1366 = new Array('69000','91000','86000','84000','82000','79000','77000','75000','73000','73000','69000','69000','69000','65000','65000','63000','61000');
var Cost_41_1455 = new Array('59000','81000','76000','74000','72000','70000','68000','66000','64000','64000','62000','62000','62000','59000','59000','57000','56000');
var Cost_41_1456 = new Array('88000','115000','100000','88000','84000','81000','79000','77000','75000','75000','71000','71000','71000','66000','66000','64000','61000');
var Cost_41_1457 = new Array('51000','69000','64000','60000','56000','50000','49000','48000','46000','46000','45000','45000','45000','44000','44000','43000','42000');
var Cost_41_1458 = new Array('82000','100000','80000','74000','70000','63000','61000','59000','57000','57000','54000','54000','54000','52000','52000','51000','48000');
var Cost_41_1459 = new Array('139000','159000','120000','108000','101000','85000','80000','75000','72000','72000','65000','65000','65000','62000','62000','60000','57000');
var Cost_41_1460 = new Array('125000','145000','125000','115000','110000','102000','98000','96000','93000','93000','85000','85000','85000','82000','82000','80000','75000');
var Cost_41_1461 = new Array('82000','100000','80000','74000','70000','63000','61000','59000','57000','57000','54000','54000','54000','52000','52000','51000','48000');
var Cost_41_1462 = new Array('88000','115000','100000','88000','84000','81000','79000','77000','75000','75000','71000','71000','71000','66000','66000','64000','61000');
var Quantity_41_count = 17;
var Quantity_41 = new Array('0.5','1','2','3','4','5','6','7','8','9','10','12','15','20','25','30','50');
var Kind_41_count = 32;
var Kind_41 = new Array('64절단면1도','64절단면2도','32절단면1도','32절단면2도','16절단면1도','16절단면2도','8절단면1도','8절단면2도','4절단면1도','4절단면2도','A6단면1도','A6단면2도','A5단면1도','A5단면2도','A4단면1도','A4단면2도','A3단면1도','A3단면2도','A2단면1도','A2단면2도','A4양면2도/2도','16절양면2도/2도','A4양면1도/1도','16절양면1도/1도','2절단면1도','2절단면2도','A1단면1도','A1단면2도','A1양면2도/2도','2절양면2도/2도','A1양면1도/1도','2절양면1도/1도');
var Kind_41_Code = new Array('742','743','744','745','746','747','748','749','750','751','752','753','754','755','756','757','758','759','760','761','1108','1109','1365','1366','1455','1456','1457','1458','1459','1460','1461','1462');
var Cost_42_762 = new Array('370000','443000','492000','567000','622000','677000','733000','788000','849000','898000','0');
var Cost_42_763 = new Array('234000','274000','322000','370000','404000','452000','492000','533000','587000','635000','0');
var Cost_42_764 = new Array('242000','295000','341000','390000','431000','485000','539000','580000','634000','689000','0');
var Cost_42_765 = new Array('377000','497000','605000','713000','807000','957000','1077000','1179000','1301000','1416000','0');
var Quantity_42_count = 11;
var Quantity_42 = new Array('100','200','300','400','500','600','700','800','900','1000','2000');
var Kind_42_count = 4;
var Kind_42 = new Array('2절단면4도','4절단면4도','국2절단면4도','국전단면4도');
var Kind_42_Code = new Array('762','763','764','765');
var Cost_43_766 = new Array('221500','279000','452000');
var Cost_43_767 = new Array('349000','423500','654000');
var Cost_43_768 = new Array('393000','508000','804000');
var Cost_43_769 = new Array('530500','662500','1026000');
var Cost_43_770 = new Array('0','0','0');
var Cost_43_500_22_20 = new Array('293500','332500','458500','497500','0');;
var Cost_43_1000_22_20 = new Array('322500','395500','533500','606500','0');;
var Cost_43_2000_22_20 = new Array('476000','603000','797000','924000','0');;
var Cost_43_500_22_22 = new Array('221500','349000','393000','530500','0');;
var Cost_43_1000_22_22 = new Array('279000','423500','508000','662500','0');;
var Cost_43_2000_22_22 = new Array('452000','654000','804000','1026000','0');;
var Cost_43_500_23_22 = new Array('315000','359000','496500','540500','0');;
var Cost_43_1000_23_22 = new Array('353000','437500','592000','676500','0');;
var Cost_43_2000_23_22 = new Array('528000','678000','900000','1050000','0');;
var Cost_43_500_22_20_MC = new Array('333500','372500','498500','537500','0');;
var Cost_43_1000_22_20_MC = new Array('362500','435500','573500','646500','0');;
var Cost_43_2000_22_20_MC = new Array('526000','653000','847000','974000','0');;
var Cost_43_500_22_22_MC = new Array('261500','389000','443000','570500','0');;
var Cost_43_1000_22_22_MC = new Array('319000','463000','558000','702500','0');;
var Cost_43_2000_22_22_MC = new Array('502000','704000','874000','1076000','0');;
var Cost_43_500_23_22_MC = new Array('355000','399000','536500','580500','0');;
var Cost_43_1000_23_22_MC = new Array('393000','477500','632000','716500','0');;
var Cost_43_2000_23_22_MC = new Array('578000','728000','950000','1100000','0');;
var Cost_43_500_22_20_YC = new Array('323500','362500','488500','527500','0');;
var Cost_43_1000_22_20_YC = new Array('352500','425500','563500','636500','0');;
var Cost_43_2000_22_20_YC = new Array('516000','643000','837000','964000','0');;
var Cost_43_500_22_22_YC = new Array('251500','379000','433000','560500','0');;
var Cost_43_1000_22_22_YC = new Array('309000','453500','548000','692500','0');;
var Cost_43_2000_22_22_YC = new Array('492000','694000','864000','1066000','0');;
var Cost_43_500_23_22_YC = new Array('345000','389000','526500','570500','0');;
var Cost_43_1000_23_22_YC = new Array('383000','467500','622000','706500','0');;
var Cost_43_2000_23_22_YC = new Array('568000','718000','940000','1090000','0');;
var Quantity_43_count = 3;
var Quantity_43 = new Array('500','1000','2000');
var Kind_43_count = 5;
var Kind_43 = new Array('A4-08P','A4-12P','A4-16P','A4-20P','A4-24P');
var Kind_43_Code = new Array('766','767','768','769','770');
var Cost_44_771 = new Array('544000','699000','1219000');
var Cost_44_772 = new Array('882000','1145000','1711000');
var Cost_44_773 = new Array('983000','1334000','2155000');
var Cost_44_771_25_25 = new Array('544000','699000','1219000');
var Cost_44_771_26_26 = new Array('450000','551000','948000');
var Cost_44_771_27_27 = new Array('618000','818000','1437000');
var Cost_44_771_28_28 = new Array('0','0','0');
var Cost_44_771_29_29 = new Array('590000','773000','1354000');
var Cost_44_771_30_30 = new Array('660000','884000','1557000');
var Cost_44_771_31_31 = new Array('513000','650000','1129000');
var Cost_44_771_32_32 = new Array('475000','590000','1019000');
var Cost_44_771_33_33 = new Array('506000','640000','1110000');
var Cost_44_771_34_34 = new Array('995000','1415000','2532000');
var Cost_44_771_35_35 = new Array('703000','952000','1683000');
var Cost_44_771_36_36 = new Array('825000','1146000','2037000');
var Cost_44_771_37_37 = new Array('809000','1121000','1992000');
var Cost_44_771_38_38 = new Array('774000','1065000','1889000');
var Cost_44_771_39_39 = new Array('676000','910000','1606000');
var Cost_44_771_40_40 = new Array('749000','1025000','1816000');
var Cost_44_771_135_135 = new Array('437000','531000','911000');
var Cost_44_772_25_25 = new Array('882000','1145000','1711000');
var Cost_44_772_26_26 = new Array('740000','911000','1324000');
var Cost_44_772_27_27 = new Array('996000','1333000','2021000');
var Cost_44_772_28_28 = new Array('0','0','0');
var Cost_44_772_29_29 = new Array('952000','1261000','1903000');
var Cost_44_772_30_30 = new Array('1058000','1437000','2193000');
var Cost_44_772_31_31 = new Array('835000','1068000','1583000');
var Cost_44_772_32_32 = new Array('777000','972000','1426000');
var Cost_44_772_33_33 = new Array('825000','1051000','1556000');
var Cost_44_772_34_34 = new Array('1568000','2279000','3584000');
var Cost_44_772_35_35 = new Array('1124000','1545000','2372000');
var Cost_44_772_36_36 = new Array('1310000','1852000','2878000');
var Cost_44_772_37_37 = new Array('1286000','1812000','2813000');
var Cost_44_772_38_38 = new Array('1232000','1723000','2666000');
var Cost_44_772_39_39 = new Array('1084000','1479000','2262000');
var Cost_44_772_40_40 = new Array('1194000','1660000','2562000');
var Cost_44_772_135_135 = new Array('721000','879000','1271000');
var Cost_44_773_25_25 = new Array('983000','1334000','2155000');
var Cost_44_773_26_26 = new Array('810000','1038000','1654000');
var Cost_44_773_27_27 = new Array('1121000','1571000','2557000');
var Cost_44_773_28_28 = new Array('0','0','0');
var Cost_44_773_29_29 = new Array('1068000','1481000','2403000');
var Cost_44_773_30_30 = new Array('1198000','1702000','2778000');
var Cost_44_773_31_31 = new Array('926000','1236000','1989000');
var Cost_44_773_32_32 = new Array('855000','1115000','1786000');
var Cost_44_773_33_33 = new Array('914000','1215000','1955000');
var Cost_44_773_34_34 = new Array('1818000','2766000','4579000');
var Cost_44_773_35_35 = new Array('1278000','1839000','3011000');
var Cost_44_773_36_36 = new Array('1503000','2226000','3665000');
var Cost_44_773_37_37 = new Array('1474000','2176000','3581000');
var Cost_44_773_38_38 = new Array('1409000','2064000','3391000');
var Cost_44_773_39_39 = new Array('1229000','1755000','2868000');
var Cost_44_773_40_40 = new Array('1362000','1984000','3256000');
var Cost_44_773_135_135 = new Array('786000','997000','1585000');
var Quantity_44_count = 3;
var Quantity_44 = new Array('500','1000','2000');
var Kind_44_count = 3;
var Kind_44 = new Array('A4-08P','A4-12P','A4-16P');
var Kind_44_Code = new Array('771','772','773');
var Cost_45_774 = new Array('164500','181500','222000','239000');
var Cost_45_775 = new Array('191500','232000','266000','366000');
var Cost_45_776 = new Array('282000','316000','455000','489000');
var Cost_45_1667 = new Array('191500','232000','266000','366000');
var Cost_45_500_MC_1 = new Array('179500','216500','322000','233500');;
var Cost_45_1000_MC_1 = new Array('206500','267000','366000','301000');;
var Cost_45_1500_MC_1 = new Array('257000','301000','530000','343000');;
var Cost_45_2000_MC_1 = new Array('274000','420000','589000','479000');;
var Cost_45_500_MC_2 = new Array('209500','236500','342000','253500');;
var Cost_45_1000_MC_2 = new Array('226500','327000','426000','361000');;
var Cost_45_1500_MC_2 = new Array('317000','361000','625000','403000');;
var Cost_45_2000_MC_2 = new Array('334000','515000','709000','574000');;
var Cost_45_500_YC_1 = new Array('179500','206500','312000','223500');;
var Cost_45_1000_YC_1 = new Array('196500','257000','356000','291000');;
var Cost_45_1500_YC_1 = new Array('247000','291000','515000','333000');;
var Cost_45_2000_YC_1 = new Array('264000','405000','569000','464000');;
var Cost_45_500_YC_2 = new Array('199500','226500','322000','243500');;
var Cost_45_1000_YC_2 = new Array('216500','307000','406000','341000');;
var Cost_45_1500_YC_2 = new Array('297000','341000','595000','383000');;
var Cost_45_2000_YC_2 = new Array('314000','485000','669000','544000');;
var Quantity_45_count = 4;
var Quantity_45 = new Array('500','1000','1500','2000');
var Kind_45_count = 4;
var Kind_45 = new Array('A3-2단','국3절-3단(알뜰형)','장국2절-대문','국3절-3단');
var Kind_45_Code = new Array('774','775','776','1667');
var Cost_46_777 = new Array('368000','434000','0','572000','765000','854000');
var Cost_46_778 = new Array('413000','508000','0','663000','997000','1173000');
var Cost_46_779 = new Array('420000','545000','697000','845000','0','0');
var Cost_46_780 = new Array('324000','366000','0','455000','580000','637000');
var Cost_46_781 = new Array('353000','414000','0','515000','787000','901000');
var Cost_46_782 = new Array('357000','438000','556000','678000','0','0');
var Cost_46_783 = new Array('396000','484000','671000','671000','671000','671000');
var Cost_46_784 = new Array('396000','484000','671000','671000','671000','671000');
var Cost_46_785 = new Array('418000','539000','825000','946000','825000','946000');
var Cost_46_786 = new Array('389000','466000','0','627000','851000','955000');
var Cost_46_787 = new Array('442000','553000','0','736000','1101000','1307000');
var Cost_46_788 = new Array('451000','598000','766000','929000','0','0');
var Cost_46_789 = new Array('358000','419000','0','546000','723000','805000');
var Cost_46_790 = new Array('393000','476000','0','614000','928000','1083000');
var Cost_46_791 = new Array('399000','510000','650000','790000','0','0');
var Cost_46_792 = new Array('331000','378000','0','475000','610000','673000');
var Cost_46_793 = new Array('368000','438000','0','554000','843000','973000');
var Cost_46_794 = new Array('374000','467000','593000','723000','0','0');
var Cost_46_795 = new Array('354000','413000','0','535000','706000','785000');
var Cost_46_796 = new Array('388000','470000','0','604000','913000','1064000');
var Cost_46_797 = new Array('395000','502000','640000','779000','0','0');
var Cost_46_798 = new Array('437000','539000','0','751000','1048000','1184000');
var Cost_46_799 = new Array('515000','667000','0','916000','1355000','1636000');
var Cost_46_800 = new Array('527000','727000','937000','1132000','0','0');
var Cost_46_801 = new Array('0','0','0','0','0','0');
var Cost_46_802 = new Array('0','0','0','0','0','0');
var Cost_46_803 = new Array('0','0','0','0','0','0');
var Cost_46_804 = new Array('0','0','0','0','0','0');
var Cost_46_805 = new Array('0','0','0','0','0','0');
var Cost_46_806 = new Array('0','0','0','0','0','0');
var Cost_46_807 = new Array('0','0','0','0','0','0');
var Cost_46_808 = new Array('0','0','0','0','0','0');
var Cost_46_809 = new Array('0','0','0','0','0','0');
var Cost_46_1560 = new Array('354000','412000','0','533000','703000','782000');
var Cost_46_1561 = new Array('460000','582000','0','782000','1165000','1390000');
var Cost_46_1562 = new Array('470000','630000','809000','980000','0','0');
var Cost_46_1563 = new Array('423000','517000','0','714000','989000','1116000');
var Cost_46_1564 = new Array('487000','623000','0','847000','1258000','1510000');
var Cost_46_1565 = new Array('498000','678000','871000','1054000','0','0');
var Cost_46_1566 = new Array('477000','600000','0','856000','1214000','1379000');
var Cost_46_1567 = new Array('702000','958000','0','1379000','2012000','2486000');
var Cost_46_1568 = new Array('722000','1061000','1377000','1656000','0','0');
var Cost_46_1569 = new Array('485000','611000','0','875000','1244000','1414000');
var Cost_46_1570 = new Array('593000','788000','0','1109000','1629000','1991000');
var Cost_46_1571 = new Array('609000','866000','1120000','1350000','0','0');
var Cost_46_1572 = new Array('416000','507000','0','697000','962000','1084000');
var Cost_46_1573 = new Array('583000','773000','0','1084000','1594000','1945000');
var Cost_46_1574 = new Array('598000','848000','1097000','1322000','0','0');
var Cost_46_1575 = new Array('468000','586000','0','832000','1176000','1334000');
var Cost_46_1576 = new Array('560000','737000','0','1028000','1514000','1842000');
var Cost_46_1577 = new Array('574000','808000','1043000','1259000','0','0');
var Cost_46_1578 = new Array('423000','517000','0','714000','989000','1116000');
var Cost_46_1579 = new Array('498000','640000','0','874000','1296000','1559000');
var Cost_46_1580 = new Array('509000','697000','897000','1084000','0','0');
var Cost_46_1581 = new Array('486000','613000','0','878000','1250000','1420000');
var Cost_46_1582 = new Array('544000','712000','0','988000','1458000','1769000');
var Cost_46_1583 = new Array('558000','779000','1006000','1214000','0','0');
var Cost_46_1584 = new Array('317000','356000','0','438000','553000','605000');
var Cost_46_1585 = new Array('344000','401000','0','495000','759000','864000');
var Cost_46_1586 = new Array('349000','424000','537000','655000','0','0');
var Quantity_46_count = 6;
var Quantity_46 = new Array('500','1000','1500','2000','3000','4000');
var Kind_46_count = 60;
var Kind_46 = new Array('라레-8절-2단','라레-A3-2단','라레-국3절-3단','누브-8절-2단','누브-A3-2단','누브-국3절-3단','화인라레-8절-2단','화인라레-A3-2단','화인라레-국3절-3단','스타-8절-2단','스타-A3-2단','스타-국3절-3단','그레-8절-2단','그레-A3-2단','그레-국3절-3단','빌리-8절-2단','빌리-A3-2단','빌리-국3절-3단','머쉬-8절-2단','머쉬-A3-2단','머쉬-국3절-3단','팝셋-8절-2단','팝셋-A3-2단','팝셋-국3절-3단','심볼-8절-2단','심볼-A3-2단','심볼-국3절-3단','키칼금펄-8절-2단','키칼금펄-A3-2단','키칼금펄-국3절-3단','키칼은펄-8절-2단','키칼은펄-A3-2단','키칼은펄-국3절-3단','탄트-8절-2단','탄트-A3-2단','탄트-국3절-3단','키칼라-8절-2단','키칼라-A3-2단','키칼라-국3절-3단','스코-8절-2단','스코-A3-2단','스코-국3절-3단','유포지-8절-2단','유포지-A3-2단','유포지-국3절-3단','카멜레온-8절-2단','카멜레온-A3-2단','카멜레온-국3절-3단','컨셉-8절-2단','컨셉-A3-2단','컨셉-국3절-3단','키칼라아이스골드-8절-2단','키칼라아이스골드-A3-2단','키칼라아이스골드-국3절-3단','스타골드-8절-2단','스타골드-A3-2단','스타골드-국3절-3단','랑데뷰-8절-2단','랑데뷰-A3-2단','랑데뷰-국3절-3단');
var Kind_46_Code = new Array('777','778','779','780','781','782','783','784','785','786','787','788','789','790','791','792','793','794','795','796','797','798','799','800','801','802','803','804','805','806','807','808','809','1560','1561','1562','1563','1564','1565','1566','1567','1568','1569','1570','1571','1572','1573','1574','1575','1576','1577','1578','1579','1580','1581','1582','1583','1584','1585','1586');
var Cost_47_810 = new Array('242000','301000','541000');
var Cost_47_811 = new Array('311500','388500','650500');
var Cost_47_812 = new Array('282000','361000','661000');
var Cost_47_813 = new Array('351500','448500','770500');
var Cost_47_814 = new Array('230000','260500','405000');
var Cost_47_815 = new Array('309000','335500','498000');
var Cost_47_816 = new Array('270000','320500','525000');
var Cost_47_817 = new Array('349000','395500','618000');
var Cost_47_818 = new Array('230000','260500','405000');
var Cost_47_819 = new Array('309000','335500','498000');
var Cost_47_820 = new Array('230000','260500','405000');
var Cost_47_821 = new Array('309000','335500','498000');
var Cost_47_822 = new Array('212000','261000','481000');
var Cost_47_823 = new Array('281500','348500','550500');
var Cost_47_824 = new Array('242000','301000','541000');
var Cost_47_825 = new Array('311500','388500','650500');
var Cost_47_826 = new Array('302000','421000','781000');
var Cost_47_827 = new Array('371500','508500','850500');
var Cost_47_500_MC_1 = new Array('282000','351500','322000','391500','270000','349000','310000','389000','270000','349000','270000','349000','252000','321500','282000','351500','342000','411500');;
var Cost_47_1000_MC_1 = new Array('351000','438500','411000','498500','310500','385500','370500','445500','310500','385500','310500','385500','311000','398500','351000','438500','471000','558500');;
var Cost_47_2000_MC_1 = new Array('641000','750500','761000','870500','465000','558000','585000','678000','465000','558000','465000','558000','581000','650500','641000','750500','881000','950500');;
var Cost_47_500_MC_2 = new Array('312000','381500','352000','421500','310000','389000','350000','429000','310000','389000','310000','389000','282000','351500','312000','381500','372000','441500');;
var Cost_47_1000_MC_2 = new Array('421000','508500','481000','568500','340500','415500','400500','475500','340500','415500','340000','415000','381000','468500','421000','508500','541000','628500');;
var Cost_47_2000_MC_2 = new Array('781000','890500','901000','1010500','565000','658000','685000','778000','565000','658000','565000','658000','721000','790500','781000','890500','1021000','1090500');;
var Cost_47_500_YC_1 = new Array('272000','341500','312000','381500','260000','339000','300000','379000','260000','339000','260000','339000','242000','311500','272000','341500','332000','401500');;
var Cost_47_1000_YC_1 = new Array('341000','428500','401000','488500','300500','375500','360500','435500','300500','375500','300500','375500','301000','388500','341000','428500','461000','548500');;
var Cost_47_2000_YC_1 = new Array('621000','730500','741000','850500','455000','548000','575000','668000','455000','548000','455000','548000','561000','630500','621000','730500','861000','930500');;
var Cost_47_500_YC_2 = new Array('302000','371500','342000','411500','300000','379000','340000','419000','300000','379000','300000','379000','272000','341500','302000','371500','362000','431500');;
var Cost_47_1000_YC_2 = new Array('401000','488500','461000','548500','330500','405500','390500','465500','330500','405500','330500','405500','361000','448500','401000','488500','521000','608500');;
var Cost_47_2000_YC_2 = new Array('741000','850500','861000','970500','545000','638000','665000','758000','545000','638000','545000','638000','681000','750500','741000','850500','981000','1050500');;
var Quantity_47_count = 3;
var Quantity_47 = new Array('500','1000','2000');
var Kind_47_count = 18;
var Kind_47 = new Array('HD1-단면4도','HD1-양면8도','HD2-단면4도','HD2-양면8도','HD3-단면4도','HD3-양면8도','HD4-단면4도','HD4-양면8도','HD5-단면4도','HD5-양면8도','HD6-단면4도','HD6-양면8도','HD7-단면4도','HD7-양면8도','HD8-단면4도','HD8-양면8도','HD9-단면4도','HD9-양면8도');
var Kind_47_Code = new Array('810','811','812','813','814','815','816','817','818','819','820','821','822','823','824','825','826','827');
var Cost_48_828 = new Array('63000','75000','150000','225000','300000','375000','425000','500000','550000','600000','640000','1150000','1700000','2240000','2700000');
var Cost_48_829 = new Array('0','85000','170000','255000','340000','425000','500000','582000','665000','748000','830000','1560000','2300000','3050000','3800000');
var Cost_48_830 = new Array('0','85000','170000','255000','340000','425000','500000','582000','665000','748000','830000','1560000','2300000','3050000','3800000');
var Quantity_48_count = 15;
var Quantity_48 = new Array('500','1000','2000','3000','4000','5000','6000','7000','8000','9000','10000','20000','30000','40000','50000');
var Kind_48_count = 3;
var Kind_48 = new Array('120모조백색','체크레자크91백색110g','줄레자크92백색110g');
var Kind_48_Code = new Array('828','829','830');
var Cost_49_831 = new Array('0','28000','56000','84000','112000','140000','168000','196000','224000','252000','260000','460000','620000','800000','1000000');
var Cost_49_832 = new Array('24000','29000','58000','87000','116000','145000','174000','203000','232000','261000','280000','520000','740000','850000','1040000');
var Cost_49_833 = new Array('0','33000','66000','99000','132000','165000','198000','231000','264000','297000','320000','630000','920000','1200000','1450000');
var Cost_49_834 = new Array('0','33000','66000','99000','132000','165000','198000','231000','264000','297000','320000','630000','920000','1200000','1450000');
var Quantity_49_count = 15;
var Quantity_49 = new Array('500','1000','2000','3000','4000','5000','6000','7000','8000','9000','10000','20000','30000','40000','50000');
var Kind_49_count = 4;
var Kind_49 = new Array('100모조백색','120모조백색','체크레자크91백색110g','줄레자크92백색110g');
var Kind_49_Code = new Array('831','832','833','834');
var Cost_50_835 = new Array('194000','378000','562000','746000','930000');
var Quantity_50_count = 5;
var Quantity_50 = new Array('1','2','3','4','5');
var Kind_50_count = 1;
var Kind_50 = new Array('대소봉투세트');
var Kind_50_Code = new Array('835');
var Cost_51_836 = new Array('165000','259000','377000','471000','589000','683000','1106000');
var Cost_51_837 = new Array('188000','318000','471000','589000','706000','800000','1318000');
var Cost_51_838 = new Array('177000','294000','412000','530000','647000','742000','1153000');
var Cost_51_839 = new Array('177000','294000','412000','530000','647000','742000','1153000');
var Cost_51_840 = new Array('130000','235000','310000','384000','455000','541000','824000');
var Cost_51_1110 = new Array('130000','235000','310000','384000','455000','541000','824000');
var Quantity_51_count = 7;
var Quantity_51 = new Array('1000','2000','3000','4000','5000','6000','10000');
var Kind_51_count = 6;
var Kind_51 = new Array('레자크지','탄트지','레이드지','밍크지','크라프트','화일지');
var Kind_51_Code = new Array('836','837','838','839','840','1110');
var Cost_52_841 = new Array('112000','165000','212000','259000','306000','353000','530000');
var Cost_52_842 = new Array('118000','177000','224000','271000','318000','365000','553000');
var Cost_52_843 = new Array('116000','165000','212000','259000','306000','353000','530000');
var Cost_52_844 = new Array('116000','165000','212000','259000','306000','353000','530000');
var Cost_52_1111 = new Array('101000','141000','195000','235000','271000','306000','471000');
var Cost_52_1112 = new Array('101000','141000','195000','235000','271000','306000','471000');
var Quantity_52_count = 7;
var Quantity_52 = new Array('1000','2000','3000','4000','5000','6000','10000');
var Kind_52_count = 6;
var Kind_52 = new Array('레자크지','탄트지','레이드지','밍크지','크라프트지','화일지');
var Kind_52_Code = new Array('841','842','843','844','1111','1112');
var Cost_53_845 = new Array('259000','471000','683000','895000','1106000','1295000','2083000');
var Cost_53_846 = new Array('318000','589000','847000','1083000','1318000','1554000','2554000');
var Cost_53_847 = new Array('294000','530000','765000','965000','1153000','1342000','2236000');
var Cost_53_848 = new Array('294000','530000','765000','965000','1153000','1342000','2236000');
var Cost_53_1113 = new Array('247000','412000','589000','753000','942000','1059000','1707000');
var Cost_53_1114 = new Array('247000','412000','589000','753000','942000','1059000','1707000');
var Quantity_53_count = 7;
var Quantity_53 = new Array('1','2','3','4','5','6','10');
var Kind_53_count = 6;
var Kind_53 = new Array('레자크지','탄트지','레이드지','밍크지','크라프트지','화일지');
var Kind_53_Code = new Array('845','846','847','848','1113','1114');
var Cost_54_849 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_54_850 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_54_851 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_54_852 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_54_853 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_54_854 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_54_855 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_54_856 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_54_857 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_54_858 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_54_859 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_54_860 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_54_1687 = new Array('48000','80000','120000','155000','223800','292000','363000','433800','504700','576000','648000','720000','1439000','2157000','2874800','3592000');
var Cost_54_1688 = new Array('28000','50000','76950','96000','144000','192000','235000','280800','326200','371200','415800','455000','908000','1362000','1816000','2270000');
var Cost_54_1689 = new Array('27000','49000','75000','94000','141000','186000','230000','273600','317800','362400','405000','450000','898000','1347000','1796000','2245000');
var Cost_54_1690 = new Array('27000','42000','67950','80000','117000','154000','190000','226800','263900','300800','337500','370000','738000','1107000','1476000','1845000');
var Cost_54_1691 = new Array('27000','42000','67950','80000','117000','154000','190000','226800','263900','300800','337500','370000','738000','1107000','1476000','1845000');
var Cost_54_1692 = new Array('27000','42000','67950','80000','117000','154000','190000','226800','263900','300800','337500','370000','738000','1107000','1476000','1845000');
var Cost_54_1687_71_71 = new Array('48000','80000','120000','155000','223800','292000','363000','433800','504700','576000','648000','720000','1439000','2157000','2874800','3592000');
var Cost_54_1687_100_100 = new Array('76000','108000','180000','210000','309900','410000','510000','609600','709800','810000','909900','1000000','2000000','3000000','4000000','5000000');
var Cost_54_1688_2_2 = new Array('33000','48000','76950','92000','135900','180000','222000','264000','303800','344000','381600','420000','820000','1200000','1560000','1900000');
var Cost_54_1688_3_3 = new Array('34000','50000','79950','96000','141900','188000','232000','276000','317800','360000','399600','440000','860000','1260000','1640000','2000000');
var Cost_54_1688_71_71 = new Array('28000','50000','76950','96000','144000','192000','235000','280800','326200','371200','415800','455000','908000','1362000','1816000','2270000');
var Cost_54_1688_72_72 = new Array('42000','72000','111900','140000','207000','274000','340000','406800','473900','540800','607500','670000','1338000','2007000','2676000','3345000');
var Cost_54_1688_73_73 = new Array('42000','72000','111900','140000','207000','274000','340000','406800','473900','540800','607500','670000','1338000','2007000','2676000','3345000');
var Cost_54_1688_77_77 = new Array('42000','72000','111900','140000','207000','274000','340000','406800','473900','540800','607500','670000','1338000','2007000','2676000','3345000');
var Cost_54_1688_92_92 = new Array('42000','72000','111900','140000','207000','274000','340000','406800','473900','540800','607500','670000','1338000','2007000','2676000','3345000');
var Cost_54_1688_95_95 = new Array('42000','72000','111900','140000','207000','274000','340000','406800','473900','540800','607500','670000','1338000','2007000','2676000','3345000');
var Cost_54_1688_96_96 = new Array('42000','72000','111900','140000','207000','274000','340000','406800','473900','540800','607500','670000','1338000','2007000','2676000','3345000');
var Cost_54_1688_100_100 = new Array('42000','72000','111900','140000','207000','274000','340000','406800','473900','540800','607500','670000','1338000','2007000','2676000','3345000');
var Cost_54_1688_101_101 = new Array('42000','72000','111900','140000','207000','274000','340000','406800','473900','540800','607500','670000','1338000','2007000','2676000','3345000');
var Cost_54_1689_71_71 = new Array('27000','49000','75000','94000','141000','186000','230000','273600','317800','362400','405000','450000','898000','1347000','1796000','2245000');
var Cost_54_1689_100_100 = new Array('41000','71000','109950','138000','204000','270000','335000','400800','466900','532800','598500','660000','1318000','1977000','2636000','3295000');
var Cost_54_1690_71_71 = new Array('27000','42000','67950','80000','117000','154000','190000','226800','263900','300800','337500','370000','738000','1107000','1476000','1845000');
var Cost_54_1690_100_100 = new Array('36000','60000','91950','118000','174900','230000','285000','340800','396900','452800','508500','560000','1100000','1638000','2180000','2720000');
var Cost_54_1690_101_101 = new Array('36000','60000','91950','118000','174900','230000','285000','340800','396900','452800','508500','560000','1100000','1638000','2180000','2720000');
var Cost_54_1691_71_71 = new Array('27000','42000','67950','80000','117000','154000','190000','226800','263900','300800','337500','370000','738000','1107000','1476000','1845000');
var Cost_54_1692_71_71 = new Array('27000','42000','67950','80000','117000','154000','190000','226800','263900','300800','337500','370000','738000','1107000','1476000','1845000');
var Quantity_54_count = 16;
var Quantity_54 = new Array('500','1000','1500','2000','3000','4000','5000','6000','7000','8000','9000','10000','20000','30000','40000','50000');
var Kind_54_count = 18;
var Kind_54 = new Array('4절크라프트(A급)','5절크라프트(A급)','6절크라프트(A급)','9절크라프트양중각(A급)','10절크라프트양장중각(A급)','12절크라프트(A급)','5절100모조','5절120모조','4절레자크','5절레자크','6절레자크','9절레자크','4절대봉투(290*390)','5절대봉투(245*332)','6절대봉투(215*300)','9절대봉투(190*260)','10절대봉투(140*300)','12절대봉투(140*260)');
var Kind_54_Code = new Array('849','850','851','852','853','854','855','856','857','858','859','860','1687','1688','1689','1690','1691','1692');
var Cost_55_861 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_55_862 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_55_863 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_55_864 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_55_865 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_55_866 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_55_867 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_55_868 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_55_869 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_55_870 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_55_871 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_55_872 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_55_873 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_55_874 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_55_875 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_55_876 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_55_877 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_55_878 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_55_879 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_55_880 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_55_881 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_55_882 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_55_883 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_55_884 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_55_885 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_55_1351 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_55_1693 = new Array('14000','18000','28050','33000','45900','60000','74000','87000','100800','112800','126000','138000','274000','408000','540000','670000');
var Cost_55_1694 = new Array('19000','25000','39900','46000','66900','84000','100000','118800','137200','155200','172800','190000','374000','555000','732000','900000');
var Cost_55_1695 = new Array('29000','38000','61950','73000','108000','142000','175000','208200','242200','275200','306900','340000','660000','960000','1240000','1500000');
var Cost_55_1696 = new Array('25000','36000','60900','70000','102000','134000','165000','196200','228200','259200','288000','320000','634000','945000','1252000','1550000');
var Cost_55_1697 = new Array('28000','44000','70950','86000','126000','166000','205000','244200','282800','323200','360900','400000','794000','1185000','1572000','1950000');
var Cost_55_1698 = new Array('29000','38000','61950','73000','108000','142000','175000','208200','242200','275200','306900','340000','660000','960000','1240000','1500000');
var Cost_55_1699 = new Array('17000','22000','36900','42000','60900','80000','97000','114000','128800','144000','156600','170000','330000','480000','620000','750000');
var Cost_55_1700 = new Array('17000','22000','36900','42000','60900','80000','97000','114000','128800','144000','156600','170000','330000','480000','620000','750000');
var Cost_55_1701 = new Array('17000','22000','36900','42000','60900','80000','97000','114000','128800','144000','156600','170000','330000','480000','620000','750000');
var Cost_55_1702 = new Array('17000','22000','36900','42000','60900','80000','97000','114000','128800','144000','156600','170000','330000','480000','620000','750000');
var Cost_55_1703 = new Array('17000','22000','36900','42000','60900','80000','97000','114000','128800','144000','156600','170000','330000','480000','620000','750000');
var Cost_55_1704 = new Array('26000','30000','52950','58000','84900','112000','137000','162000','184800','208000','228600','250000','480000','690000','880000','1050000');
var Cost_55_1705 = new Array('26000','30000','52950','58000','84900','112000','137000','162000','184800','208000','228600','250000','480000','690000','880000','1050000');
var Cost_55_1706 = new Array('25000','28000','49500','54000','78900','104000','127000','150000','170800','192000','210600','230000','440000','630000','800000','950000');
var Cost_55_1707 = new Array('28000','40000','63000','78000','114000','150000','185000','220200','256200','291200','324900','360000','714000','1065000','1412000','1750000');
var Cost_55_1708 = new Array('13000','17000','27900','31000','42900','56000','69000','81000','93800','104800','117000','128000','254000','378000','500000','620000');
var Cost_55_1709 = new Array('29000','38000','63900','72000','108000','142000','175000','207600','242200','275200','306900','340000','660000','960000','1240000','1500000');
var Cost_55_1710 = new Array('22000','28000','45900','52000','75900','100000','122000','144000','163800','184000','201600','220000','420000','600000','760000','900000');
var Cost_55_1711 = new Array('22000','28000','45900','52000','75900','100000','122000','144000','163800','184000','201600','220000','420000','600000','760000','900000');
var Cost_55_1712 = new Array('23000','30000','48900','56000','81900','108000','132000','156000','177800','200000','219600','240000','460000','660000','840000','1000000');
var Cost_55_1713 = new Array('28000','33000','58950','64000','93000','122800','152000','180600','210000','239200','266400','295000','580000','861000','1132000','1400000');
var Cost_55_1693_1_1 = new Array('14000','18000','28050','33000','45900','60000','74000','87000','100800','112800','126000','138000','274000','408000','540000','670000');
var Cost_55_1693_2_2 = new Array('14000','19000','30000','35000','48900','64000','79000','93000','107800','120800','135000','148000','294000','438000','580000','720000');
var Cost_55_1693_92_92 = new Array('26000','40000','63000','78000','114000','150000','185000','219600','256200','291200','324900','360000','714000','1065000','1412000','1750000');
var Cost_55_1693_95_95 = new Array('26000','40000','63000','78000','114000','150000','185000','219600','256200','291200','324900','360000','714000','1065000','1412000','1750000');
var Cost_55_1693_100_100 = new Array('26000','40000','63000','78000','114000','150000','185000','219600','256200','291200','324900','360000','714000','1065000','1412000','1750000');
var Cost_55_1694_2_2 = new Array('19000','25000','39900','46000','66900','84000','100000','118800','137200','155200','172800','190000','374000','555000','732000','900000');
var Cost_55_1694_72_72 = new Array('28000','44000','70950','86000','126000','166000','205000','244200','282800','323200','360900','400000','794000','1185000','1572000','1950000');
var Cost_55_1694_95_95 = new Array('28000','44000','70950','86000','126000','166000','205000','244200','282800','323200','360900','400000','794000','1185000','1572000','1950000');
var Cost_55_1694_100_100 = new Array('28000','44000','70950','86000','126000','166000','205000','244200','282800','323200','360900','400000','794000','1185000','1572000','1950000');
var Cost_55_1694_101_101 = new Array('28000','44000','70950','86000','126000','166000','205000','244200','282800','323200','360900','400000','794000','1185000','1572000','1950000');
var Cost_55_1695_2_2 = new Array('29000','38000','61950','73000','108000','142000','175000','208200','242200','275200','306900','340000','660000','960000','1240000','1500000');
var Cost_55_1696_92_92 = new Array('25000','36000','60900','70000','102000','134000','165000','196200','228200','259200','288000','320000','634000','945000','1252000','1550000');
var Cost_55_1696_100_100 = new Array('25000','36000','60900','70000','102000','134000','165000','196200','228200','259200','288000','320000','634000','945000','1252000','1550000');
var Cost_55_1697_72_72 = new Array('28000','44000','70950','86000','126000','166000','205000','244200','282800','323200','360900','400000','794000','1185000','1572000','1950000');
var Cost_55_1697_73_73 = new Array('28000','44000','70950','86000','126000','166000','205000','244200','282800','323200','360900','400000','794000','1185000','1572000','1950000');
var Cost_55_1697_77_77 = new Array('28000','44000','70950','86000','126000','166000','205000','244200','282800','323200','360900','400000','794000','1185000','1572000','1950000');
var Cost_55_1698_70_70 = new Array('29000','38000','61950','73000','108000','142000','175000','208200','242200','275200','306900','340000','660000','960000','1240000','1500000');
var Cost_55_1699_2_2 = new Array('17000','22000','36900','42000','60900','80000','97000','114000','128800','144000','156600','170000','330000','480000','620000','750000');
var Cost_55_1700_2_2 = new Array('17000','22000','36900','42000','60900','80000','97000','114000','128800','144000','156600','170000','330000','480000','620000','750000');
var Cost_55_1701_2_2 = new Array('17000','22000','36900','42000','60900','80000','97000','114000','128800','144000','156600','170000','330000','480000','620000','750000');
var Cost_55_1702_2_2 = new Array('17000','22000','36900','42000','60900','80000','97000','114000','128800','144000','156600','170000','330000','480000','620000','750000');
var Cost_55_1703_2_2 = new Array('17000','22000','36900','42000','60900','80000','97000','114000','128800','144000','156600','170000','330000','480000','620000','750000');
var Cost_55_1704_2_2 = new Array('26000','30000','52950','58000','84900','112000','137000','162000','184800','208000','228600','250000','480000','690000','880000','1050000');
var Cost_55_1705_2_2 = new Array('26000','30000','52950','58000','84900','112000','137000','162000','184800','208000','228600','250000','480000','690000','880000','1050000');
var Cost_55_1706_2_2 = new Array('25000','28000','49500','54000','78900','104000','127000','150000','170800','192000','210600','230000','440000','630000','800000','950000');
var Cost_55_1707_2_2 = new Array('28000','40000','63000','78000','114000','150000','185000','220200','256200','291200','324900','360000','714000','1065000','1412000','1750000');
var Cost_55_1708_1_1 = new Array('13000','17000','27900','31000','42900','56000','69000','81000','93800','104800','117000','128000','254000','378000','500000','620000');
var Cost_55_1708_2_2 = new Array('13000','18000','28950','33000','45900','60000','74000','87000','100800','112800','126000','138000','274000','408000','540000','670000');
var Cost_55_1709_2_2 = new Array('29000','38000','63900','72000','108000','142000','175000','207600','242200','275200','306900','340000','660000','960000','1240000','1500000');
var Cost_55_1710_64_64 = new Array('22000','28000','45900','52000','75900','100000','122000','144000','163800','184000','201600','220000','420000','600000','760000','900000');
var Cost_55_1711_69_69 = new Array('22000','28000','45900','52000','75900','100000','122000','144000','163800','184000','201600','220000','420000','600000','760000','900000');
var Cost_55_1712_65_65 = new Array('23000','30000','48900','56000','81900','108000','132000','156000','177800','200000','219600','240000','460000','660000','840000','1000000');
var Cost_55_1712_66_66 = new Array('23000','30000','48900','56000','81900','108000','132000','156000','177800','200000','219600','240000','460000','660000','840000','1000000');
var Cost_55_1712_67_67 = new Array('23000','30000','48900','56000','81900','108000','132000','156000','177800','200000','219600','240000','460000','660000','840000','1000000');
var Cost_55_1712_68_68 = new Array('23000','30000','48900','56000','81900','108000','132000','156000','177800','200000','219600','240000','460000','660000','840000','1000000');
var Cost_55_1713_3_3 = new Array('28000','33000','58950','64000','93000','122800','152000','180600','210000','239200','266400','295000','580000','861000','1132000','1400000');
var Cost_55_1713_95_95 = new Array('33000','42000','72900','82000','120000','158800','197000','235800','273700','312000','350100','387000','764000','1128000','1492000','1850000');
var Cost_55_1713_100_100 = new Array('33000','42000','72900','82000','120000','158800','197000','235800','273700','312000','350100','387000','764000','1128000','1492000','1850000');
var Quantity_55_count = 16;
var Quantity_55 = new Array('500','1000','1500','2000','3000','4000','5000','6000','7000','8000','9000','10000','20000','30000','40000','50000');
var Kind_55_count = 47;
var Kind_55 = new Array('신규격-80모조','신규격-100모조','이중신규격','황봉투신규격','신규격(A급)','16절120크라프트(A급)','색모조신규격','장교A봉투','장교B봉투','장교C봉투','자켓봉투','A4-100모조구형항공','신형항공봉투','레자크자켓봉투','수강료봉투','레자크티켓봉투','A4봉투-80모조','A4봉투-100모조','A4봉투-레자크','월급봉투(A급)','카드봉투(135*195)','카드봉투(130*180)','카드봉투(120*180)','카드봉투(120*190)','카드봉투(115*165)','창문봉투(자켓형)','A4다대봉투(105*220)','A4자켓봉투(105*220)','A4창문봉투(105*220)','티켓봉투(85*175)','수강료봉투(100*205)','월급봉투(110*200)','카드봉투(135*195)','카드봉투(130*180)','카드봉투(120*180)','카드봉투(120*190)','카드봉투(115*165)','장교A봉투(105*235)','장교B봉투(100*210)','장교C봉투(95*188)','항공봉투(105*235)','16절다대봉투(100*200)','16절이중봉투(100*205)','16절황봉투(100*205)','16절크라프트(100*205)','16절색지봉투(100*205)','부동산봉투(230*120)');
var Kind_55_Code = new Array('861','862','863','864','865','866','867','868','869','870','871','872','873','874','875','876','877','878','879','880','881','882','883','884','885','1351','1693','1694','1695','1696','1697','1698','1699','1700','1701','1702','1703','1704','1705','1706','1707','1708','1709','1710','1711','1712','1713');
var Cost_56_886 = new Array('0','0','0','0','0','0','23000','0','0','0','0','42000','0','0','0','0','0','0','0','0','0');
var Cost_56_887 = new Array('0','0','0','0','0','0','32000','0','0','0','0','51000','0','0','0','0','0','0','0','0','0');
var Cost_56_888 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_56_889 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_56_890 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_56_891 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_56_892 = new Array('0','0','0','0','0','0','26000','0','0','0','0','45000','0','0','0','0','0','0','0','0','0');
var Cost_56_893 = new Array('0','0','0','0','0','0','35000','0','0','0','0','54000','0','0','0','0','0','0','0','0','0');
var Cost_56_894 = new Array('19000','23000','28000','33000','40000','50000','63000','75000','88000','100000','109000','121000','144000','168000','192000','235000','282000','329000','376000','423000','470000');
var Cost_56_895 = new Array('28000','32000','37000','42000','49000','59000','81000','93000','106000','118000','136000','148000','171000','204000','228000','280000','336000','392000','448000','504000','560000');
var Cost_56_896 = new Array('16000','21000','25000','31000','37000','46000','52000','61000','68000','74000','84000','93000','112000','130000','148000','181000','216000','253000','288000','325000','350000');
var Cost_56_897 = new Array('25000','30000','34000','40000','46000','55000','61000','70000','77000','83000','98000','107000','126000','148000','166000','204000','243000','285000','324000','366000','395000');
var Quantity_56_count = 21;
var Quantity_56 = new Array('10','15','20','25','30','40','50','60','70','80','90','100','120','140','160','200','240','280','320','360','400');
var Kind_56_count = 12;
var Kind_56 = new Array('48절-100매-1도','48절-100매-2도','32절-100매-1도','32절-100매-2도','A5-100매-1도','A5-100매-2도','A4-3등분-100매-1도','A4-3등분-100매-2도','A4-100매-1도','A4-100매-2도','16절-100매-1도','16절-100매-2도');
var Kind_56_Code = new Array('886','887','888','889','890','891','892','893','894','895','896','897');
var Quantity_57_count = 21;
var Quantity_57 = new Array('10','15','20','25','30','40','50','60','70','80','90','100','120','140','160','200','240','280','320','360','400');
var Kind_57_count = 12;
var Kind_56 = new Array('48절-100매-1도','48절-100매-2도','32절-100매-1도','32절-100매-2도','A5-100매-1도','A5-100매-2도','A4-3등분-100매-1도','A4-3등분-100매-2도','A4-100매-1도','A4-100매-2도','16절-100매-1도','16절-100매-2도');
var Kind_56_Code = new Array('886','887','888','889','890','891','892','893','894','895','896','897');
var Cost_58_898 = new Array('38000','76000','114000','152000','190000','222000','259000','296000','333000','370000');
var Cost_58_899 = new Array('47000','94000','141000','188000','235000','276000','322000','368000','414000','460000');
var Cost_58_900 = new Array('53000','106000','159000','212000','265000','306000','357000','408000','459000','510000');
var Cost_58_901 = new Array('62000','124000','186000','248000','310000','360000','420000','480000','540000','600000');
var Cost_58_902 = new Array('48000','96000','144000','192000','240000','282000','329000','376000','423000','470000');
var Cost_58_903 = new Array('57000','114000','171000','228000','285000','336000','392000','448000','504000','560000');
var Cost_58_904 = new Array('70000','140000','210000','280000','350000','414000','483000','552000','621000','690000');
var Cost_58_905 = new Array('79000','158000','237000','316000','395000','468000','546000','624000','702000','780000');
var Quantity_58_count = 10;
var Quantity_58 = new Array('1','2','3','4','5','6','7','8','9','10');
var Kind_58_count = 8;
var Kind_58 = new Array('국전연단위-1도','국전연단위-2도','46전연단위-1도','46전연단위-2도','국전연단위(제본)-1도','국전연단위(제본)-2도','46전연단위(제본)-1도','46전연단위(제본)-2도');
var Kind_58_Code = new Array('898','899','900','901','902','903','904','905');
var Cost_59_906 = new Array('39000','64000','109000','173000','231000','242000','290400','338800','387200','435600','484000');
var Cost_59_907 = new Array('48000','73000','118000','191000','255000','269000','322800','376600','430400','484200','538000');
var Cost_59_908 = new Array('45000','79000','133000','212000','283000','338000','405600','473200','540800','608400','676000');
var Cost_59_909 = new Array('54000','88000','151000','230000','307000','374000','448800','523600','598400','673200','748000');
var Cost_59_910 = new Array('61000','107000','181000','287000','383000','457000','548400','639800','731200','822600','914000');
var Cost_59_911 = new Array('70000','125000','208000','323000','431000','520000','624000','728000','832000','936000','1040000');
var Cost_59_912 = new Array('53000','87000','148000','235000','314000','327000','392400','457800','523200','588600','654000');
var Cost_59_913 = new Array('62000','96000','166000','262000','350000','372000','446400','520800','595200','669600','744000');
var Cost_59_914 = new Array('51000','87000','164000','251000','335000','362000','434400','506800','579200','651600','724000');
var Cost_59_915 = new Array('60000','96000','182000','269000','359000','398000','477600','557200','636800','716400','796000');
var Cost_59_916 = new Array('67000','121000','236000','357000','476000','507000','608400','709800','811200','912600','1014000');
var Cost_59_917 = new Array('76000','130000','254000','384000','512000','552000','662400','772800','883200','993600','1104000');
var Cost_59_918 = new Array('90000','173000','319000','492000','656000','734000','880800','1027600','1174400','1321200','1468000');
var Cost_59_919 = new Array('99000','191000','355000','546000','728000','824000','988800','1153600','1318400','1483200','1648000');
var Cost_59_920 = new Array('69000','118000','221000','337000','450000','489000','586800','684600','782400','880200','978000');
var Cost_59_921 = new Array('78000','127000','248000','373000','498000','552000','662400','772800','883200','993600','1104000');
var Cost_59_922 = new Array('72000','140000','242000','381000','508000','555000','666000','777000','888000','999000','1110000');
var Cost_59_923 = new Array('81000','149000','260000','408000','544000','600000','720000','840000','960000','1080000','1200000');
var Cost_59_924 = new Array('103000','169000','314000','483000','644000','761000','913200','1065400','1217600','1369800','1522000');
var Cost_59_925 = new Array('112000','187000','341000','519000','692000','824000','988800','1153600','1318400','1483200','1648000');
var Cost_59_926 = new Array('183000','249000','424000','652000','870000','1027000','1232400','1437800','1643200','1848600','2054000');
var Cost_59_927 = new Array('201000','276000','469000','724000','966000','1144000','1372800','1601600','1830400','2059200','2288000');
var Cost_59_928 = new Array('106000','189000','327000','515000','687000','755000','906000','1057000','1208000','1359000','1510000');
var Cost_59_929 = new Array('115000','207000','363000','560000','747000','818000','981600','1145200','1308800','1472400','1636000');
var Quantity_59_count = 11;
var Quantity_59 = new Array('50','100','200','300','400','500','600','700','800','900','1000');
var Kind_59_count = 24;
var Kind_59 = new Array('48절-2매1조-1도','48절-2매1조-2도','32절-2매1조-1도','32절-2매1조-2도','A5-2매1조-1도','A5-2매1조-2도','A4-3등분-2매1조-1도','A4-3등분-2매1조-2도','48절-3매1조-1도','48절-3매1조-2도','32절-3매1조-1도','32절-3매1조-2도','A5-3매1조-1도','A5-3매1조-2도','A4-3등분-3매1조-1도','A4-3등분-3매1조-2도','48절-4매1조-1도','48절-4매1조-2도','32절-4매1조-1도','32절-4매1조-2도','A5-4매1조-1도','A5-4매1조-2도','A4-3등분-4매1조-1도','A4-3등분-4매1조-2도');
var Kind_59_Code = new Array('906','907','908','909','910','911','912','913','914','915','916','917','918','919','920','921','922','923','924','925','926','927','928','929');
var Cost_60_930 = new Array('30000','55000','72000','85000','107000','121000','142000','169000','191000','213000');
var Cost_60_931 = new Array('39000','64000','81000','94000','118000','139000','163000','187000','211000','235000');
var Cost_60_932 = new Array('27000','48000','72000','84000','105000','106000','124000','116000','131000','146000');
var Cost_60_933 = new Array('36000','57000','81000','93000','117000','115000','135000','125000','141000','157000');
var Cost_60_934 = new Array('43000','79000','121000','145000','182000','217000','0','0','0','0');
var Cost_60_935 = new Array('52000','88000','139000','163000','200000','244000','0','0','0','0');
var Cost_60_936 = new Array('37000','61000','91000','109000','133000','164000','0','0','0','0');
var Cost_60_937 = new Array('46000','70000','100000','118000','142000','182000','0','0','0','0');
var Cost_60_938 = new Array('72000','116000','158000','193000','249000','0','0','386000','0','0');
var Cost_60_939 = new Array('81000','125000','176000','211000','276000','0','0','422000','0','0');
var Cost_60_940 = new Array('61000','103000','0','151000','193000','230000','0','290000','0','0');
var Cost_60_941 = new Array('70000','112000','0','160000','211000','248000','0','308000','0','0');
var Quantity_60_count = 10;
var Quantity_60 = new Array('10','20','30','40','50','60','70','80','90','100');
var Kind_60_count = 12;
var Kind_60 = new Array('A4-2매1조-1도','A4-2매1조-2도','16절-2매1조-1도','16절-2매1조-2도','A4-3매1조-1도','A4-3매1조-2도','16절-3매1조-1도','16절-3매1조-2도','A4-4매1조-1도','A4-4매1조-2도','16절-4매1조-1도','16절-4매1조-2도');
var Kind_60_Code = new Array('930','931','932','933','934','935','936','937','938','939','940','941');
var Cost_61_942 = new Array('85000','170000','255000','328000','410000','462000','539000','616000','693000','770000');
var Cost_61_943 = new Array('94000','188000','282000','364000','455000','516000','602000','688000','774000','860000');
var Cost_61_944 = new Array('116000','232000','348000','448000','560000','648000','756000','864000','972000','1080000');
var Cost_61_945 = new Array('125000','250000','375000','484000','605000','702000','819000','936000','1053000','1170000');
var Cost_61_946 = new Array('109000','218000','327000','424000','530000','606000','707000','808000','909000','1010000');
var Cost_61_947 = new Array('118000','236000','354000','460000','575000','660000','770000','880000','990000','1100000');
var Cost_61_948 = new Array('140000','280000','420000','544000','680000','792000','924000','1056000','1188000','1320000');
var Cost_61_949 = new Array('149000','298000','447000','580000','725000','846000','987000','1128000','1269000','1410000');
var Quantity_61_count = 10;
var Quantity_61 = new Array('1','2','3','4','5','6','7','8','9','10');
var Kind_61_count = 8;
var Kind_61 = new Array('국전연단위-2매1조-1도','국전연단위-2매1조-2도','46전연단위-2매1조-1도','46전연단위-2매1조-2도','국전연단위-3매1조-1도','국전연단위-3매1조-2도','46전연단위-3매1조-1도','46전연단위-3매1조-2도');
var Kind_61_Code = new Array('942','943','944','945','946','947','948','949');
var Cost_62_950 = new Array('0','64000','66000','0','0','71000','76000');
var Cost_62_951 = new Array('0','122000','124000','0','0','129000','134000');
var Cost_62_952 = new Array('0','67000','69000','0','73000','77500','0');
var Cost_62_953 = new Array('0','124000','126000','0','130000','134500','0');
var Cost_62_954 = new Array('0','83000','84500','0','89500','94500','0');
var Cost_62_955 = new Array('0','157000','158500','0','163500','168500','0');
var Cost_62_956 = new Array('0','95500','99000','102000','106000','0','0');
var Cost_62_957 = new Array('0','169500','179000','189000','198000','0','0');
var Cost_62_984 = new Array('0','0','0','0','0','0','0');
var Cost_62_985 = new Array('0','0','0','0','0','0','0');
var Cost_62_986 = new Array('0','0','0','0','0','0','0');
var Cost_62_987 = new Array('0','0','0','0','0','0','0');
var Cost_62_988 = new Array('0','0','0','0','0','0','0');
var Cost_62_989 = new Array('0','0','0','0','0','0','0');
var Cost_62_990 = new Array('0','0','0','0','0','0','0');
var Cost_62_991 = new Array('0','0','0','0','0','0','0');
var Cost_62_950_18_18 = new Array('0','64000','66000','71000','76000');
var Cost_62_950_19_19 = new Array('0','65000','67000','73000','78000');
var Cost_62_950_20_20 = new Array('0','67000','70000','76000','82000');
var Cost_62_950_21_21 = new Array('0','68000','72000','80000','86000');
var Cost_62_950_22_22 = new Array('0','71000','75000','83000','90000');
var Cost_62_950_23_23 = new Array('0','73000','80000','89000','97000');
var Cost_62_950_24_24 = new Array('0','77000','84000','94000','104000');
var Cost_62_951_18_18 = new Array('0','122000','124000','129000','134000');
var Cost_62_951_19_19 = new Array('0','123000','125000','131000','137000');
var Cost_62_951_20_20 = new Array('0','125000','128000','135000','143000');
var Cost_62_951_21_21 = new Array('0','127000','131000','139000','147000');
var Cost_62_951_22_22 = new Array('0','130000','133000','142000','151000');
var Cost_62_951_23_23 = new Array('0','132000','139000','148000','158000');
var Cost_62_951_24_24 = new Array('0','136000','143000','154000','165000');
var Cost_62_952_18_18 = new Array('0','67000','69000','73000','77500','0');
var Cost_62_952_19_19 = new Array('0','70000','72000','76000','80500','0');
var Cost_62_952_20_20 = new Array('0','74000','77000','81000','86000','0');
var Cost_62_952_21_21 = new Array('0','77000','80000','86000','92000','0');
var Cost_62_952_22_22 = new Array('0','81000','85000','91000','97500','0');
var Cost_62_952_23_23 = new Array('0','87000','92000','100000','107500','0');
var Cost_62_952_24_24 = new Array('0','92000','98000','108000','117000','0');
var Cost_62_953_18_18 = new Array('0','124000','126000','130000','134500','0');
var Cost_62_953_19_19 = new Array('0','127000','129000','133000','137500','0');
var Cost_62_953_20_20 = new Array('0','131000','134000','138000','143000','0');
var Cost_62_953_21_21 = new Array('0','134000','137000','143000','149000','0');
var Cost_62_953_22_22 = new Array('0','138000','142000','148000','154500','0');
var Cost_62_953_23_23 = new Array('0','144000','149000','156000','164500','0');
var Cost_62_953_24_24 = new Array('0','149000','155000','165000','174000','0');
var Cost_62_954_18_18 = new Array('0','83000','84500','89500','94500');
var Cost_62_954_19_19 = new Array('0','87000','89000','94000','99000');
var Cost_62_954_20_20 = new Array('0','90000','93000','100000','107000');
var Cost_62_954_21_21 = new Array('0','94000','98000','106500','115500');
var Cost_62_954_22_22 = new Array('0','100000','104000','113000','123000');
var Cost_62_954_23_23 = new Array('0','110000','115000','125000','137000');
var Cost_62_954_24_24 = new Array('0','118500','124500','136500','151500');
var Cost_62_955_18_18 = new Array('0','157000','158500','163500','168500');
var Cost_62_955_19_19 = new Array('0','161000','163000','168000','173000');
var Cost_62_955_20_20 = new Array('0','164000','167000','174000','181000');
var Cost_62_955_21_21 = new Array('0','168500','172500','180500','189500');
var Cost_62_955_22_22 = new Array('0','174000','178000','187000','197000');
var Cost_62_955_23_23 = new Array('0','184000','189000','199000','211000');
var Cost_62_955_24_24 = new Array('0','192500','198500','210500','225500');
var Cost_62_956_18_18 = new Array('0','95500','99000','102000','106000');
var Cost_62_956_19_19 = new Array('0','98500','103000','107000','111000');
var Cost_62_956_20_20 = new Array('0','104000','110000','115000','120000');
var Cost_62_956_21_21 = new Array('0','110000','117000','123000','129000');
var Cost_62_956_22_22 = new Array('0','115500','124000','131000','138000');
var Cost_62_956_23_23 = new Array('0','125500','136000','145000','154000');
var Cost_62_956_24_24 = new Array('0','135000','147000','158000','169000');
var Cost_62_957_18_18 = new Array('0','169500','179000','189000','198000');
var Cost_62_957_19_19 = new Array('0','172500','183000','193000','203000');
var Cost_62_957_20_20 = new Array('0','178000','190000','201000','212000');
var Cost_62_957_21_21 = new Array('0','184000','197000','209000','221000');
var Cost_62_957_22_22 = new Array('0','189500','204000','217000','230000');
var Cost_62_957_23_23 = new Array('0','199500','216000','231000','246000');
var Cost_62_957_24_24 = new Array('0','209000','227000','244000','261000');
var Cost_62_984_18_18 = new Array('0','0','0','0');
var Cost_62_984_19_19 = new Array('0','0','0','0');
var Cost_62_984_20_20 = new Array('0','0','0','0');
var Cost_62_984_21_21 = new Array('0','0','0','0');
var Cost_62_984_22_22 = new Array('0','0','0','0');
var Cost_62_984_23_23 = new Array('0','0','0','0');
var Cost_62_984_24_24 = new Array('0','0','0','0');
var Cost_62_985_18_18 = new Array('0','0','0','0');
var Cost_62_985_19_19 = new Array('0','0','0','0');
var Cost_62_985_20_20 = new Array('0','0','0','0');
var Cost_62_985_21_21 = new Array('0','0','0','0');
var Cost_62_985_22_22 = new Array('0','0','0','0');
var Cost_62_985_23_23 = new Array('0','0','0','0');
var Cost_62_985_24_24 = new Array('0','0','0','0');
var Cost_62_986_18_18 = new Array('0','0','0','0');
var Cost_62_986_19_19 = new Array('0','0','0','0');
var Cost_62_986_20_20 = new Array('0','0','0','0');
var Cost_62_986_21_21 = new Array('0','0','0','0');
var Cost_62_986_22_22 = new Array('0','0','0','0');
var Cost_62_986_23_23 = new Array('0','0','0','0');
var Cost_62_986_24_24 = new Array('0','0','0','0');
var Cost_62_987_18_18 = new Array('0','0','0','0');
var Cost_62_987_19_19 = new Array('0','0','0','0');
var Cost_62_987_20_20 = new Array('0','0','0','0');
var Cost_62_987_21_21 = new Array('0','0','0','0');
var Cost_62_987_22_22 = new Array('0','0','0','0');
var Cost_62_987_23_23 = new Array('0','0','0','0');
var Cost_62_987_24_24 = new Array('0','0','0','0');
var Cost_62_988_18_18 = new Array('0','0','0','0');
var Cost_62_988_19_19 = new Array('0','0','0','0');
var Cost_62_988_20_20 = new Array('0','0','0','0');
var Cost_62_988_21_21 = new Array('0','0','0','0');
var Cost_62_988_22_22 = new Array('0','0','0','0');
var Cost_62_988_23_23 = new Array('0','0','0','0');
var Cost_62_988_24_24 = new Array('0','0','0','0');
var Cost_62_989_18_18 = new Array('0','0','0','0');
var Cost_62_989_19_19 = new Array('0','0','0','0');
var Cost_62_989_20_20 = new Array('0','0','0','0');
var Cost_62_989_21_21 = new Array('0','0','0','0');
var Cost_62_989_22_22 = new Array('0','0','0','0');
var Cost_62_989_23_23 = new Array('0','0','0','0');
var Cost_62_989_24_24 = new Array('0','0','0','0');
var Cost_62_990_18_18 = new Array('0','0','0','0');
var Cost_62_990_19_19 = new Array('0','0','0','0');
var Cost_62_990_20_20 = new Array('0','0','0','0');
var Cost_62_990_21_21 = new Array('0','0','0','0');
var Cost_62_990_22_22 = new Array('0','0','0','0');
var Cost_62_990_23_23 = new Array('0','0','0','0');
var Cost_62_990_24_24 = new Array('0','0','0','0');
var Cost_62_991_18_18 = new Array('0','0','0','0');
var Cost_62_991_19_19 = new Array('0','0','0','0');
var Cost_62_991_20_20 = new Array('0','0','0','0');
var Cost_62_991_21_21 = new Array('0','0','0','0');
var Cost_62_991_22_22 = new Array('0','0','0','0');
var Cost_62_991_23_23 = new Array('0','0','0','0');
var Cost_62_991_24_24 = new Array('0','0','0','0');
var Quantity_62_950 = new Array('10','50','100','300','500');
var Quantity_62_950_count=5;
var Quantity_62_951 = new Array('10','50','100','300','500');
var Quantity_62_951_count=5;
var Quantity_62_952 = new Array('10','50','100','200','300','500');
var Quantity_62_952_count=6;
var Quantity_62_953 = new Array('10','50','100','200','300','500');
var Quantity_62_953_count=6;
var Quantity_62_954 = new Array('10','50','100','200','300');
var Quantity_62_954_count=5;
var Quantity_62_955 = new Array('10','50','100','200','300');
var Quantity_62_955_count=5;
var Quantity_62_956 = new Array('10','50','100','150','200');
var Quantity_62_956_count=5;
var Quantity_62_957 = new Array('10','50','100','150','200');
var Quantity_62_957_count=5;
var Quantity_62_984 = new Array('10','50','100','500');
var Quantity_62_984_count=4;
var Quantity_62_985 = new Array('10','50','100','500');
var Quantity_62_985_count=4;
var Quantity_62_986 = new Array('10','50','100','500');
var Quantity_62_986_count=4;
var Quantity_62_987 = new Array('10','50','100','500');
var Quantity_62_987_count=4;
var Quantity_62_988 = new Array('10','50','100','200');
var Quantity_62_988_count=4;
var Quantity_62_989 = new Array('10','50','100','200');
var Quantity_62_989_count=4;
var Quantity_62_990 = new Array('10','50','100','150');
var Quantity_62_990_count=4;
var Quantity_62_991 = new Array('10','50','100','150');
var Quantity_62_991_count=4;
var Quantity_62_count = 7;
var Quantity_62 = new Array('10','50','100','150','200','300','500');
var Kind_62_count = 16;
var Kind_62 = new Array('4절단면4도','4절양면8도','국2절단면4도','국2절양면8도','2절단면4도','2절양면8도','국전단면4도','국전양면8도','16절단면4도','16절양면8도','8절단면4도','8절양면8도','A4단면4도','A4양면8도','A3단면4도','A3양면8도');
var Kind_62_Code = new Array('950','951','952','953','954','955','956','957','984','985','986','987','988','989','990','991');
var Cost_63_958 = new Array('900','7000','25000');
var Cost_63_959 = new Array('1800','14000','40000');
var Cost_63_960 = new Array('1000','9000','30000');
var Cost_63_961 = new Array('2000','18000','50000');
var Cost_63_962 = new Array('1600','14000','40000');
var Cost_63_963 = new Array('3200','28000','70000');
var Cost_63_964 = new Array('1700','15000','50000');
var Cost_63_965 = new Array('3400','30000','90000');
var Cost_63_958_1_1 = new Array('900','7000','25000','0');
var Cost_63_958_2_2 = new Array('900','7000','25000','0');
var Cost_63_958_3_3 = new Array('900','7000','25000','0');
var Cost_63_958_4_4 = new Array('900','7000','25000','0');
var Cost_63_958_5_5 = new Array('900','7000','25000','0');
var Cost_63_958_6_6 = new Array('900','7000','25000','0');
var Cost_63_958_7_7 = new Array('900','7000','25000','0');
var Cost_63_958_18_18 = new Array('900','7000','25000','0');
var Cost_63_958_19_19 = new Array('900','7000','25000','0');
var Cost_63_958_20_20 = new Array('900','7000','25000','0');
var Cost_63_958_21_21 = new Array('900','7000','25000','0');
var Cost_63_958_22_22 = new Array('900','7000','25000','0');
var Cost_63_958_23_23 = new Array('900','7000','25000','0');
var Cost_63_958_24_24 = new Array('900','7000','25000','0');
var Cost_63_959_1_1 = new Array('1800','14000','40000','0');
var Cost_63_959_2_2 = new Array('1800','14000','40000','0');
var Cost_63_959_3_3 = new Array('1800','14000','40000','0');
var Cost_63_959_4_4 = new Array('1800','14000','40000','0');
var Cost_63_959_5_5 = new Array('1800','14000','40000','0');
var Cost_63_959_6_6 = new Array('1800','14000','40000','0');
var Cost_63_959_7_7 = new Array('1800','14000','40000','0');
var Cost_63_959_18_18 = new Array('1800','14000','40000','0');
var Cost_63_959_19_19 = new Array('1800','14000','40000','0');
var Cost_63_959_20_20 = new Array('1800','14000','40000','0');
var Cost_63_959_21_21 = new Array('1800','14000','40000','0');
var Cost_63_959_22_22 = new Array('1800','14000','40000','0');
var Cost_63_959_23_23 = new Array('1800','14000','40000','0');
var Cost_63_959_24_24 = new Array('1800','14000','40000','0');
var Cost_63_960_1_1 = new Array('1000','9000','30000','0');
var Cost_63_960_2_2 = new Array('1000','9000','30000','0');
var Cost_63_960_3_3 = new Array('1000','9000','30000','0');
var Cost_63_960_4_4 = new Array('1000','9000','30000','0');
var Cost_63_960_5_5 = new Array('1000','9000','30000','0');
var Cost_63_960_6_6 = new Array('1000','9000','30000','0');
var Cost_63_960_7_7 = new Array('1000','9000','30000','0');
var Cost_63_960_18_18 = new Array('1000','9000','30000','0');
var Cost_63_960_19_19 = new Array('1000','9000','30000','0');
var Cost_63_960_20_20 = new Array('1000','9000','30000','0');
var Cost_63_960_21_21 = new Array('1000','9000','30000','0');
var Cost_63_960_22_22 = new Array('1000','9000','30000','0');
var Cost_63_960_23_23 = new Array('1000','9000','30000','0');
var Cost_63_960_24_24 = new Array('1000','9000','30000','0');
var Cost_63_961_1_1 = new Array('2000','18000','50000','0');
var Cost_63_961_2_2 = new Array('2000','18000','50000','0');
var Cost_63_961_3_3 = new Array('2000','18000','50000','0');
var Cost_63_961_4_4 = new Array('2000','18000','50000','0');
var Cost_63_961_5_5 = new Array('2000','18000','50000','0');
var Cost_63_961_6_6 = new Array('2000','18000','50000','0');
var Cost_63_961_7_7 = new Array('2000','18000','50000','0');
var Cost_63_961_18_18 = new Array('2000','18000','50000','0');
var Cost_63_961_19_19 = new Array('2000','18000','50000','0');
var Cost_63_961_20_20 = new Array('2000','18000','50000','0');
var Cost_63_961_21_21 = new Array('2000','18000','50000','0');
var Cost_63_961_22_22 = new Array('2000','18000','50000','0');
var Cost_63_961_23_23 = new Array('2000','18000','50000','0');
var Cost_63_961_24_24 = new Array('2000','18000','50000','0');
var Cost_63_962_1_1 = new Array('1600','14000','40000','0');
var Cost_63_962_2_2 = new Array('1600','14000','40000','0');
var Cost_63_962_3_3 = new Array('1600','14000','40000','0');
var Cost_63_962_4_4 = new Array('1600','14000','40000','0');
var Cost_63_962_5_5 = new Array('1600','14000','40000','0');
var Cost_63_962_6_6 = new Array('1600','14000','40000','0');
var Cost_63_962_7_7 = new Array('1600','14000','40000','0');
var Cost_63_962_18_18 = new Array('1600','14000','40000','0');
var Cost_63_962_19_19 = new Array('1600','14000','40000','0');
var Cost_63_962_20_20 = new Array('1600','14000','40000','0');
var Cost_63_962_21_21 = new Array('1600','14000','40000','0');
var Cost_63_962_22_22 = new Array('1600','14000','40000','0');
var Cost_63_962_23_23 = new Array('1600','14000','40000','0');
var Cost_63_962_24_24 = new Array('1600','14000','40000','0');
var Cost_63_963_1_1 = new Array('3200','28000','70000','0');
var Cost_63_963_2_2 = new Array('3200','28000','70000','0');
var Cost_63_963_3_3 = new Array('3200','28000','70000','0');
var Cost_63_963_4_4 = new Array('3200','28000','70000','0');
var Cost_63_963_5_5 = new Array('3200','28000','70000','0');
var Cost_63_963_6_6 = new Array('3200','28000','70000','0');
var Cost_63_963_7_7 = new Array('3200','28000','70000','0');
var Cost_63_963_18_18 = new Array('3200','28000','70000','0');
var Cost_63_963_19_19 = new Array('3200','28000','70000','0');
var Cost_63_963_20_20 = new Array('3200','28000','70000','0');
var Cost_63_963_21_21 = new Array('3200','28000','70000','0');
var Cost_63_963_22_22 = new Array('3200','28000','70000','0');
var Cost_63_963_23_23 = new Array('3200','28000','70000','0');
var Cost_63_963_24_24 = new Array('3200','28000','70000','0');
var Cost_63_964_1_1 = new Array('1700','15000','50000','0');
var Cost_63_964_2_2 = new Array('1700','15000','50000','0');
var Cost_63_964_3_3 = new Array('1700','15000','50000','0');
var Cost_63_964_4_4 = new Array('1700','15000','50000','0');
var Cost_63_964_5_5 = new Array('1700','15000','50000','0');
var Cost_63_964_6_6 = new Array('1700','15000','50000','0');
var Cost_63_964_7_7 = new Array('1700','15000','50000','0');
var Cost_63_964_18_18 = new Array('1700','15000','50000','0');
var Cost_63_964_19_19 = new Array('1700','15000','50000','0');
var Cost_63_964_20_20 = new Array('1700','15000','50000','0');
var Cost_63_964_21_21 = new Array('1700','15000','50000','0');
var Cost_63_964_22_22 = new Array('1700','15000','50000','0');
var Cost_63_964_23_23 = new Array('1700','15000','50000','0');
var Cost_63_964_24_24 = new Array('1700','15000','50000','0');
var Cost_63_965_1_1 = new Array('3400','30000','90000','0');
var Cost_63_965_2_2 = new Array('3400','30000','90000','0');
var Cost_63_965_3_3 = new Array('3400','30000','90000','0');
var Cost_63_965_4_4 = new Array('3400','30000','90000','0');
var Cost_63_965_5_5 = new Array('3400','30000','90000','0');
var Cost_63_965_6_6 = new Array('3400','30000','90000','0');
var Cost_63_965_7_7 = new Array('3400','30000','90000','0');
var Cost_63_965_18_18 = new Array('3400','30000','90000','0');
var Cost_63_965_19_19 = new Array('3400','30000','90000','0');
var Cost_63_965_20_20 = new Array('3400','30000','90000','0');
var Cost_63_965_21_21 = new Array('3400','30000','90000','0');
var Cost_63_965_22_22 = new Array('3400','30000','90000','0');
var Cost_63_965_23_23 = new Array('3400','30000','90000','0');
var Cost_63_965_24_24 = new Array('3400','30000','90000','0');
var Quantity_63_count = 3;
var Quantity_63 = new Array('1','10','50');
var Kind_63_count = 8;
var Kind_63 = new Array('16절단면4도','16절양면8도','A4단면4도','A4양면8도','8절단면4도','8절양면8도','A3단면4도','A3양면8도');
var Kind_63_Code = new Array('958','959','960','961','962','963','964','965');
var Cost_64_966 = new Array('0');
var Quantity_64_count = 1;
var Quantity_64 = new Array('1');
var Kind_64_count = 1;
var Kind_64 = new Array('기타인쇄물');
var Kind_64_Code = new Array('966');
var Cost_65_967 = new Array('0');
var Quantity_65_count = 1;
var Quantity_65 = new Array('1');
var Kind_65_count = 1;
var Kind_65 = new Array('FTP접수');
var Kind_65_Code = new Array('967');
var Cost_66_968 = new Array('3000');
var Cost_66_969 = new Array('4000');
var Cost_66_970 = new Array('0');
var Cost_66_971 = new Array('0');
var Cost_66_972 = new Array('30000');
var Quantity_66_count = 1;
var Quantity_66 = new Array('1');
var Kind_66_count = 5;
var Kind_66 = new Array('명함/스티커운송비','전단운송비','봉투운송비','기타운송비','월배송비');
var Kind_66_Code = new Array('968','969','970','971','972');
var Cost_67_973 = new Array('0');
var Quantity_67_count = 1;
var Quantity_67 = new Array('1');
var Kind_67_count = 1;
var Kind_67 = new Array('부가세');
var Kind_67_Code = new Array('973');
var Cost_68_974 = new Array('0');
var Quantity_68_count = 1;
var Quantity_68 = new Array('1');
var Kind_68_count = 1;
var Kind_68 = new Array('차감액');
var Kind_68_Code = new Array('974');
var Cost_69_980 = new Array('10000','20000','30000','40000','50000','60000','70000','80000','90000','100000','200000','300000','400000','500000','600000','700000','800000','900000','1000000','2000000','3000000','4000000','5000000','6000000','7000000','8000000','9000000','10000000');
var Cost_69_981 = new Array('100','200','300','400','500','600','700','800','900','1000','2000','3000','4000','5000','6000','7000','8000','9000','10000','20000','30000','40000','50000','60000','70000','80000','90000','100000');
var Cost_69_982 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_69_983 = new Array('10000','20000','30000','40000','50000','60000','70000','80000','90000','100000','200000','300000','400000','500000','600000','700000','800000','900000','1000000','2000000','3000000','4000000','5000000','6000000','7000000','8000000','9000000','10000000');
var Cost_69_1116 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Quantity_69_count = 28;
var Quantity_69 = new Array('1','2','3','4','5','6','7','8','9','10','20','30','40','50','60','70','80','90','100','200','300','400','500','600','700','800','900','1000');
var Kind_69_count = 5;
var Kind_69 = new Array('CD(이미지책자)','아크릴명함케이스','종이명함각(100개)','메뉴판끈(5000개)','자동스탬프');
var Kind_69_Code = new Array('980','981','982','983','1116');
var Cost_70_1117 = new Array('9500','14500','19500','24500','29500','35500','39000','44500','50000','52500');
var Cost_70_1118 = new Array('9500','14500','19500','24500','29500','35500','39000','44500','50000','52500');
var Cost_70_1119 = new Array('9500','17000','22000','28000','33000','40000','43000','49500','56000','58000');
var Cost_70_1120 = new Array('10000','17500','25000','32000','38000','43000','48000','53000','58000','62000');
var Cost_70_1121 = new Array('10000','17500','25000','32000','38000','43000','48000','53000','58000','62000');
var Cost_70_1122 = new Array('9500','17500','25000','32000','38000','43000','48000','53000','58000','62000');
var Cost_70_1123 = new Array('10000','17500','25000','32000','38000','43000','48000','53000','58000','62000');
var Cost_70_1124 = new Array('10000','17500','25000','32000','38000','43000','48000','53000','58000','62000');
var Cost_70_1125 = new Array('10500','17500','25000','32000','38000','43000','48000','53000','58000','62000');
var Cost_70_1126 = new Array('10500','17500','25000','32000','38000','43000','48000','53000','58000','62000');
var Quantity_70_count = 10;
var Quantity_70 = new Array('1000','2000','3000','4000','5000','6000','7000','8000','9000','10000');
var Kind_70_count = 10;
var Kind_70 = new Array('Fm01(50x17)','Fm02(55x15)','Fm03(55x20)','Fm04(55x25)','Fm05(50x28)','Fm06(50x17)','Fm07(55x20,55x25)','Fm07(55x20,55x25)','Fm08(55x28)','Fm09(60x40)');
var Kind_70_Code = new Array('1117','1118','1119','1120','1121','1122','1123','1124','1125','1126');
var Cost_71_1127 = new Array('9500','17500','26500','34000','40500','45000','53000','59500','67000','70500');
var Cost_71_1128 = new Array('9500','17500','26500','34000','40500','45000','53000','59500','67000','70500');
var Cost_71_1129 = new Array('13500','25000','33000','43500','51000','59000','68500','78000','87500','94000');
var Cost_71_1130 = new Array('13500','25000','33000','43500','51000','59000','68500','78000','87500','94000');
var Cost_71_1131 = new Array('9500','17500','26500','34000','40500','45000','53000','60000','67000','70500');
var Cost_71_1132 = new Array('11500','20500','29500','38500','45000','52500','60500','69000','77000','83000');
var Cost_71_1133 = new Array('10500','18700','27000','35000','41000','47500','55000','62500','70000','75500');
var Cost_71_1134 = new Array('13000','24500','35500','47000','54500','63000','73500','84000','94000','101000');
var Cost_71_1135 = new Array('9500','17500','26500','34000','40500','45000','53000','59000','67000','70500');
var Cost_71_1136 = new Array('12500','23500','34000','41500','48500','56000','65000','74000','83000','89500');
var Quantity_71_count = 10;
var Quantity_71 = new Array('1000','2000','3000','4000','5000','6000','7000','8000','9000','10000');
var Kind_71_count = 10;
var Kind_71 = new Array('C-01(60x30)','C-01(60x15)','C-02(75x35)','C-02(75x20)','C-03(67x44)','C-04(84x46)','C-05(85x40)','C-06(90x55)','C-07(80x35)','C-08(85x50)');
var Kind_71_Code = new Array('1127','1128','1129','1130','1131','1132','1133','1134','1135','1136');
var Cost_72_1137 = new Array('9500','15500','21000','26500','31500','38000','41000','47000','54000','56000');
var Cost_72_1138 = new Array('11000','16500','22000','27500','33000','40000','43000','49000','55500','58000');
var Cost_72_1139 = new Array('9500','16500','22500','28000','34000','42000','45000','51000','58000','60000');
var Cost_72_1140 = new Array('11500','17500','23500','29500','35500','42500','46500','53000','60000','62500');
var Cost_72_1141 = new Array('11000','19000','26500','34000','40500','45000','53000','59500','67000','70500');
var Cost_72_1142 = new Array('14000','23000','30000','34500','42000','48500','56000','64000','71500','77000');
var Cost_72_1143 = new Array('9500','16500','22500','28000','34000','40000','45000','51000','58000','61000');
var Cost_72_1144 = new Array('11500','17500','23500','29500','35500','42500','46500','53000','60000','62500');
var Cost_72_1145 = new Array('13000','20000','27000','34000','40500','45000','53000','59500','67000','70500');
var Cost_72_1146 = new Array('12000','19000','26500','34000','40500','45000','53000','59500','67000','70500');
var Cost_72_1147 = new Array('12000','21000','29000','34000','40500','45000','53000','59500','67000','70500');
var Cost_72_1148 = new Array('11000','16500','22500','27500','33000','40000','43000','49000','55000','58000');
var Cost_72_1149 = new Array('11000','16500','22000','27500','33000','39500','43000','49000','55000','58000');
var Cost_72_1150 = new Array('11500','17500','23500','29500','35500','43000','46500','53000','60000','62500');
var Cost_72_1151 = new Array('12500','19500','26500','33500','40500','45000','53000','59500','67000','70500');
var Cost_72_1152 = new Array('14000','23000','31000','35000','41000','47500','55000','62500','70000','75500');
var Cost_72_1153 = new Array('10000','15000','20000','25000','30000','36000','40000','45000','51000','53000');
var Cost_72_1154 = new Array('11000','16500','22000','28000','33000','40000','43500','49500','56000','58500');
var Cost_72_1155 = new Array('12500','19500','26500','33500','40500','45000','53000','59500','67000','70500');
var Cost_72_1156 = new Array('13000','21000','28000','35000','42500','49000','57000','65000','72500','78000');
var Cost_72_1157 = new Array('14000','23000','31500','41000','48000','55500','64500','73500','82500','88500');
var Cost_72_1158 = new Array('15000','27000','35000','46000','54000','62500','72500','82500','93000','100000');
var Cost_72_1159 = new Array('16000','29000','39000','51500','60500','70000','81500','92500','104000','111500');
var Cost_72_1160 = new Array('19000','34000','43500','57500','67500','78000','90500','103000','116000','124500');
var Cost_72_1161 = new Array('21000','38000','48000','63500','74500','86500','100500','114500','128500','138000');
var Cost_72_1162 = new Array('55000','100000','140000','170000','205000','231000','275000','307500','346000','387000');
var Cost_72_1163 = new Array('27500','46500','65000','86000','101000','117000','136000','155500','175000','200000');
var Cost_72_1164 = new Array('53000','95000','112000','149000','180000','202500','236000','239500','303000','340000');
var Cost_72_1165 = new Array('26000','43500','61000','78500','95000','115000','127000','145000','163000','180000');
var Cost_72_1166 = new Array('47000','85000','105000','129500','155000','175500','204500','233500','262500','295000');
var Cost_72_1167 = new Array('24500','41000','57500','74000','90000','104500','121500','138500','155500','167000');
var Cost_72_1168 = new Array('32000','56000','80000','104000','128000','150500','172000','197000','221000','250000');
var Cost_72_1169 = new Array('23000','38500','54000','69500','82000','95000','110500','126000','141500','152000');
var Cost_72_1170 = new Array('29000','49500','70000','90500','111000','127500','147500','170000','191000','217000');
var Quantity_72_count = 10;
var Quantity_72 = new Array('1000','2000','3000','4000','5000','6000','7000','8000','9000','10000');
var Kind_72_count = 34;
var Kind_72 = new Array('R-01(10x10)','R-02(10x10)','R-03(11x11)','R-04(11x11)','R-05(13x13)','R-06(13x13)','R-07(15x15)','R-08(15x15)','R-09(15x15)','R-10(20x20)','R-11(20x20)','R-12(25x25)','R-13(30x30)','R-14(35x35)','R-15(38x38)','R-16(40x40)','R-17(45x45)','R-18(50x50)','R-19(55x55)','R-20(60x60)','R-21(65x65)','R-22(70x70)','R-23(75x75)','R-24(80x80)','R-25(85x85)','R-26(150x150)','R-27(105x105)','R-28(140x140)','R-29(100x100)','R-30(130x130)','R-31(95x95)','R-32(120x120)','R-33(90x90)','R-34(110x110)');
var Kind_72_Code = new Array('1137','1138','1139','1140','1141','1142','1143','1144','1145','1146','1147','1148','1149','1150','1151','1152','1153','1154','1155','1156','1157','1158','1159','1160','1161','1162','1163','1164','1165','1166','1167','1168','1169','1170');
var Cost_73_1171 = new Array('9500','17500','26500','34000','40500','45000','53000','59000','67000','70500');
var Cost_73_1172 = new Array('13000','24000','29000','34000','40500','46000','53000','60500','67500','73000');
var Cost_73_1173 = new Array('9500','17500','26500','34000','40500','45000','53000','59000','67000','70500');
var Cost_73_1174 = new Array('9500','17500','26500','34000','40500','45000','53000','59000','67000','70500');
var Cost_73_1175 = new Array('9500','17500','26500','34000','40500','45000','53000','59000','67000','70500');
var Cost_73_1176 = new Array('9500','17500','26500','34000','40500','45000','53000','59000','67000','70500');
var Cost_73_1177 = new Array('9500','17500','26500','34000','40500','45000','53000','59000','67000','70500');
var Cost_73_1178 = new Array('11000','19000','26500','34000','40500','45000','53000','59000','67000','70500');
var Cost_73_1179 = new Array('11000','19000','26500','34000','40500','45000','53000','59000','67000','70500');
var Cost_73_1180 = new Array('12000','21000','26500','34000','40500','45000','53000','59000','67000','70500');
var Cost_73_1181 = new Array('12000','21000','26500','34000','40500','45000','53000','59000','67000','70500');
var Cost_73_1182 = new Array('12000','21000','26500','34500','40500','47000','54500','62000','69500','75000');
var Cost_73_1183 = new Array('12500','23000','30000','39500','49000','53500','62000','70500','79000','85000');
var Cost_73_1184 = new Array('12500','23500','34000','44500','52000','60500','70000','80000','89500','96500');
var Cost_73_1185 = new Array('13000','24500','35500','46500','54500','63500','73500','83500','94000','101000');
var Cost_73_1186 = new Array('13500','26000','38000','50000','58500','68000','79000','89500','100500','108000');
var Cost_73_1187 = new Array('15500','29500','43000','56500','66500','77000','89500','102000','114500','123000');
var Cost_73_1188 = new Array('15500','29000','42500','56000','65500','75500','88000','100500','112500','121000');
var Cost_73_1189 = new Array('20000','36000','47500','63000','73500','85500','99000','113000','127000','136500');
var Cost_73_1190 = new Array('17000','29000','37000','49000','59000','66500','77500','88000','99000','117000');
var Cost_73_1191 = new Array('19000','33000','42500','56500','66000','76500','89000','101500','114000','133000');
var Cost_73_1192 = new Array('30000','55500','82500','110000','130000','148500','173000','197500','222000','250000');
var Cost_73_1193 = new Array('31000','55000','57000','76000','91000','102500','119500','136500','153500','176000');
var Cost_73_1194 = new Array('33000','58000','82500','109500','130000','148500','173000','197500','222000','250000');
var Quantity_73_count = 10;
var Quantity_73 = new Array('1000','2000','3000','4000','5000','6000','7000','8000','9000','10000');
var Kind_73_count = 24;
var Kind_73 = new Array('RA-01(50x20)','RA-02(45x35)','RA-03(55x25)','RA-04(50x35)','RA-05(55x35)','RA-06(50x40)','RA-07(60x30)','RA-08(60x40)','RA-09(65x35)','RA-10(65x45)','RA-11(70x40)','RA-12(75x45)','RA-13(80x50)','RA-14(85x55)','RA-15(90x55)','RA-16(90x60)','RA-17(90x70)','RA-18(95x65)','RA-19(95x75)','RA-20(100x60)','RA-21(100x70)','RA-22(135x105)','RA-23(120x80)','RA-24(135x115)');
var Kind_73_Code = new Array('1171','1172','1173','1174','1175','1176','1177','1178','1179','1180','1181','1182','1183','1184','1185','1186','1187','1188','1189','1190','1191','1192','1193','1194');
var Cost_74_1195 = new Array('23000','40000','51000','60500','70500','82000','95500','108500','122000','131000');
var Cost_74_1196 = new Array('15000','27000','34000','40000','47000','54500','63000','71500','80500','86500');
var Cost_74_1197 = new Array('13000','20000','28000','34000','40500','45000','53000','59500','67000','70500');
var Cost_74_1198 = new Array('17000','28000','33000','36500','42500','49500','57500','65000','73000','78500');
var Cost_74_1199 = new Array('23000','38000','46000','53500','63000','73000','84500','96500','108000','116000');
var Cost_74_1200 = new Array('15000','27000','32000','36000','42000','49000','56500','64500','72000','77500');
var Cost_74_1201 = new Array('17000','30000','34000','37500','44000','51000','59000','67000','75000','81000');
var Cost_74_1202 = new Array('17000','28000','37000','44000','51500','59500','69000','79000','88500','95000');
var Cost_74_1203 = new Array('15000','24000','30000','34000','40500','46000','53500','61000','68000','73000');
var Cost_74_1204 = new Array('15000','24000','30000','34000','40500','45000','53000','59500','67000','70500');
var Cost_74_1205 = new Array('14000','23000','29000','34000','40500','45000','53000','59500','67000','70500');
var Quantity_74_count = 10;
var Quantity_74 = new Array('1000','2000','3000','4000','5000','6000','7000','8000','9000','10000');
var Kind_74_count = 11;
var Kind_74 = new Array('보통01(85x80)','보통02(65x63)','보통03(35x35)','보통04(13x13)','뚱뚱01(92x64)','뚱뚱02(71x50)','뚱뚱03(50x35)','날씬01(65x71)','날씬02(55x60)','날씬03(35x40)','날씬04(13x13)');
var Kind_74_Code = new Array('1195','1196','1197','1198','1199','1200','1201','1202','1203','1204','1205');
var Cost_75_1206 = new Array('9500','17500','26500','34000','40500','45000','53000','59500','67000','70500');
var Cost_75_1207 = new Array('9500','17500','29000','34000','40500','45000','53000','59500','67000','70500');
var Cost_75_1208 = new Array('10000','18000','26500','34000','40500','45000','53000','59500','67000','70500');
var Cost_75_1209 = new Array('9500','17500','26500','34000','40500','45000','53000','59500','67000','70500');
var Cost_75_1210 = new Array('9500','18000','26500','34000','40500','45000','53000','59500','67000','70500');
var Cost_75_1211 = new Array('10000','20000','26500','34000','40500','45000','53000','59500','67000','70500');
var Cost_75_1212 = new Array('9500','17500','26500','34000','40500','45000','53000','59500','67000','70500');
var Cost_75_1213 = new Array('10000','18000','26500','34000','40500','45000','53000','59500','67000','70500');
var Cost_75_1214 = new Array('11000','20000','26500','34000','40500','45500','53000','60000','67000','72000');
var Cost_75_1215 = new Array('10000','18000','26500','34000','40500','45000','53000','59500','67000','70500');
var Cost_75_1216 = new Array('11000','20000','26500','34000','40500','45000','53000','59500','67000','70500');
var Cost_75_1217 = new Array('13500','24000','32000','38000','42500','49500','57500','65000','73000','78500');
var Cost_75_1218 = new Array('10000','18000','26500','34000','40500','45000','53000','59500','67000','70500');
var Cost_75_1219 = new Array('11000','20000','26500','34000','40500','45000','53000','59500','67000','70500');
var Cost_75_1220 = new Array('12000','22000','28000','36500','46500','49000','57000','65000','72500','78000');
var Cost_75_1221 = new Array('11000','20000','26500','34000','40500','45500','53000','60000','67500','72500');
var Cost_75_1222 = new Array('12000','22000','27500','36000','42500','49000','56500','64500','72500','78000');
var Cost_75_1223 = new Array('14500','26500','35000','42000','48000','55500','64500','73500','82500','88500');
var Cost_75_1224 = new Array('16000','28000','39000','48000','54000','62500','72500','82500','92500','99500');
var Cost_75_1225 = new Array('16000','28000','41000','51000','60000','69000','80000','91500','102500','110000');
var Cost_75_1226 = new Array('23000','40000','50000','60000','68000','74500','87000','99500','111500','131000');
var Cost_75_1227 = new Array('28000','48000','58000','69000','79000','88000','102500','117000','131500','153000');
var Cost_75_1228 = new Array('31000','54000','70000','80000','90000','101500','118500','135000','152000','175000');
var Cost_75_1229 = new Array('15000','24000','31000','37500','44000','51000','59000','67000','75000','81000');
var Cost_75_1230 = new Array('16000','26500','35000','40500','47500','54500','63500','72000','81000','87000');
var Cost_75_1231 = new Array('16500','28000','38000','46000','54000','62500','72500','82500','92500','99500');
var Cost_75_1232 = new Array('19000','34000','44000','51500','60500','70000','81500','92500','104000','111500');
var Cost_75_1233 = new Array('19000','32000','45000','57000','67000','77500','90000','103000','115500','124000');
var Cost_75_1234 = new Array('27000','46000','56000','63000','73500','85500','99500','113500','127500','136500');
var Cost_75_1235 = new Array('31000','54000','65000','74500','87000','100500','117000','134000','150500','161000');
var Cost_75_1236 = new Array('35000','62000','75000','85500','100000','116000','135000','154000','173500','186000');
var Cost_75_1237 = new Array('13000','22000','32000','41500','48500','56000','65000','74000','83000','89500');
var Cost_75_1238 = new Array('14000','24000','36000','44500','52000','60500','70000','80000','89500','96500');
var Cost_75_1239 = new Array('17000','28000','43000','51000','59500','69000','80000','91000','102500','110000');
var Cost_75_1240 = new Array('18000','32000','43500','57000','67000','77500','90000','103000','115500','124000');
var Cost_75_1241 = new Array('21000','36000','48000','63500','74500','86500','100500','114500','128500','138000');
var Cost_75_1242 = new Array('24000','42000','55000','70500','82500','96000','111500','127500','143000','153500');
var Cost_75_1243 = new Array('29000','49000','67000','83500','97500','113000','131500','150500','169000','181000');
var Cost_75_1244 = new Array('32000','56000','75000','96000','112500','130000','151500','173500','195000','209000');
var Cost_75_1245 = new Array('36000','64000','77000','86000','101000','117000','136000','155500','175000','187500');
var Cost_75_1246 = new Array('42000','74000','90000','101500','119000','138000','160500','183500','206500','221500');
var Cost_75_1247 = new Array('49000','86000','105000','117000','137000','159000','185500','211500','238000','255000');
var Cost_75_1248 = new Array('49000','87000','110000','120000','140500','163000','189500','216500','243500','261500');
var Cost_75_1249 = new Array('56000','99000','120000','138500','162000','187500','219000','250000','281000','301500');
var Cost_75_1250 = new Array('65000','116000','140000','159500','186500','216500','252500','288000','324000','347500');
var Quantity_75_count = 10;
var Quantity_75 = new Array('1000','2000','3000','4000','5000','6000','7000','8000','9000','10000');
var Kind_75_count = 45;
var Kind_75 = new Array('F3-01(30x60)','F3-02(30x70)','F3-03(30x80)','F3.5-01(35x60)','F3.5-02(35x70)','F3.5-03(35x80)','F4-01(40x60)','F4-02(40x70)','F4-03(40x80)','F4.5-01(45x60)','F4.5-02(45x70)','F4.5-03(45x80)','F5-01(50x50)','F5-02(50x60)','F6-01(60x60)','F7-01(65x50)','F7-02(65x55)','F7-03(65x65)','F7-04(75x65)','F7-05(85x65)','F7-06(105x65)','F7-07(125x65)','F7-08(145x65)','F8-01(75x50)','F8-02(75x55)','F8-03(75x65)','F8-04(75x75)','F8-05(75x85)','F8-06(105x75)','F8-07(125x75)','F8-08(145x75)','F9-01(85x50)','F9-02(85x55)','F9-03(85x65)','F9-04(85x75)','F9-05(85x85)','F9-06(105x85)','F9-07(125x85)','F9-08(145x85)','F방-01(105x105)','F방-02(105x125)','F방-03(105x145)','F방-04(125x125)','F방-05(125x145)','F방-06(145x145)');
var Kind_75_Code = new Array('1206','1207','1208','1209','1210','1211','1212','1213','1214','1215','1216','1217','1218','1219','1220','1221','1222','1223','1224','1225','1226','1227','1228','1229','1230','1231','1232','1233','1234','1235','1236','1237','1238','1239','1240','1241','1242','1243','1244','1245','1246','1247','1248','1249','1250');
var Cost_76_1251 = new Array('22000','39000','51000','63000','73500','85500','99000','113000','127000','138000');
var Cost_76_1252 = new Array('21000','32000','38000','43000','50500','58500','68000','77500','87000','104000');
var Cost_76_1253 = new Array('31000','56000','68000','83000','95000','106500','124000','141500','159000','183000');
var Cost_76_1254 = new Array('19000','34000','43000','50000','58500','68000','79000','90000','100500','108500');
var Cost_76_1255 = new Array('18000','32000','38000','43000','50500','58500','68000','77000','86500','93000');
var Cost_76_1256 = new Array('13500','24000','30000','35000','41000','47500','55000','62500','70000','75500');
var Cost_76_1257 = new Array('13500','24000','30000','35000','41000','47500','55000','62500','70000','75500');
var Cost_76_1258 = new Array('15500','27500','36000','41000','48000','55500','64500','73500','82500','88500');
var Cost_76_1259 = new Array('11000','20000','28000','34000','40500','45000','53000','59500','67000','70500');
var Cost_76_1260 = new Array('11000','20000','28000','34000','40500','45000','53000','59500','67000','70500');
var Cost_76_1261 = new Array('12000','22000','29000','34000','40500','45000','53000','59500','67000','70500');
var Cost_76_1262 = new Array('14500','26500','31000','34000','40500','46500','54000','61000','68500','73500');
var Cost_76_1263 = new Array('21000','37500','45000','52500','61500','71000','82500','94000','105500','113000');
var Cost_76_1264 = new Array('19000','34000','42000','48000','56500','65500','76000','86500','97000','104500');
var Cost_76_1265 = new Array('21000','37500','45000','53000','62500','72000','84000','95500','107500','115500');
var Cost_76_1266 = new Array('26000','46000','54000','64000','74000','82000','95500','109000','122500','142000');
var Cost_76_1267 = new Array('11000','20000','29000','34000','40500','45000','53000','59500','67000','71000');
var Cost_76_1268 = new Array('14500','26500','34000','39000','45500','52500','61000','69500','78000','83500');
var Cost_76_1269 = new Array('38000','67000','80000','96000','110000','124000','144000','164500','185000','212000');
var Cost_76_1270 = new Array('22000','40000','49000','60000','69000','76500','89000','101500','114000','134000');
var Cost_76_1271 = new Array('19000','35000','39000','41500','60000','70000','81000','92500','103500','111500');
var Cost_76_1272 = new Array('13500','24000','30000','34500','40500','47000','54500','62000','69500','75000');
var Cost_76_1273 = new Array('24500','44000','54000','63500','74500','86500','100500','114500','128500','138000');
var Cost_76_1274 = new Array('20000','27000','40000','52500','61500','71000','82500','94000','105500','113500');
var Cost_76_1275 = new Array('16000','26000','30000','34500','40500','47000','55000','62000','69500','75000');
var Cost_76_1276 = new Array('16000','28000','34000','38000','45000','52000','60000','68500','76500','82500');
var Cost_76_1277 = new Array('31000','50000','60000','72000','84000','93000','108500','123500','139000','160000');
var Cost_76_1278 = new Array('21000','38000','49000','57500','67500','78000','90500','103000','116000','124500');
var Cost_76_1279 = new Array('19000','34000','43000','49000','57000','66000','77000','87500','98000','105500');
var Cost_76_1280 = new Array('28000','50000','57000','68000','78000','87000','101500','115500','130000','150000');
var Cost_76_1281 = new Array('22000','38000','47000','53000','65000','71500','83000','95000','106500','126000');
var Cost_76_1282 = new Array('51000','92000','110000','133000','149000','171000','199500','227500','260000','290000');
var Cost_76_1283 = new Array('33000','60000','78000','100000','114000','127000','148000','169000','190000','217000');
var Cost_76_1284 = new Array('26000','46000','59000','72000','85000','94500','110000','125500','141000','163000');
var Cost_76_1285 = new Array('19000','34000','42000','51000','60000','66500','77500','88000','99000','117000');
var Cost_76_1286 = new Array('32000','55000','72000','90000','103000','116000','135000','154000','173500','199000');
var Cost_76_1287 = new Array('26000','38000','60000','72500','87000','98000','114000','130000','146500','169000');
var Cost_76_1288 = new Array('18000','32000','44000','54000','63500','73000','85500','97000','109000','117000');
var Cost_76_1289 = new Array('22000','38000','48000','60000','70000','76500','89000','101500','114000','134000');
var Cost_76_1290 = new Array('15000','27000','34000','41500','48500','56000','65000','74000','83000','89500');
var Cost_76_1291 = new Array('9500','17500','26500','34000','40500','45000','53000','59500','67000','70500');
var Cost_76_1292 = new Array('11000','20000','28000','34000','40500','45000','53000','59500','67000','70500');
var Cost_76_1293 = new Array('10000','17500','26500','34000','40500','45000','53000','59500','67000','70500');
var Cost_76_1294 = new Array('14000','24000','29000','34000','40500','45500','53000','59500','67000','72000');
var Cost_76_1295 = new Array('26000','46000','57000','66500','78000','90500','105500','120000','135000','145000');
var Cost_76_1296 = new Array('23000','40000','51000','60000','70500','81500','95000','108000','121000','130000');
var Cost_76_1297 = new Array('23000','40000','47000','56000','64000','69500','81000','92500','103500','123000');
var Cost_76_1298 = new Array('22000','38000','45000','55000','64000','69500','81000','92500','103500','123000');
var Cost_76_1299 = new Array('22000','38000','45000','55000','64000','69500','81000','92500','103500','123000');
var Cost_76_1300 = new Array('23000','40000','51000','60000','70500','81500','95000','108000','121000','130000');
var Cost_76_1301 = new Array('12000','22000','35000','34000','40500','45000','53000','59500','67000','70500');
var Cost_76_1302 = new Array('18000','32000','45000','49000','52000','55000','64000','73000','82000','98000');
var Quantity_76_count = 10;
var Quantity_76 = new Array('1000','2000','3000','4000','5000','6000','7000','8000','9000','10000');
var Kind_76_count = 52;
var Kind_76 = new Array('Q-01(75x95)','Q-03(100x52)','Q-04(105x95)','Q-05(90x60)','Q-06(67x67)','Q-07(37x43)','Q-08(55x30)','Q-09(65x65)','Q-10(53x47)','Q-11(53x51)','Q-12(80x35)','Q-13(25x10)','Q-14(95x60)','Q-15(82x63)','Q-16(80x73)','Q-17(127x27)','Q-18(70x20)','Q-19(70x56)','Q-20(130x90)','Q-21(100x70)','Q-22(80x70)','Q-23(45x35)','Q-24(40x25)','Q-25(60x15)','Q-26(20x15)','Q-27(40x20)','Q-29(35x35)','Q-30(80x80)','Q-31(95x55)','Q-32(97x83)','Q-33(148x19)','Q-34(148x18)','Q-35(40x30)','Q-36(35x25)','Q-37(30x20)','Q-38(95x55)','Q-39(50x87)','Q-40(70x40)','Q-41(30x70)','Q-42(50x40)','Q-43(45x17)','Q-44(45x17)','Q-45(57x17)','Q-46(57x17)','Q-47(40x90)','Q-48(35x90)','Q-49(50x60)','Q-50(50x60)','Q-51(50x60)','Q-52(35x90)','Q-53(30x20)','Q-54(40x120)');
var Kind_76_Code = new Array('1251','1252','1253','1254','1255','1256','1257','1258','1259','1260','1261','1262','1263','1264','1265','1266','1267','1268','1269','1270','1271','1272','1273','1274','1275','1276','1277','1278','1279','1280','1281','1282','1283','1284','1285','1286','1287','1288','1289','1290','1291','1292','1293','1294','1295','1296','1297','1298','1299','1300','1301','1302');
var Cost_77_1303 = new Array('9500','17500','26500','34000','40500','45000','53000','59500','67000','70500');
var Cost_77_1304 = new Array('10000','18000','26500','34000','40500','45000','53000','59500','67000','70500');
var Cost_77_1305 = new Array('15500','28000','32000','35000','41000','47500','55000','62500','70000','75500');
var Cost_77_1306 = new Array('11000','20000','26500','34000','40500','45000','53000','59500','67000','70500');
var Cost_77_1307 = new Array('24000','42000','50000','60000','69000','85000','97000','110000','122000','134000');
var Cost_77_1308 = new Array('10000','18000','27000','34000','40500','45000','53000','59500','67000','70500');
var Cost_77_1309 = new Array('10000','17000','26500','34000','40500','45000','53000','59500','67000','70500');
var Cost_77_1310 = new Array('10000','18000','27000','34000','40500','45000','53000','59500','67000','70500');
var Cost_77_1311 = new Array('19000','34000','43000','50000','58500','68000','79000','89500','100500','108500');
var Cost_77_1312 = new Array('29000','52000','66000','77000','90000','104500','121500','138500','155500','167000');
var Cost_77_1313 = new Array('28000','50000','61500','73000','85000','110000','128000','140000','150000','163000');
var Quantity_77_count = 10;
var Quantity_77 = new Array('1000','2000','3000','4000','5000','6000','7000','8000','9000','10000');
var Kind_77_count = 11;
var Kind_77 = new Array('Y-11(30x30)','Y-12(33x30)','Y-13(40x40)','Y-14(40x25)','Y-15(100x70)','Y-16(25x35)','Y-17(80x25)','Y-18(55x35)','Y-19(90x60)','Y-20(95x95)','Y-21(110x80)');
var Kind_77_Code = new Array('1303','1304','1305','1306','1307','1308','1309','1310','1311','1312','1313');
var Cost_78_1314 = new Array('9500','17500','26500','34000','40500','45000','53000','59500','67000','70500');
var Cost_78_1315 = new Array('9500','17500','26500','34000','40500','45000','53000','59500','67000','70500');
var Cost_78_1316 = new Array('9500','17500','26500','34000','40500','45000','53000','59500','67000','70500');
var Cost_78_1317 = new Array('11000','21000','30000','39500','46500','53500','62000','70500','79000','85000');
var Cost_78_1318 = new Array('13000','24500','35500','46500','55000','57500','73500','83500','94000','101000');
var Cost_78_1319 = new Array('13500','26000','38000','50000','58500','68000','79000','90000','100500','108500');
var Cost_78_1320 = new Array('15500','29500','43000','57000','66500','77000','89500','102000','114500','123000');
var Cost_78_1321 = new Array('17500','33000','48000','63500','74500','86000','100000','114000','128000','137500');
var Cost_78_1322 = new Array('19000','36000','53000','70000','82000','95000','110500','126000','141500','152000');
var Cost_78_1323 = new Array('21500','39500','59000','78000','91000','105500','123000','140500','158000','169500');
var Cost_78_1324 = new Array('25000','46000','69000','91500','107000','124000','144500','165000','185000','198500');
var Cost_78_1325 = new Array('28500','53000','79000','105000','122500','142000','165500','189000','212500','228000');
var Quantity_78_count = 10;
var Quantity_78 = new Array('1000','2000','3000','4000','5000','6000','7000','8000','9000','10000');
var Kind_78_count = 12;
var Kind_78 = new Array('아름다운(53x32)','아름다운(55x45)','아름다운(60x40)','아름다운(80x50)','아름다운(90x55)','아름다운(90x60)','아름다운(90x70)','아름다운(90x80)','아름다운(90x90)','아름다운(90x110)','아름다운(90x130)','아름다운(90x150)');
var Kind_78_Code = new Array('1314','1315','1316','1317','1318','1319','1320','1321','1322','1323','1324','1325');
var Cost_79_1326 = new Array('15400','30000','44900','59900','70400','81900','95500','109200','122800','132000','145200','158400','171600','184800','198000','211200','224400','237600','250800','264000','330000','396000','462000','528000','594000','550000','1100000');
var Cost_79_1327 = new Array('19100','37100','55600','74100','87200','101300','118200','135100','152000','163400','179700','196100','212400','228700','245100','261400','277700','294100','310400','326700','408400','490100','571800','653400','735100','680700','1361300');
var Cost_79_1328 = new Array('20800','40400','60600','80800','95100','110500','128900','147400','165800','178200','196100','213900','231700','249500','267300','285200','303000','320800','338600','356400','445500','534600','623700','712800','801900','742500','1485000');
var Cost_79_1329 = new Array('24300','47200','70700','94300','110900','128900','150400','171900','193400','207900','228700','249500','270300','291100','311900','332700','353500','374300','395100','415800','519800','623700','727700','831600','935600','866300','1732500');
var Cost_79_1330 = new Array('27800','53900','80800','107800','126800','147400','171900','196500','221000','237600','261400','285200','308900','332700','356400','380200','404000','427700','451500','475200','594000','712800','831600','950400','1069200','990000','1980000');
var Cost_79_1331 = new Array('31200','60600','90900','121200','142600','165800','193400','221000','248600','267300','294100','320800','347500','374300','401000','427700','454500','481200','507900','534600','668300','801900','935600','1069200','1202900','1113800','2227500');
var Cost_79_1332 = new Array('34700','67400','101000','134700','158400','184200','214900','245600','276300','297000','326700','356400','386100','415800','445500','475200','504900','534600','564300','594000','742500','891000','1039500','1188000','1336500','1237500','2475000');
var Cost_79_1333 = new Array('38200','74100','111100','148200','174300','202600','236400','270100','303900','326700','359400','392100','424800','457400','490100','522800','555400','588100','620800','653400','816800','980100','1143500','1306800','1470200','1361300','2722500');
var Cost_79_1334 = new Array('41600','80800','121200','161600','190100','221000','257800','294700','331500','356400','392100','427700','463400','499000','534600','570300','605900','641600','677200','712800','891000','1069200','1247400','1425600','1603800','1485000','2970000');
var Cost_79_1335 = new Array('45100','87600','131300','175100','206000','239400','279300','319200','359100','386100','424800','463400','502000','540600','579200','617800','656400','695000','733600','772200','965300','1158300','1351400','1544400','1737500','1608800','3217500');
var Cost_79_1336 = new Array('48600','94300','141400','188500','221800','257800','300800','343800','386700','415800','457400','499000','540600','582200','623700','665300','706900','748500','790100','831600','1039500','1247400','1455300','1663200','1871100','1732500','3465000');
var Cost_79_1337 = new Array('52000','101000','151500','202000','237600','276300','322300','368300','414400','445500','490100','534600','579200','623700','668300','712800','757400','801900','846500','891000','1113800','1336500','1559300','1782000','2004800','1856300','3712500');
var Cost_79_1338 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_79_1339 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_79_1340 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Quantity_79_count = 27;
var Quantity_79 = new Array('1000','2000','3000','4000','5000','6000','7000','8000','9000','10000','11000','12000','13000','14000','15000','16000','17000','18000','19000','20000','25000','30000','35000','40000','45000','50000','100000');
var Kind_79_count = 15;
var Kind_79 = new Array('80x50','90x55','90x60','90x70','90x80','90x90','90x100','90x110','90x120','90x130','90x140','90x150','별사이즈','투터치','도무송');
var Kind_79_Code = new Array('1326','1327','1328','1329','1330','1331','1332','1333','1334','1335','1336','1337','1338','1339','1340');
var Cost_80_1341 = new Array('66000','132000','198000','264000','330000','396000','462000','528000','594000','660000');
var Cost_80_1342 = new Array('71500','143000','214500','286000','357500','429000','500500','572000','643500','715000');
var Cost_80_1343 = new Array('77000','154000','231000','308000','385000','462000','539000','616000','693000','770000');
var Cost_80_1344 = new Array('71500','143000','214500','286000','357500','429000','500500','572000','643500','715000');
var Cost_80_1345 = new Array('77000','154000','231000','308000','385000','462000','539000','616000','693000','770000');
var Cost_80_1346 = new Array('82500','165000','247500','330000','412500','495000','577500','660000','742500','825000');
var Cost_80_1347 = new Array('99000','198000','297000','396000','495000','594000','693000','792000','891000','990000');
var Cost_80_1348 = new Array('110000','220000','330000','440000','550000','660000','770000','880000','990000','1100000');
var Cost_80_1349 = new Array('115500','231000','346500','462000','577500','693000','808500','924000','1039500','1155000');
var Cost_80_1350 = new Array('1100','2200','3300','4400','5500','6600','7700','8800','9900','11000');
var Quantity_80_count = 10;
var Quantity_80 = new Array('10','20','30','40','50','60','70','80','90','100');
var Kind_80_count = 10;
var Kind_80 = new Array('200스노우-13매','200스노우-14매','200스노우-15매','250스노우-13매','250스노우-14매','250스노우-15매','누브지-13매','누브지-14매','누브지-15매','무지봉투(100모조)');
var Kind_80_Code = new Array('1341','1342','1343','1344','1345','1346','1347','1348','1349','1350');
var Cost_81_1020 = new Array('5000','10000','14000','19000','23000','27600','32200','36800','41400','46000','69000','92000','115000','230000','460000','690000','920000','1150000');
var Cost_81_1021 = new Array('6000','12000','17000','22000','28000','33600','39200','44800','50400','56000','84000','112000','135000','270000','540000','810000','1080000','1350000');
var Cost_81_1022 = new Array('6000','12000','17000','22000','28000','33600','39200','44800','50400','56000','84000','112000','135000','270000','540000','810000','1080000','1350000');
var Cost_81_1352 = new Array('5000','10000','14000','19000','23000','27600','32200','36800','41400','46000','69000','92000','115000','230000','460000','690000','920000','1150000');
var Cost_81_1353 = new Array('6000','12000','17000','22000','28000','33600','39200','44800','50400','56000','84000','112000','135000','270000','540000','810000','1080000','1350000');
var Cost_81_1354 = new Array('6000','12000','17000','22000','28000','33600','39200','44800','50400','56000','84000','112000','135000','270000','540000','810000','1080000','1350000');
var Cost_81_1355 = new Array('5000','10000','14000','19000','23000','27600','32200','36800','41400','46000','69000','92000','115000','230000','460000','690000','920000','1150000');
var Cost_81_1356 = new Array('6000','12000','17000','22000','28000','33600','39200','44800','50400','56000','84000','112000','135000','270000','540000','810000','1080000','1350000');
var Cost_81_1357 = new Array('6000','12000','17000','22000','28000','33600','39200','44800','50400','56000','84000','112000','135000','270000','540000','810000','1080000','1350000');
var Quantity_81_count = 18;
var Quantity_81 = new Array('200','400','600','800','1000','1200','1400','1600','1800','2000','3000','4000','5000','10000','20000','30000','40000','50000');
var Kind_81_count = 9;
var Kind_81 = new Array('화인라레단면4도','화인라레양면5도','화인라레양면8도','화인누브단면4도','화인누브양면5도','화인누브양면8도','화인스노우단면4도','화인스노우양면5도','화인스노우양면8도');
var Kind_81_Code = new Array('1020','1021','1022','1352','1353','1354','1355','1356','1357');
var Cost_82_1373 = new Array('44000','77000','115500','154000','192500','231000','269500','308000','346500','385000','423500','462000','500500','539000','577500','616000','654500','693000','731500','770000');
var Cost_82_1374 = new Array('44000','77000','115500','154000','192500','231000','269500','308000','346500','385000','423500','462000','500500','539000','577500','616000','654500','693000','731500','770000');
var Cost_82_1375 = new Array('49500','88000','132000','176000','220000','264000','308000','352000','396000','440000','484000','528000','572000','616000','660000','704000','748000','792000','836000','880000');
var Cost_82_1376 = new Array('55000','99000','148500','198000','247500','297000','346500','396000','445500','495000','544500','594000','643500','693000','742500','792000','841500','891000','940500','990000');
var Cost_82_1377 = new Array('60500','110000','165000','220000','275000','330000','385000','440000','495000','550000','605000','660000','715000','770000','825000','880000','935000','990000','1045000','1100000');
var Cost_82_1378 = new Array('66000','121000','181500','242000','302500','363000','423500','484000','544500','605000','665500','726000','786500','847000','907500','968000','1028500','1089000','1149500','1210000');
var Cost_82_1379 = new Array('71500','132000','198000','264000','330000','396000','462000','528000','594000','660000','726000','792000','858000','924000','990000','1056000','1122000','1188000','1254000','1320000');
var Cost_82_1380 = new Array('77000','143000','214500','286000','357500','429000','500500','572000','643500','715000','786500','858000','929500','1001000','1072500','1144000','1215500','1287000','1358500','1430000');
var Cost_82_1381 = new Array('82500','154000','231000','308000','385000','462000','539000','616000','693000','770000','847000','924000','1001000','1078000','1155000','1232000','1309000','1386000','1463000','1540000');
var Cost_82_1382 = new Array('88000','165000','247500','330000','412500','495000','577500','660000','742500','825000','907500','990000','1072500','1155000','1237500','1320000','1402500','1485000','1567500','1650000');
var Cost_82_1383 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Quantity_82_count = 20;
var Quantity_82 = new Array('5000','10000','15000','20000','25000','30000','35000','40000','45000','50000','55000','60000','65000','70000','75000','80000','85000','90000','95000','100000');
var Kind_82_count = 11;
var Kind_82 = new Array('90x60','90x70','90x80','90x90','90x100','90x110','90x120','90x130','90x140','90x150','사각별사이즈');
var Kind_82_Code = new Array('1373','1374','1375','1376','1377','1378','1379','1380','1381','1382','1383');
var Cost_83_1384 = new Array('22000','44000','66000','88000','104500','125400','146300','167200','188100','209000');
var Cost_83_1385 = new Array('24200','48400','72600','96800','115500','138600','161700','184800','207900','231000');
var Cost_83_1386 = new Array('27500','55000','82500','110000','132000','158400','184800','211200','237600','264000');
var Cost_83_1387 = new Array('39600','79200','118800','158400','192500','231000','269500','308000','346500','385000');
var Cost_83_1388 = new Array('52800','105600','158400','211200','258500','310200','361900','413600','465300','517000');
var Cost_83_1389 = new Array('0','0','0','0','0','0','0','0','0','0');
var Quantity_83_count = 10;
var Quantity_83 = new Array('1000','2000','3000','4000','5000','6000','7000','8000','9000','10000');
var Kind_83_count = 6;
var Kind_83 = new Array('45Φ/38x55','50Φ/41x60','55Φ/44x65','65Φ/55x80','70Φ/65x90','별사이즈');
var Kind_83_Code = new Array('1384','1385','1386','1387','1388','1389');
var Cost_84_1390 = new Array('1000','2000','3000','4000','5000','6000','7000','8000','9000','10000','20000','30000','40000','50000','60000','70000','80000','90000','100000');
var Quantity_84_count = 19;
var Quantity_84 = new Array('100','200','300','400','500','600','700','800','900','1000','2000','3000','4000','5000','6000','7000','8000','9000','10000');
var Kind_84_count = 1;
var Kind_84 = new Array('사각89x50');
var Kind_84_Code = new Array('1390');
var Cost_85_1391 = new Array('1000','2000','3000','4000','5000','6000','7000','8000','9000','10000','20000','30000','40000','50000','60000','70000','80000','90000','100000');
var Quantity_85_count = 19;
var Quantity_85 = new Array('100','200','300','400','500','600','700','800','900','1000','2000','3000','4000','5000','6000','7000','8000','9000','10000');
var Kind_85_count = 1;
var Kind_85 = new Array('귀돌이88x52');
var Kind_85_Code = new Array('1391');
var Cost_86_1392 = new Array('0','0','0','0','0','0','0');
var Cost_86_1393 = new Array('0','0','0','0','0','0','0');
var Cost_86_1394 = new Array('0','0','0','0','0','0','0');
var Cost_86_1395 = new Array('0','0','0','0','0','0','0');
var Quantity_86_count = 7;
var Quantity_86 = new Array('1000','2000','3000','4000','5000','6000','10000');
var Kind_86_count = 4;
var Kind_86 = new Array('4절특대봉투','5절자켓대봉투','6절중봉투','9절중봉투');
var Kind_86_Code = new Array('1392','1393','1394','1395');
var Cost_87_1396 = new Array('0','0','0','0','0','0','0');
var Cost_87_1397 = new Array('0','0','0','0','0','0','0');
var Cost_87_1398 = new Array('0','0','0','0','0','0','0');
var Cost_87_1399 = new Array('0','0','0','0','0','0','0');
var Quantity_87_count = 7;
var Quantity_87 = new Array('1000','2000','3000','4000','5000','6000','10000');
var Kind_87_count = 4;
var Kind_87 = new Array('창문봉투','규격봉투','수강료봉투','부동산소봉투');
var Kind_87_Code = new Array('1396','1397','1398','1399');
var Cost_88_1400 = new Array('0','0','0','0','0','0','0');
var Cost_88_1401 = new Array('0','0','0','0','0','0','0');
var Cost_88_1402 = new Array('0','0','0','0','0','0','0');
var Cost_88_1403 = new Array('0','0','0','0','0','0','0');
var Cost_88_1404 = new Array('0','0','0','0','0','0','0');
var Quantity_88_count = 7;
var Quantity_88 = new Array('1000','2000','3000','4000','5000','6000','10000');
var Kind_88_count = 5;
var Kind_88 = new Array('카드봉투1','카드봉투2','카드봉투3','카드봉투4','카드봉투5');
var Kind_88_Code = new Array('1400','1401','1402','1403','1404');
var Cost_89_1405 = new Array('0','0','0','0','0','0','0');
var Quantity_89_count = 7;
var Quantity_89 = new Array('1000','2000','3000','4000','5000','6000','10000');
var Kind_89_count = 1;
var Kind_89 = new Array('티켓봉투');
var Kind_89_Code = new Array('1405');
var Cost_90_1406 = new Array('2500','20000','90000');
var Cost_90_1407 = new Array('5000','35000','130000');
var Cost_90_1406_25_25 = new Array('3000','24000','97000');
var Cost_90_1406_26_26 = new Array('3000','24000','97000');
var Cost_90_1406_29_29 = new Array('3000','24000','97000');
var Cost_90_1406_30_30 = new Array('3000','24000','97000');
var Cost_90_1406_31_31 = new Array('2500','20000','90000');
var Cost_90_1406_32_32 = new Array('2500','20000','90000');
var Cost_90_1406_33_33 = new Array('2500','20000','90000');
var Cost_90_1406_35_35 = new Array('3500','28000','110000');
var Cost_90_1406_38_38 = new Array('3500','28000','110000');
var Cost_90_1406_39_39 = new Array('3000','24000','97000');
var Cost_90_1406_135_135 = new Array('2500','20000','90000');
var Cost_90_1407_25_25 = new Array('6000','39000','140000');
var Cost_90_1407_26_26 = new Array('6000','39000','140000');
var Cost_90_1407_29_29 = new Array('6000','39000','140000');
var Cost_90_1407_30_30 = new Array('6000','39000','140000');
var Cost_90_1407_31_31 = new Array('5000','35000','130000');
var Cost_90_1407_32_32 = new Array('5000','35000','130000');
var Cost_90_1407_33_33 = new Array('5000','35000','130000');
var Cost_90_1407_35_35 = new Array('7000','42000','150000');
var Cost_90_1407_38_38 = new Array('7000','42000','150000');
var Cost_90_1407_39_39 = new Array('6000','39000','140000');
var Cost_90_1407_135_135 = new Array('5000','35000','130000');
var Quantity_90_count = 3;
var Quantity_90 = new Array('1','10','50');
var Kind_90_count = 2;
var Kind_90 = new Array('A3단면4도','A3양면8도');
var Kind_90_Code = new Array('1406','1407');
var Cost_91_1408 = new Array('38000','50000','80000','130000','160000','210000');
var Cost_91_1409 = new Array('75000','90000','120000','180000','210000','260000');
var Cost_91_1408_1_1 = new Array('38000','50000','80000','130000','160000','210000');
var Cost_91_1408_5_5 = new Array('38000','50000','80000','140000','170000','230000');
var Cost_91_1408_25_25 = new Array('60000','100000','160000','260000','350000','450000');
var Cost_91_1408_31_31 = new Array('38000','50000','80000','140000','170000','230000');
var Cost_91_1408_35_35 = new Array('60000','100000','160000','260000','350000','450000');
var Cost_91_1408_136_136 = new Array('38000','50000','80000','140000','170000','230000');
var Cost_91_1408_137_137 = new Array('50000','90000','150000','240000','320000','400000');
var Cost_91_1408_138_138 = new Array('60000','70000','110000','100000','160000','170000','270000','260000','350000','380000','480000','450000');
var Cost_91_1408_140_140 = new Array('80000','120000','190000','330000','480000','640000');
var Cost_91_1409_1_1 = new Array('75000','90000','120000','180000','210000','260000');
var Cost_91_1409_5_5 = new Array('75000','90000','120000','190000','220000','280000');
var Cost_91_1409_25_25 = new Array('97000','140000','210000','320000','410000','510000');
var Cost_91_1409_31_31 = new Array('75000','90000','120000','190000','220000','280000');
var Cost_91_1409_35_35 = new Array('97000','140000','210000','320000','410000','510000');
var Cost_91_1409_136_136 = new Array('75000','90000','120000','190000','220000','280000');
var Cost_91_1409_137_137 = new Array('87000','130000','200000','300000','380000','460000');
var Cost_91_1409_138_138 = new Array('97000','105000','150000','140000','210000','220000','330000','320000','410000','440000','540000','510000');
var Cost_91_1409_140_140 = new Array('115000','160000','240000','390000','540000','700000');
var Quantity_91_count = 6;
var Quantity_91 = new Array('25','50','100','200','300','500');
var Kind_91_count = 2;
var Kind_91 = new Array('A3단면4도','A3양면8도');
var Kind_91_Code = new Array('1408','1409');
var Cost_92_1410 = new Array('38000','50000','80000','130000','160000','210000');
var Cost_92_1411 = new Array('75000','90000','120000','180000','210000','260000');
var Cost_92_1410_1_1 = new Array('38000','50000','80000','130000','160000','210000');
var Cost_92_1410_5_5 = new Array('38000','50000','80000','140000','170000','230000');
var Cost_92_1410_25_25 = new Array('60000','100000','160000','260000','350000','450000');
var Cost_92_1410_31_31 = new Array('38000','50000','80000','140000','170000','230000');
var Cost_92_1410_35_35 = new Array('60000','100000','160000','260000','350000','450000');
var Cost_92_1410_136_136 = new Array('38000','50000','80000','140000','170000','230000');
var Cost_92_1410_137_137 = new Array('50000','90000','150000','240000','320000','400000');
var Cost_92_1410_138_138 = new Array('60000','70000','110000','100000','160000','170000','270000','260000','350000','380000','480000','450000');
var Cost_92_1410_140_140 = new Array('70000','110000','170000','270000','380000','480000');
var Cost_92_1411_1_1 = new Array('75000','90000','120000','180000','210000','260000');
var Cost_92_1411_5_5 = new Array('75000','90000','120000','190000','220000','280000');
var Cost_92_1411_25_25 = new Array('97000','140000','210000','320000','410000','510000');
var Cost_92_1411_31_31 = new Array('75000','90000','120000','190000','220000','280000');
var Cost_92_1411_35_35 = new Array('97000','140000','210000','320000','410000','510000');
var Cost_92_1411_136_136 = new Array('75000','90000','120000','190000','220000','280000');
var Cost_92_1411_137_137 = new Array('87000','130000','200000','300000','380000','460000');
var Cost_92_1411_138_138 = new Array('97000','105000','150000','140000','210000','220000','330000','320000','410000','440000','540000','510000');
var Cost_92_1411_140_140 = new Array('105000','150000','220000','330000','440000','540000');
var Quantity_92_count = 6;
var Quantity_92 = new Array('25','50','100','200','300','500');
var Kind_92_count = 2;
var Kind_92 = new Array('A3단면4도','A3양면8도');
var Kind_92_Code = new Array('1410','1411');
var Cost_93_1412 = new Array('0','0','0','0','0','53000','0','0','0','0','53000','0','0','0','0','53000','0','0','0','0','53000','53000','53000','53000','53000','53000','53000','53000','53000','53000','53000','53000','53000','53000','52000','52000');
var Cost_93_1413 = new Array('0','0','0','0','0','62000','0','0','0','0','62000','0','0','0','0','62000','0','0','0','0','62000','62000','62000','62000','62000','62000','62000','62000','62000','62000','62000','62000','62000','62000','61000','61000');
var Cost_93_1414 = new Array('0','0','0','0','0','53000','0','0','0','0','53000','0','0','0','0','53000','0','0','0','0','53000','53000','53000','53000','53000','53000','53000','53000','53000','53000','53000','53000','53000','53000','52000','52000');
var Cost_93_1415 = new Array('0','0','0','0','0','62000','0','0','0','0','62000','0','0','0','0','62000','0','0','0','0','62000','62000','62000','62000','62000','62000','62000','62000','62000','62000','62000','62000','62000','62000','61000','61000');
var Cost_93_1416 = new Array('0','0','0','0','0','53000','0','0','0','0','53000','0','0','0','0','53000','0','0','0','0','53000','53000','53000','53000','53000','53000','53000','53000','53000','53000','53000','53000','53000','53000','52000','52000');
var Cost_93_1417 = new Array('0','0','0','0','0','62000','0','0','0','0','62000','0','0','0','0','62000','0','0','0','0','62000','62000','62000','62000','62000','62000','62000','62000','62000','62000','62000','62000','62000','62000','61000','61000');
var Cost_93_1418 = new Array('0','0','0','0','0','53000','0','0','0','0','53000','0','0','0','0','53000','0','0','0','0','53000','53000','53000','53000','53000','53000','53000','53000','53000','53000','53000','53000','53000','53000','52000','52000');
var Cost_93_1419 = new Array('0','0','0','0','0','62000','0','0','0','0','62000','0','0','0','0','62000','0','0','0','0','62000','62000','62000','62000','62000','62000','62000','62000','62000','62000','62000','62000','62000','62000','61000','61000');
var Cost_93_1420 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_93_1421 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_93_1422 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_93_1423 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_93_1424 = new Array('0','0','0','0','0','42000','0','0','0','0','42000','0','0','0','0','42000','0','0','0','0','42000','42000','42000','42000','42000','42000','42000','42000','42000','42000','42000','42000','42000','42000','41000','41000');
var Cost_93_1425 = new Array('0','0','0','0','0','51000','0','0','0','0','51000','0','0','0','0','51000','0','0','0','0','51000','51000','51000','51000','51000','51000','51000','51000','51000','51000','51000','51000','51000','51000','50000','50000');
var Cost_93_1426 = new Array('0','0','0','0','0','42000','0','0','0','0','42000','0','0','0','0','42000','0','0','0','0','42000','42000','42000','42000','42000','42000','42000','42000','42000','42000','42000','42000','42000','42000','41000','41000');
var Cost_93_1427 = new Array('0','0','0','0','0','51000','0','0','0','0','51000','0','0','0','0','51000','0','0','0','0','51000','51000','51000','51000','51000','51000','51000','51000','51000','51000','51000','51000','51000','51000','50000','50000');
var Cost_93_1428 = new Array('0','0','0','0','0','42000','0','0','0','0','42000','0','0','0','0','42000','0','0','0','0','42000','42000','42000','42000','42000','42000','42000','42000','42000','42000','42000','42000','42000','42000','41000','41000');
var Cost_93_1429 = new Array('0','0','0','0','0','51000','0','0','0','0','51000','0','0','0','0','51000','0','0','0','0','51000','51000','51000','51000','51000','51000','51000','51000','51000','51000','51000','51000','51000','51000','50000','50000');
var Cost_93_1430 = new Array('0','0','0','0','0','42000','0','0','0','0','42000','0','0','0','0','42000','0','0','0','0','42000','42000','42000','42000','42000','42000','42000','42000','42000','42000','42000','42000','42000','42000','41000','41000');
var Cost_93_1431 = new Array('0','0','0','0','0','51000','0','0','0','0','51000','0','0','0','0','51000','0','0','0','0','51000','51000','51000','51000','51000','51000','51000','51000','51000','51000','51000','51000','51000','51000','50000','50000');
var Cost_93_1432 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_93_1433 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_93_1434 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_93_1435 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Quantity_93_count = 36;
var Quantity_93 = new Array('0.5','1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20','21','22','23','24','25','26','27','28','29','30','35','40','45','50','100');
var Kind_93_count = 24;
var Kind_93 = new Array('64절단면4도','64절양면8도','32절단면4도','32절양면8도','16절단면4도','16절양면8도','8절단면4도','8절양면8도','4절단면4도','4절양면8도','2절단면4도','2절양면8도','A6단면4도','A6양면8도','A5단면4도','A5양면8도','A4단면4도','A4양면8도','A3단면4도','A3양면8도','A2단면4도','A2양면8도','국전지단면4도','국전지양면8도');
var Kind_93_Code = new Array('1412','1413','1414','1415','1416','1417','1418','1419','1420','1421','1422','1423','1424','1425','1426','1427','1428','1429','1430','1431','1432','1433','1434','1435');
var Cost_94_1438 = new Array('6600','13200','19800','26400','30800','34400','40100','45800','51500','52800','58100','63400','68700','74000','79200','84500','89800','95100','100400','105600','110900','116200','121500','126800','132000','137300','142600','147900','153200','158400','163700','169000','174300','179600','184800','190100','195400','200700','206000','211200','216500','221800','227100','232400','237600','242900','248200','253500','258800','242000','246900','251700','256600','261400','266200','271100','275900','280800','285600','290400','295300','300100','305000','309800','314600','319500','324300','329200','334000','338800','343700','348500','353400','358200','363000','367900','372700','377600','382400','387200','392100','396900','401800','406600','411400','416300','421100','426000','430800','435600','440500','445300','450200','455000','459800','464700','469500','474400','479200','484000');
var Cost_94_1439 = new Array('8200','16400','24600','32700','38200','42500','49600','56700','63800','65400','71900','78500','85000','91500','98100','104600','111100','117700','124200','130700','137300','143800','150300','156900','163400','169900','176500','183000','189500','196100','202600','209100','215700','222200','228700','235300','241800','248300','254900','261400','267900','274500','281000','287500','294100','300600','307100','313700','320200','299500','305500','311500','317500','323500','329500','335500','341500','347400','353400','359400','365400','371400','377400','383400','389400','395400','401300','407300','413300','419300','425300','431300','437300','443300','449300','455300','461200','467200','473200','479200','485200','491200','497200','503200','509200','515100','521100','527100','533100','539100','545100','551100','557100','563100','569100','575000','581000','587000','593000','599000');
var Cost_94_1440 = new Array('8900','17800','26700','35600','41600','46400','54100','61800','69500','71300','78500','85600','92700','99800','107000','114100','121200','128400','135500','142600','149700','156900','164000','171100','178200','185400','192500','199600','206800','213900','221000','228100','235300','242400','249500','256700','263800','270900','278000','285200','292300','299400','306600','313700','320800','327900','335100','342200','349300','326700','333300','339800','346400','352900','359400','366000','372500','379000','385600','392100','398600','405200','411700','418200','424800','431300','437800','444400','450900','457400','464000','470500','477000','483600','490100','496600','503200','509700','516200','522800','529300','535800','542400','548900','555400','562000','568500','575000','581600','588100','594600','601200','607700','614200','620800','627300','633800','640400','646900','653400');
var Cost_94_1441 = new Array('10400','20800','31200','41600','48600','54100','63100','72100','81100','83200','91500','99800','108200','116500','124800','133100','141400','149700','158100','166400','174700','183000','191300','199600','207900','216300','224600','232900','241200','249500','257800','266200','274500','282800','291100','299400','307700','316100','324400','332700','341000','349300','357600','366000','374300','382600','390900','399200','407500','381200','388800','396400','404100','411700','419300','426900','434600','442200','449800','457400','465100','472700','480300','487900','495500','503200','510800','518400','526000','533700','541300','548900','556500','564200','571800','579400','587000','594600','602300','609900','617500','625100','632800','640400','648000','655600','663300','670900','678500','686100','693700','701400','709000','716600','724200','731900','739500','747100','754700','762300');
var Cost_94_1442 = new Array('11900','23800','35700','47600','55500','61800','72100','82400','92700','95100','104600','114100','123600','133100','142600','152100','161600','171100','180600','190100','199600','209100','218600','228100','237600','247200','256700','266200','275700','285200','294700','304200','313700','323200','332700','342200','351700','361200','370700','380200','389700','399200','408700','418200','427700','437200','446700','456200','465700','435600','444400','453100','461800','470500','479200','487900','496600','505300','514100','522800','531500','540200','548900','557600','566300','575000','583800','592500','601200','609900','618600','627300','636000','644700','653400','662200','670900','679600','688300','697000','705700','714400','723100','731900','740600','749300','758000','766700','775400','784100','792800','801600','810300','819000','827700','836400','845100','853800','862500','871200');
var Cost_94_1443 = new Array('13400','26800','40100','53500','62400','69500','81100','92700','104300','107000','117700','128400','139000','149700','160400','171100','181800','192500','203200','213900','224600','235300','246000','256700','267300','278000','288700','299400','310100','320800','331500','342200','352900','363600','374300','385000','395700','406300','417000','427700','438400','449100','459800','470500','481200','491900','502600','513300','524000','490100','499900','509700','519500','529300','539100','548900','558700','568500','578300','588100','597900','607700','617500','627300','637100','646900','656700','666500','676300','686100','695900','705700','715500','725300','735100','744900','754700','764500','774300','784100','793900','803700','813500','823300','833100','842900','852700','862500','872300','882100','891900','901700','911500','921300','931100','940900','950700','960500','970300','980100');
var Cost_94_1444 = new Array('14900','29700','44600','59400','69300','77300','90100','103000','115900','118800','130700','142600','154500','166400','178200','190100','202000','213900','225800','237600','249500','261400','273300','285200','297000','308900','320800','332700','344600','356400','368300','380200','392100','404000','415800','427700','439600','451500','463400','475200','487100','499000','510900','522800','534600','546500','558400','570300','582200','544500','555400','566300','577200','588100','599000','609900','620800','631700','642600','653400','664300','675200','686100','697000','707900','718800','729700','740600','751500','762300','773200','784100','795000','805900','816800','827700','838600','849500','860400','871200','882100','893000','903900','914800','925700','936600','947500','958400','969300','980100','991000','1001900','1012800','1023700','1034600','1045500','1056400','1067300','1078200','1089000');
var Cost_94_1445 = new Array('16400','32700','49100','65400','76300','85000','99100','113300','127500','130700','143800','156900','169900','183000','196100','209100','222200','235300','248300','261400','274500','287500','300600','313700','326700','339800','352900','366000','379000','392100','405200','418200','431300','444400','457400','470500','483600','496600','509700','522800','535800','548900','562000','575000','588100','601200','614200','627300','640400','599000','611000','623000','634900','646900','658900','670900','682900','694800','706800','718800','730800','742700','754700','766700','778700','790700','802600','814600','826600','838600','850600','862500','874500','886500','898500','910500','922400','934400','946400','958400','970300','982300','994300','1006300','1018300','1030200','1042200','1054200','1066200','1078200','1090100','1102100','1114100','1126100','1138100','1150000','1162000','1174000','1186000','1197900');
var Cost_94_1446 = new Array('17900','35700','53500','71300','83200','92700','108200','123600','139000','142600','156900','171100','185400','199600','213900','228100','242400','256700','270900','285200','299400','313700','327900','342200','356400','370700','385000','399200','413500','427700','442000','456200','470500','484800','499000','513300','527500','541800','556000','570300','584500','598800','613100','627300','641600','655800','670100','684300','698600','653400','666500','679600','692700','705700','718800','731900','744900','758000','771100','784100','797200','810300','823300','836400','849500','862500','875600','888700','901700','914800','927900','940900','954000','967100','980100','993200','1006300','1019400','1032400','1045500','1058600','1071600','1084700','1097800','1110800','1123900','1137000','1150000','1163100','1176200','1189200','1202300','1215400','1228400','1241500','1254600','1267600','1280700','1293800','1306800');
var Cost_94_1447 = new Array('19300','38700','58000','77300','90100','100400','117200','133900','150600','154500','169900','185400','200800','216300','231700','247200','262600','278000','293500','308900','324400','339800','355300','370700','386100','401600','417000','432500','447900','463400','478800','494300','509700','525100','540600','556000','571500','586900','602400','617800','633300','648700','664100','679600','695000','710500','725900','741400','756800','707900','722100','736200','750400','764500','778700','792800','807000','821200','835300','849500','863600','877800','891900','906100','920300','934400','948600','962700','976900','991000','1005200','1019400','1033500','1047700','1061800','1076000','1090100','1104300','1118500','1132600','1146800','1160900','1175100','1189200','1203400','1217600','1231700','1245900','1260000','1274200','1288300','1302500','1316700','1330800','1345000','1359100','1373300','1387400','1401600','1415700');
var Cost_94_1448 = new Array('20800','41600','62400','83200','97100','108200','126200','144200','162200','166400','183000','199600','216300','232900','249500','266200','282800','299400','316100','332700','349300','366000','382600','399200','415800','432500','449100','465700','482400','499000','515600','532300','548900','565500','582200','598800','615400','632100','648700','665300','682000','698600','715200','731900','748500','765100','781800','798400','815000','762300','777600','792800','808100','823300','838600','853800','869100','884300','899600','914800','930100','945300','960500','975800','991000','1006300','1021500','1036800','1052000','1067300','1082500','1097800','1113000','1128300','1143500','1158700','1174000','1189200','1204500','1219700','1235000','1250200','1265500','1280700','1296000','1311200','1326500','1341700','1356900','1372200','1387400','1402700','1417900','1433200','1448400','1463700','1478900','1494200','1509400','1524600');
var Cost_94_1449 = new Array('22300','44600','66900','89100','104000','115900','135200','154500','173800','178200','196100','213900','231700','249500','267300','285200','303000','320800','338600','356400','374300','392100','409900','427700','445500','463400','481200','499000','516800','534600','552500','570300','588100','605900','623700','641600','659400','677200','695000','712800','730700','748500','766300','784100','801900','819800','837600','855400','873200','816800','833100','849500','865800','882100','898500','914800','931100','947500','963800','980100','996500','1012800','1029200','1045500','1061800','1078200','1094500','1110800','1127200','1143500','1159800','1176200','1192500','1208800','1225200','1241500','1257800','1274200','1290500','1306800','1323200','1339500','1355900','1372200','1388500','1404900','1421200','1437500','1453900','1470200','1486500','1502900','1519200','1535500','1551900','1568200','1584500','1600900','1617200','1633500');
var Cost_94_1450 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_94_1451 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_94_1452 = new Array('0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Cost_94_1453 = new Array('6000','11000','17000','23000','29000','31000','36000','41000','48000','52000','58000','63000','69000','75000','81000','83000','88000','93000','100000','104000','110000','115000','121000','127000','133000','135000','140000','145000','152000','156000','162000','167000','173000','179000','185000','187000','192000','197000','204000','208000','214000','219000','225000','231000','237000','239000','244000','249000','256000','260000','266000','271000','277000','283000','289000','291000','296000','301000','308000','312000','318000','323000','329000','335000','341000','343000','348000','353000','360000','364000','370000','375000','381000','387000','393000','395000','400000','405000','412000','416000','422000','427000','433000','439000','445000','447000','452000','457000','464000','468000','474000','479000','485000','491000','497000','499000','504000','509000','516000','520000');
var Cost_94_1454 = new Array('6000','11000','17000','23000','29000','31000','36000','41000','48000','52000','58000','63000','69000','75000','81000','83000','88000','93000','100000','104000','110000','115000','121000','127000','133000','135000','140000','145000','152000','156000','162000','167000','173000','179000','185000','187000','192000','197000','204000','208000','214000','219000','225000','231000','237000','239000','244000','249000','256000','260000','266000','271000','277000','283000','289000','291000','296000','301000','308000','312000','318000','323000','329000','335000','341000','343000','348000','353000','360000','364000','370000','375000','381000','387000','393000','395000','400000','405000','412000','416000','422000','427000','433000','439000','445000','447000','452000','457000','464000','468000','474000','479000','485000','491000','497000','499000','504000','509000','516000','520000');
var Quantity_94_count = 100;
var Quantity_94 = new Array('1000','2000','3000','4000','5000','6000','7000','8000','9000','10000','11000','12000','13000','14000','15000','16000','17000','18000','19000','20000','21000','22000','23000','24000','25000','26000','27000','28000','29000','30000','31000','32000','33000','34000','35000','36000','37000','38000','39000','40000','41000','42000','43000','44000','45000','46000','47000','48000','49000','50000','51000','52000','53000','54000','55000','56000','57000','58000','59000','60000','61000','62000','63000','64000','65000','66000','67000','68000','69000','70000','71000','72000','73000','74000','75000','76000','77000','78000','79000','80000','81000','82000','83000','84000','85000','86000','87000','88000','89000','90000','91000','92000','93000','94000','95000','96000','97000','98000','99000','100000');
var Kind_94_count = 17;
var Kind_94 = new Array('80x50','90x55','90x60','90x70','90x80','90x90','90x100','90x110','90x120','90x130','90x140','90x150','별사이즈','투터치','도무송','60x40','70x40');
var Kind_94_Code = new Array('1438','1439','1440','1441','1442','1443','1444','1445','1446','1447','1448','1449','1450','1451','1452','1453','1454');
var Cost_95_1478 = new Array('59000','118000','171000','228000','275000','330000','385000','440000','495000','550000');
var Cost_95_1479 = new Array('68000','136000','198000','264000','320000','384000','448000','512000','576000','640000');
var Cost_95_1480 = new Array('41000','82000','117000','156000','190000','228000','266000','304000','342000','380000');
var Cost_95_1481 = new Array('50000','100000','144000','192000','235000','282000','329000','376000','423000','470000');
var Quantity_95_count = 10;
var Quantity_95 = new Array('1','2','3','4','5','6','7','8','9','10');
var Kind_95_count = 4;
var Kind_95 = new Array('16절-연단가/1도','16절-연단가/2도','A4-연단가/1도','A4-연단가/2도');
var Kind_95_Code = new Array('1478','1479','1480','1481');
var Cost_96_1482 = new Array('63000','126000','183000','244000','295000','354000','413000','472000','531000','590000');
var Cost_96_1483 = new Array('72000','144000','210000','280000','340000','408000','476000','544000','612000','680000');
var Cost_96_1484 = new Array('45000','90000','129000','172000','210000','252000','294000','336000','378000','420000');
var Cost_96_1485 = new Array('54000','108000','156000','208000','255000','306000','357000','408000','459000','510000');
var Quantity_96_count = 10;
var Quantity_96 = new Array('1','2','3','4','5','6','7','8','9','10');
var Kind_96_count = 4;
var Kind_96 = new Array('16절-연단가/1도','16절-연단가/2도','A4-연단가/1도','A4-연단가/2도');
var Kind_96_Code = new Array('1482','1483','1484','1485');
var Cost_97_1486 = new Array('71000','142000','207000','276000','335000','402000','469000','536000','603000','670000');
var Cost_97_1487 = new Array('80000','160000','234000','312000','380000','456000','532000','608000','684000','760000');
var Cost_97_1488 = new Array('53000','106000','153000','204000','250000','300000','350000','400000','450000','500000');
var Cost_97_1489 = new Array('62000','124000','180000','240000','295000','354000','413000','472000','531000','590000');
var Quantity_97_count = 10;
var Quantity_97 = new Array('1','2','3','4','5','6','7','8','9','10');
var Kind_97_count = 4;
var Kind_97 = new Array('16절-연단가/1도','16절-연단가/2도','A4-연단가/1도','A4-연단가/2도');
var Kind_97_Code = new Array('1486','1487','1488','1489');
var Cost_98_1490 = new Array('0','0','0','0','0','0','42000','0','0','0','0','71000','0','0','0','142000','0','0','0','0','284000');
var Cost_98_1491 = new Array('0','0','0','0','0','0','51000','0','0','0','0','80000','0','0','0','160000','0','0','0','0','320000');
var Cost_98_1492 = new Array('0','0','0','0','0','0','60000','0','0','0','0','89000','0','0','0','178000','0','0','0','0','356000');
var Cost_98_1493 = new Array('0','0','0','0','0','0','52000','0','0','0','0','86000','0','0','0','172000','0','0','0','0','344000');
var Cost_98_1494 = new Array('0','0','0','0','0','0','61000','0','0','0','0','95000','0','0','0','190000','0','0','0','0','380000');
var Cost_98_1495 = new Array('0','0','0','0','0','0','70000','0','0','0','0','104000','0','0','0','208000','0','0','0','0','416000');
var Cost_98_1496 = new Array('28000','38000','47000','54000','63000','75000','93000','110000','115000','120000','135000','145000','174000','202000','231000','289000','347000','404000','462000','520000','578000');
var Cost_98_1497 = new Array('37000','47000','56000','63000','72000','84000','102000','119000','124000','129000','149000','159000','188000','220000','249000','316000','374000','440000','498000','565000','623000');
var Cost_98_1498 = new Array('46000','56000','65000','72000','81000','93000','111000','128000','133000','138000','158000','168000','202000','238000','267000','334000','392000','458000','525000','592000','650000');
var Cost_98_1499 = new Array('31000','45000','57000','66000','76000','88000','110000','125000','146000','175000','195000','217000','260000','296000','330000','412000','483000','563000','643000','724000','784000');
var Cost_98_1500 = new Array('40000','54000','66000','75000','85000','97000','128000','143000','164000','193000','222000','244000','287000','332000','366000','457000','537000','626000','715000','805000','874000');
var Cost_98_1501 = new Array('49000','63000','75000','84000','94000','106000','137000','152000','173000','202000','240000','262000','305000','350000','384000','484000','564000','662000','751000','850000','919000');
var Quantity_98_count = 21;
var Quantity_98 = new Array('10','15','20','25','30','40','50','60','70','80','90','100','120','140','160','200','240','280','320','360','400');
var Kind_98_count = 12;
var Kind_98 = new Array('48절-1조2매-1도','48절-1조2매-2도','48절-1조2매-3도','A4-3등분-1조2매-1도','A4-3등분-1조2매-2도','A4-3등분-1조2매-3도','16절-1조2매-1도','16절-1조2매-2도','16절-1조2매-3도','A4-1조2매-1도','A4-1조2매-2도','A4-1조2매-3도');
var Kind_98_Code = new Array('1490','1491','1492','1493','1494','1495','1496','1497','1498','1499','1500','1501');
var Cost_99_1502 = new Array('0','0','0','0','0','0','56000','0','0','0','0','101000','0','0','0','202000','0','0','0','0','404000');
var Cost_99_1503 = new Array('0','0','0','0','0','0','65000','0','0','0','0','110000','0','0','0','220000','0','0','0','0','440000');
var Cost_99_1504 = new Array('0','0','0','0','0','0','74000','0','0','0','0','119000','0','0','0','238000','0','0','0','0','476000');
var Cost_99_1505 = new Array('0','0','0','0','0','0','83000','0','0','0','0','128000','0','0','0','256000','0','0','0','0','512000');
var Cost_99_1506 = new Array('0','0','0','0','0','0','71000','0','0','0','0','131000','0','0','0','262000','0','0','0','0','524000');
var Cost_99_1507 = new Array('0','0','0','0','0','0','80000','0','0','0','0','149000','0','0','0','298000','0','0','0','0','596000');
var Cost_99_1508 = new Array('0','0','0','0','0','0','89000','0','0','0','0','158000','0','0','0','316000','0','0','0','0','632000');
var Cost_99_1509 = new Array('0','0','0','0','0','0','98000','0','0','0','0','167000','0','0','0','334000','0','0','0','0','668000');
var Cost_99_1510 = new Array('39000','50000','63000','77000','90000','112000','136000','164000','191000','215000','242000','263000','316000','361000','412000','505000','594000','693000','775000','872000','948000');
var Cost_99_1511 = new Array('48000','59000','72000','86000','99000','121000','145000','182000','209000','233000','269000','290000','352000','406000','457000','559000','666000','783000','883000','998000','1083000');
var Cost_99_1512 = new Array('57000','68000','81000','95000','108000','130000','154000','191000','218000','242000','287000','308000','370000','424000','475000','586000','693000','819000','919000','1043000','1128000');
var Cost_99_1513 = new Array('66000','77000','90000','104000','117000','139000','163000','200000','227000','251000','305000','326000','388000','442000','493000','613000','720000','855000','955000','1088000','1173000');
var Cost_99_1514 = new Array('45000','62000','82000','99000','116000','151000','188000','223000','253000','285000','316000','351000','415000','484000','548000','680000','791000','928000','1055000','1187000','1319000');
var Cost_99_1515 = new Array('54000','71000','91000','108000','134000','169000','206000','250000','280000','312000','352000','387000','460000','538000','602000','752000','872000','1027000','1163000','1313000','1454000');
var Cost_99_1516 = new Array('63000','80000','100000','117000','143000','178000','215000','259000','289000','321000','370000','405000','478000','556000','620000','779000','899000','1063000','1199000','1358000','1499000');
var Cost_99_1517 = new Array('72000','89000','109000','126000','152000','187000','224000','268000','298000','330000','388000','423000','496000','574000','638000','806000','926000','1099000','1235000','1403000','1544000');
var Quantity_99_count = 21;
var Quantity_99 = new Array('10','15','20','25','30','40','50','60','70','80','90','100','120','140','160','200','240','280','320','360','400');
var Kind_99_count = 16;
var Kind_99 = new Array('48절-1조3매-1도','48절-1조3매-2도','48절-1조3매-3도','48절-1조3매-4도','A4-3등분-1조3매-1도','A4-3등분-1조3매-2도','A4-3등분-1조3매-3도','A4-3등분-1조3매-4도','16절-1조3매-1도','16절-1조3매-2도','16절-1조3매-3도','16절-1조3매-4도','A4-1조3매-1도','A4-1조3매-2도','A4-1조3매-3도','A4-1조3매-4도');
var Kind_99_Code = new Array('1502','1503','1504','1505','1506','1507','1508','1509','1510','1511','1512','1513','1514','1515','1516','1517');
var Cost_100_1518 = new Array('0','0','0','0','0','0','93000','0','0','0','0','129000','0','0','0','258000','0','0','0','0','516000');
var Cost_100_1519 = new Array('0','0','0','0','0','0','102000','0','0','0','0','138000','0','0','0','276000','0','0','0','0','552000');
var Cost_100_1520 = new Array('0','0','0','0','0','0','111000','0','0','0','0','147000','0','0','0','294000','0','0','0','0','588000');
var Cost_100_1521 = new Array('0','0','0','0','0','0','120000','0','0','0','0','156000','0','0','0','312000','0','0','0','0','624000');
var Cost_100_1522 = new Array('0','0','0','0','0','0','129000','0','0','0','0','165000','0','0','0','330000','0','0','0','0','660000');
var Cost_100_1523 = new Array('0','0','0','0','0','0','110000','0','0','0','0','185000','0','0','0','370000','0','0','0','0','740000');
var Cost_100_1524 = new Array('0','0','0','0','0','0','119000','0','0','0','0','203000','0','0','0','406000','0','0','0','0','812000');
var Cost_100_1525 = new Array('0','0','0','0','0','0','128000','0','0','0','0','212000','0','0','0','424000','0','0','0','0','848000');
var Cost_100_1526 = new Array('0','0','0','0','0','0','137000','0','0','0','0','221000','0','0','0','442000','0','0','0','0','884000');
var Cost_100_1527 = new Array('0','0','0','0','0','0','146000','0','0','0','0','230000','0','0','0','460000','0','0','0','0','920000');
var Cost_100_1528 = new Array('63000','83000','107000','109000','115000','153000','191000','229000','263000','301000','334000','366000','433000','505000','569000','701000','841000','981000','1121000','1261000','1401000');
var Cost_100_1529 = new Array('72000','92000','116000','118000','124000','171000','218000','256000','299000','337000','379000','411000','487000','568000','641000','791000','949000','1107000','1265000','1423000','1581000');
var Cost_100_1530 = new Array('81000','101000','125000','127000','133000','180000','227000','265000','308000','346000','397000','429000','505000','586000','659000','818000','976000','1143000','1301000','1468000','1626000');
var Cost_100_1531 = new Array('90000','110000','134000','136000','142000','189000','236000','274000','317000','355000','415000','447000','523000','604000','677000','845000','1003000','1179000','1337000','1513000','1671000');
var Cost_100_1532 = new Array('99000','119000','143000','145000','151000','198000','245000','283000','326000','364000','433000','465000','541000','622000','695000','872000','1030000','1215000','1373000','1558000','1716000');
var Cost_100_1533 = new Array('75000','97000','120000','145000','163000','199000','257000','308000','353000','398000','440000','474000','563000','649000','742000','924000','1109000','1293000','1467000','1632000','1813000');
var Cost_100_1534 = new Array('84000','106000','129000','163000','181000','217000','284000','335000','389000','434000','485000','519000','617000','712000','814000','1014000','1217000','1419000','1611000','1794000','1993000');
var Cost_100_1535 = new Array('93000','115000','138000','172000','190000','226000','293000','344000','398000','443000','503000','537000','635000','730000','832000','1041000','1244000','1455000','1647000','1839000','2038000');
var Cost_100_1536 = new Array('102000','124000','147000','181000','199000','235000','302000','353000','407000','452000','521000','555000','653000','748000','850000','1068000','1271000','1491000','1683000','1884000','2083000');
var Cost_100_1537 = new Array('111000','133000','156000','190000','208000','244000','311000','362000','416000','461000','539000','573000','671000','766000','868000','1095000','1298000','1527000','1719000','1929000','2128000');
var Quantity_100_count = 21;
var Quantity_100 = new Array('10','15','20','25','30','40','50','60','70','80','90','100','120','140','160','200','240','280','320','360','400');
var Kind_100_count = 20;
var Kind_100 = new Array('48절-1조4매-1도','48절-1조4매-2도','48절-1조4매-3도','48절-1조4매-4도','48절-1조4매-5도','A4-3등분-1조4매-1도','A4-3등분-1조4매-2도','A4-3등분-1조4매-3도','A4-3등분-1조4매-4도','A4-3등분-1조4매-5도','16절-1조4매-1도','16절-1조4매-2도','16절-1조4매-3도','16절-1조4매-4도','16절-1조4매-5도','A4-1조4매-1도','A4-1조4매-2도','A4-1조4매-3도','A4-1조4매-4도','A4-1조4매-5도');
var Kind_100_Code = new Array('1518','1519','1520','1521','1522','1523','1524','1525','1526','1527','1528','1529','1530','1531','1532','1533','1534','1535','1536','1537');
var Cost_101_1538 = new Array('63000','75000','150000','225000','300000','375000','425000','500000','550000','600000','640000','1150000','1700000','2240000','2700000');
var Cost_101_1539 = new Array('0','85000','170000','255000','340000','425000','500000','582000','665000','748000','830000','1560000','2300000','3050000','3800000');
var Cost_101_1540 = new Array('0','85000','170000','255000','340000','425000','500000','582000','665000','748000','830000','1560000','2300000','3050000','3800000');
var Quantity_101_count = 15;
var Quantity_101 = new Array('500','1000','2000','3000','4000','5000','6000','7000','8000','9000','10000','20000','30000','40000','50000');
var Kind_101_count = 3;
var Kind_101 = new Array('120모조백색','체크레자크91백색110g','줄레자크92백색110g');
var Kind_101_Code = new Array('1538','1539','1540');
var Cost_102_1541 = new Array('63000','75000','150000','225000','300000','375000','425000','500000','550000','600000','640000','1150000','1700000','2240000','2700000');
var Cost_102_1542 = new Array('0','85000','170000','255000','340000','425000','500000','582000','665000','748000','830000','1560000','2300000','3050000','3800000');
var Cost_102_1543 = new Array('0','85000','170000','255000','340000','425000','500000','582000','665000','748000','830000','1560000','2300000','3050000','3800000');
var Quantity_102_count = 15;
var Quantity_102 = new Array('500','1000','2000','3000','4000','5000','6000','7000','8000','9000','10000','20000','30000','40000','50000');
var Kind_102_count = 3;
var Kind_102 = new Array('120모조백색','체크레자크91백색110g','줄레자크92백색110g');
var Kind_102_Code = new Array('1541','1542','1543');
var Cost_103_1544 = new Array('0','28000','56000','84000','112000','140000','168000','196000','224000','252000','260000','460000','620000','800000','1000000');
var Cost_103_1545 = new Array('24000','29000','58000','87000','116000','145000','174000','203000','232000','261000','280000','520000','740000','850000','1040000');
var Cost_103_1546 = new Array('0','33000','66000','99000','132000','165000','198000','231000','264000','297000','320000','630000','920000','1200000','1450000');
var Cost_103_1547 = new Array('0','33000','66000','99000','132000','165000','198000','231000','264000','297000','320000','630000','920000','1200000','1450000');
var Quantity_103_count = 15;
var Quantity_103 = new Array('500','1000','2000','3000','4000','5000','6000','7000','8000','9000','10000','20000','30000','40000','50000');
var Kind_103_count = 4;
var Kind_103 = new Array('100모조백색','120모조백색','체크레자크91백색110g','줄레자크92백색110g');
var Kind_103_Code = new Array('1544','1545','1546','1547');
var Cost_104_1548 = new Array('0','48000','92000','132000','172000','210000','246000','280000','312000','342000','360000','640000','860000','1080000','1300000');
var Cost_104_1549 = new Array('39000','49000','94000','135000','176000','215000','252000','287000','320000','351000','380000','700000','980000','1130000','1340000');
var Cost_104_1550 = new Array('0','53000','102000','147000','192000','235000','276000','315000','352000','387000','420000','810000','1160000','1480000','1750000');
var Cost_104_1551 = new Array('0','53000','102000','147000','192000','235000','276000','315000','352000','387000','420000','810000','1160000','1480000','1750000');
var Quantity_104_count = 15;
var Quantity_104 = new Array('500','1000','2000','3000','4000','5000','6000','7000','8000','9000','10000','20000','30000','40000','50000');
var Kind_104_count = 4;
var Kind_104 = new Array('100모조백색','120모조백색','체크레자크91백색110g','줄레자크92백색110g');
var Kind_104_Code = new Array('1548','1549','1550','1551');
var Cost_105_1552 = new Array('0','0','0','0','0','0');
var Cost_105_1553 = new Array('0','0','0','0','0','0');
var Cost_105_1554 = new Array('0','0','0','0','0','0');
var Cost_105_1555 = new Array('0','0','0','0','0','0');
var Cost_105_1587 = new Array('14000','26000','37000','48000','59000','285000');
var Cost_105_1588 = new Array('15000','28000','40000','52000','64000','310000');
var Cost_105_1589 = new Array('18000','34000','49000','64000','79000','385000');
var Cost_105_1590 = new Array('13000','24000','34000','44000','54000','260000');
var Cost_105_1591 = new Array('14000','26000','37000','48000','59000','285000');
var Cost_105_1592 = new Array('17000','32000','46000','60000','74000','360000');
var Cost_105_1593 = new Array('16000','30000','43000','56000','70000','340000');
var Cost_105_1594 = new Array('17000','32000','46000','60000','74000','360000');
var Cost_105_1595 = new Array('20000','38000','55000','72000','89000','435000');
var Cost_105_1596 = new Array('14000','26000','37000','48000','59000','285000');
var Cost_105_1597 = new Array('15000','28000','40000','52000','64000','310000');
var Cost_105_1598 = new Array('18000','34000','49000','64000','79000','385000');
var Cost_105_1599 = new Array('17000','32000','46000','60000','74000','360000');
var Cost_105_1600 = new Array('18000','34000','49000','64000','79000','385000');
var Cost_105_1601 = new Array('21000','40000','58000','76000','94000','460000');
var Quantity_105_count = 6;
var Quantity_105 = new Array('200','400','600','800','1000','5000');
var Kind_105_count = 19;
var Kind_105 = new Array('A3단면4도','A3양면8도','A4단면4도','A4양면8도','누브4도에폭단면','누브8도에폭단면','누브8도에폭양면','비코팅4도에폭단면','비코팅8도에폭단면','비코팅8도에폭양면','스타드림4도에폭단면','스타드림8도에폭단면','스타드림8도에폭양면','무광코팅4도에폭단면','무광코팅8도에폭단면','무광코팅8도에폭양면','유포지4도에폭단면','유포지8도에폭단면','유포지8도에폭양면');
var Kind_105_Code = new Array('1552','1553','1554','1555','1587','1588','1589','1590','1591','1592','1593','1594','1595','1596','1597','1598','1599','1600','1601');
var Cost_106_1633 = new Array('0','0','0','0','0','0','39000','0','0','0','0','59000','0','0','0','118000','0','0','0','0','236000');
var Cost_106_1634 = new Array('0','0','0','0','0','0','48000','0','0','0','0','68000','0','0','0','136000','0','0','0','0','272000');
var Cost_106_1635 = new Array('28000','35000','40000','46000','52000','62000','72000','83000','93000','103000','116000','130000','155000','182000','205000','258000','308000','360000','410000','462000','512000');
var Cost_106_1636 = new Array('37000','44000','49000','55000','61000','71000','81000','92000','102000','112000','127000','141000','169000','198000','223000','281000','335000','391000','446000','504000','557000');
var Cost_106_1637 = new Array('0','0','0','0','0','0','43000','0','0','0','0','68000','0','0','0','136000','0','0','0','0','272000');
var Cost_106_1638 = new Array('0','0','0','0','0','0','52000','0','0','0','0','77000','0','0','0','154000','0','0','0','0','308000');
var Cost_106_1639 = new Array('30000','38000','45000','53000','60000','74000','92000','110000','129000','146000','164000','183000','218000','254000','291000','363000','435000','508000','580000','653000','725000');
var Cost_106_1640 = new Array('39000','47000','54000','62000','69000','83000','103000','124000','145000','164000','185000','206000','245000','286000','327000','408000','489000','871000','652000','734000','815000');
var Quantity_106_count = 21;
var Quantity_106 = new Array('10','15','20','25','30','40','50','60','70','80','90','100','120','140','160','200','240','280','320','360','400');
var Kind_106_count = 8;
var Kind_106 = new Array('48절(100매철)-1도','48절(100매철)-2도','16절(100매철)-1도','16절(100매철)-2도','A4-3등분(100매철)-1도','A4-3등분(100매철)-2도','A4(100매철)-1도','A4(100매철)-2도');
var Kind_106_Code = new Array('1633','1634','1635','1636','1637','1638','1639','1640');
var Cost_107_1641 = new Array('0','0','0','0','0','0','46000','0','0','0','0','75000','0','0','0','150000','0','0','0','0','300000');
var Cost_107_1642 = new Array('0','0','0','0','0','0','55000','0','0','0','0','84000','0','0','0','168000','0','0','0','0','336000');
var Cost_107_1643 = new Array('33000','41000','50000','58000','66000','82000','105000','118000','129000','144000','163000','180000','216000','252000','287000','359000','430000','502000','573000','645000','716000');
var Cost_107_1644 = new Array('42000','50000','59000','67000','75000','91000','114000','127000','138000','153000','173000','191000','229000','267000','305000','381000','457000','532000','609000','684000','761000');
var Cost_107_1645 = new Array('0','0','0','0','0','0','55000','0','0','0','0','93000','0','0','0','186000','0','0','0','0','372000');
var Cost_107_1646 = new Array('0','0','0','0','0','0','64000','0','0','0','0','102000','0','0','0','204000','0','0','0','0','408000');
var Cost_107_1647 = new Array('36000','48000','59000','70000','81000','103000','130000','155000','182000','205000','231000','258000','308000','360000','410000','512000','615000','717000','819000','921000','1024000');
var Cost_107_1648 = new Array('45000','57000','68000','79000','90000','112000','141000','168000','197000','223000','251000','279000','335000','392000','446000','557000','669000','780000','891000','1002000','1114000');
var Quantity_107_count = 21;
var Quantity_107 = new Array('10','15','20','25','30','40','50','60','70','80','90','100','120','140','160','200','240','280','320','360','400');
var Kind_107_count = 8;
var Kind_107 = new Array('48절(100매철)-1도','48절(100매철)-2도','16절(100매철)-1도','16절(100매철)-2도','A4-3등분(100매철)-1도','A4-3등분(100매철)-2도','A4(100매철)-1도','A4(100매철)-2도');
var Kind_107_Code = new Array('1641','1642','1643','1644','1645','1646','1647','1648');
var Cost_108_1649 = new Array('88000','176000','261000','348000','435000','522000','609000','696000','783000','870000');
var Cost_108_1650 = new Array('97000','194000','288000','384000','480000','576000','672000','768000','864000','960000');
var Cost_108_1651 = new Array('65000','130000','192000','256000','320000','384000','448000','512000','576000','640000');
var Cost_108_1652 = new Array('74000','148000','219000','292000','365000','438000','511000','584000','657000','730000');
var Quantity_108_count = 10;
var Quantity_108 = new Array('1','2','3','4','5','6','7','8','9','10');
var Kind_108_count = 4;
var Kind_108 = new Array('16절-연단가/1도','16절-연단가/2도','A4-연단가/1도','A4-연단가/2도');
var Kind_108_Code = new Array('1649','1650','1651','1652');
var Cost_109_1653 = new Array('129000','258000','384000','512000','640000','768000','896000','1024000','1152000','1280000');
var Cost_109_1654 = new Array('138000','276000','411000','548000','685000','822000','959000','1096000','1233000','1370000');
var Cost_109_1655 = new Array('94000','188000','279000','372000','465000','558000','651000','744000','837000','930000');
var Cost_109_1656 = new Array('103000','206000','306000','408000','510000','612000','714000','816000','918000','1020000');
var Quantity_109_count = 10;
var Quantity_109 = new Array('1','2','3','4','5','6','7','8','9','10');
var Kind_109_count = 4;
var Kind_109 = new Array('16절-연단가/1도','16절-연단가/2도','A4-연단가/1도','A4-연단가/2도');
var Kind_109_Code = new Array('1653','1654','1655','1656');
var Cost_110_1661 = new Array('17100','20340','23580','26820','28800','30600','34200','36900','40500','43200','45900','49500','52200','55800','58500','61200','91800','122400','153000','183600','214200','244800','275400','306000','336600','367200','397800','428400','459000','489600','520200','550800','581400','612000','642600','673200','703800','734400','765000','795600','826200','856800','887400','918000','1071000','1224000','1377000','1530000');
var Cost_110_1662 = new Array('25200','29610','34020','38700','43200','45900','54000','55800','63900','64800','72000','72900','81000','81900','89100','90000','135000','180000','225000','263700','302400','340200','378900','416700','454500','490500','526500','562500','598500','634500','670500','706500','742500','778500','814500','850500','886500','922500','958500','994500','1030500','1066500','1102500','1138500','1183500','1555200','1737000','1917000');
var Cost_110_1663 = new Array('21600','25740','30780','34920','37800','39600','44100','47700','52200','55800','59400','63900','67500','72000','75600','79200','118800','158400','198000','237600','277200','316800','356400','396000','435600','475200','514800','554400','594000','633600','673200','712800','752400','792000','831600','871200','910800','950400','990000','1029600','1069200','1108800','1148400','1188000','1386000','1584000','1782000','1980000');
var Cost_110_1664 = new Array('33300','38700','44100','45900','47700','48600','54000','58500','63900','68400','72900','78300','82800','88200','92700','97200','145800','194400','243000','291600','340200','388800','437400','486000','534600','583200','631800','680400','729000','777600','826200','874800','923400','972000','1020600','1069200','1117800','1166400','1215000','1263600','1312200','1360800','1409400','1458000','1701000','1944000','2187000','2430000');
var Cost_110_1665 = new Array('72000','86400','100800','115200','129600','144000','158400','172800','187200','201600','216000','230400','244800','259200','273600','288000','432000','576000','720000','864000','1008000','1152000','1296000','1440000','1584000','1728000','1872000','2016000','2160000','2304000','2448000','2592000','2736000','2880000','3024000','3168000','3312000','3456000','3600000','3744000','3888000','4032000','4176000','4320000','5040000','5760000','6480000','7200000');
var Cost_110_1666 = new Array('90000','108000','126000','144000','162000','180000','198000','216000','234000','252000','270000','288000','306000','324000','342000','360000','540000','720000','900000','1080000','1260000','1440000','1620000','1800000','1980000','2160000','2340000','2520000','2700000','2880000','3060000','3240000','3420000','3600000','3780000','3960000','4140000','4320000','4500000','4680000','4860000','5040000','5220000','5400000','6300000','7200000','8100000','9000000');
var Quantity_110_count = 48;
var Quantity_110 = new Array('5000','6000','7000','8000','9000','10000','11000','12000','13000','14000','15000','16000','17000','18000','19000','20000','30000','40000','50000','60000','70000','80000','90000','100000','110000','120000','130000','140000','150000','160000','170000','180000','190000','200000','210000','220000','230000','240000','250000','260000','270000','280000','290000','300000','350000','400000','450000','500000');
var Kind_110_count = 6;
var Kind_110 = new Array('비코팅단면4도','비코팅양면8도','코팅단면4도','코팅양면8도','누브단면4도','누브양면8도');
var Kind_110_Code = new Array('1661','1662','1663','1664','1665','1666');
var Cost_111_1668 = new Array('33000','38000','64000','74000','111000','180000','350000');
var Cost_111_1669 = new Array('44000','49000','79000','94000','141000','225000','440000');
var Cost_111_1670 = new Array('44000','49000','79000','94000','141000','225000','440000');
var Quantity_111_count = 7;
var Quantity_111 = new Array('500','1000','1500','2000','3000','5000','10000');
var Kind_111_count = 3;
var Kind_111 = new Array('120모조백색','체크레자크91백색110g','줄레자크92백색110g');
var Kind_111_Code = new Array('1668','1669','1670');
var Cost_112_1671 = new Array('0','48000','92000','132000','172000','210000','246000','280000','312000','342000','360000','640000','860000','1080000','1300000');
var Cost_112_1672 = new Array('39000','49000','94000','135000','176000','215000','252000','287000','320000','351000','380000','700000','980000','1130000','1340000');
var Cost_112_1673 = new Array('0','53000','102000','147000','192000','235000','276000','315000','352000','387000','420000','810000','1160000','1480000','1750000');
var Cost_112_1674 = new Array('0','53000','102000','147000','192000','235000','276000','315000','352000','387000','420000','810000','1160000','1480000','1750000');
var Quantity_112_count = 15;
var Quantity_112 = new Array('500','1000','2000','3000','4000','5000','6000','7000','8000','9000','10000','20000','30000','40000','50000');
var Kind_112_count = 4;
var Kind_112 = new Array('100모조백색','120모조백색','체크레자크91백색110g','줄레자크92백색110g');
var Kind_112_Code = new Array('1671','1672','1673','1674');
var Cost_113_1675 = new Array('0','48000','92000','132000','172000','210000','246000','280000','312000','342000','360000','640000','860000','1080000','1300000');
var Cost_113_1676 = new Array('39000','49000','94000','135000','176000','215000','252000','287000','320000','351000','380000','700000','980000','1130000','1340000');
var Cost_113_1677 = new Array('0','53000','102000','147000','192000','235000','276000','315000','352000','387000','420000','810000','1160000','1480000','1750000');
var Cost_113_1678 = new Array('0','53000','102000','147000','192000','235000','276000','315000','352000','387000','420000','810000','1160000','1480000','1750000');
var Quantity_113_count = 15;
var Quantity_113 = new Array('500','1000','2000','3000','4000','5000','6000','7000','8000','9000','10000','20000','30000','40000','50000');
var Kind_113_count = 4;
var Kind_113 = new Array('100모조백색','120모조백색','체크레자크91백색110g','줄레자크92백색110g');
var Kind_113_Code = new Array('1675','1676','1677','1678');
var Cost_114_1679 = new Array('63000','75000','150000','225000','300000','375000','425000','500000','550000','600000','640000','1150000','1700000','2240000','2700000');
var Cost_114_1680 = new Array('0','85000','170000','255000','340000','425000','500000','582000','665000','748000','830000','1560000','2300000','3050000','3800000');
var Cost_114_1681 = new Array('0','85000','170000','255000','340000','425000','500000','582000','665000','748000','830000','1560000','2300000','3050000','3800000');
var Quantity_114_count = 15;
var Quantity_114 = new Array('500','1000','2000','3000','4000','5000','6000','7000','8000','9000','10000','20000','30000','40000','50000');
var Kind_114_count = 3;
var Kind_114 = new Array('120모조백색','체크레자크91백색110g','줄레자크92백색110g');
var Kind_114_Code = new Array('1679','1680','1681');
var Cost_115_1682 = new Array('0');
var Quantity_115_count = 1;
var Quantity_115 = new Array('1');
var Kind_115_count = 1;
var Kind_115 = new Array('배너거치대');
var Kind_115_Code = new Array('1682');
var Cost_116_1683 = new Array('0');
var Quantity_116_count = 1;
var Quantity_116 = new Array('1');
var Kind_116_count = 1;
var Kind_116 = new Array('실사출력');
var Kind_116_Code = new Array('1683');
var Cost_117_1684 = new Array('0');
var Quantity_117_count = 1;
var Quantity_117 = new Array('1');
var Kind_117_count = 1;
var Kind_117 = new Array('현수막');
var Kind_117_Code = new Array('1684');
var Cost_118_1685 = new Array('0');
var Quantity_118_count = 1;
var Quantity_118 = new Array('1');
var Kind_118_count = 1;
var Kind_118 = new Array('폼보드');
var Kind_118_Code = new Array('1685');
var Cost_119_1686 = new Array('0');
var Quantity_119_count = 1;
var Quantity_119 = new Array('1');
var Kind_119_count = 1;
var Kind_119 = new Array('폼맥스');
var Kind_119_Code = new Array('1686');
var Cost_120_1716 = new Array('4200','8400','12200','16200','20300','24400','28400','32500','36500','40600','60900','81200','94500','189000','378000','567000','756000','945000');
var Cost_120_1717 = new Array('5300','10500','15300','20400','25600','30700','35800','40900','46000','51100','76700','102200','117300','234500','469000','703500','938000','1172500');
var Cost_120_1718 = new Array('4900','9800','14300','19000','23800','28600','33300','38100','42800','47600','71400','95200','108500','217000','434000','651000','868000','1085000');
var Cost_120_1719 = new Array('6000','11900','17400','23200','29100','34900','40700','46500','52300','58100','87200','116200','134800','269500','539000','808500','1078000','1347500');
var Cost_120_1720 = new Array('4900','9800','14300','19000','23800','28600','33300','38100','42800','47600','71400','95200','108500','217000','434000','651000','868000','1085000');
var Cost_120_1721 = new Array('6000','11900','17400','23200','29100','34900','40700','46500','52300','58100','87200','116200','134800','269500','539000','808500','1078000','1347500');
var Cost_120_1722 = new Array('4900','9800','14300','19000','23800','28600','33300','38100','42800','47600','71400','95200','108500','217000','434000','651000','868000','1085000');
var Cost_120_1723 = new Array('6000','11900','17400','23200','29100','34900','40700','46500','52300','58100','87200','116200','134800','269500','539000','808500','1078000','1347500');
var Cost_120_1724 = new Array('4900','9800','14300','19000','23800','28600','33300','38100','42800','47600','71400','95200','108500','217000','434000','651000','868000','1085000');
var Cost_120_1725 = new Array('6000','11900','17400','23200','29100','34900','40700','46500','52300','58100','87200','116200','134800','269500','539000','808500','1078000','1347500');
var Quantity_120_count = 18;
var Quantity_120 = new Array('200','400','600','800','1000','1200','1400','1600','1800','2000','3000','4000','5000','10000','20000','30000','40000','50000');
var Kind_120_count = 10;
var Kind_120 = new Array('뉴에코크라프트단면','뉴에코크라프트양면','뉴블랙단면','뉴블랙양면','딥블루단면','딥블루양면','레드단면','레드양면','코코단면','코코양면');
var Kind_120_Code = new Array('1716','1717','1718','1719','1720','1721','1722','1723','1724','1725');
var KPaper_Code = new Array('16','16','16','16','16','16','16','16','16','16','16','16','145','145','145','16','16','16','25','25','25','26','26','26','27','27','27','28','28','28','29','29','29','30','30','30','31','31','31','32','32','32','33','33','33','34','34','34','35','35','35','36','36','36','37','37','37','38','38','38','39','39','39','40','40','40','42','42','42','43','44','44','44','45','45','45','46','46','46','47','47','47','48','48','48','49','49','49','50','50','50','51','51','51','134','134','134','46','16','16','16','16','16','16','16','16','16','16','16','16','16','16','16','16','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','25','25','25','25','25','25','25','25','25','25','25','25','25','25','25','25','26','26','26','26','26','26','26','26','26','26','26','26','26','26','26','26','27','27','27','27','27','27','27','27','27','27','27','27','27','27','27','27','29','29','29','29','29','29','29','29','29','29','29','29','29','29','29','29','30','30','30','30','30','30','30','30','30','30','30','30','30','30','30','30','31','31','31','31','31','31','31','31','31','31','31','31','31','31','31','31','32','32','32','32','32','32','32','32','32','32','32','32','32','32','32','32','33','33','33','33','33','33','33','33','33','33','33','33','33','33','33','33','34','34','34','34','34','34','34','34','34','34','34','34','34','34','34','34','16','16','16','16','16','16','22','22','22','22','22','22','25','25','25','25','25','25','26','26','26','26','26','26','27','27','27','27','27','27','29','29','29','29','29','29','30','30','30','30','30','30','31','31','31','31','31','31','32','32','32','32','32','32','33','33','33','33','33','33','34','34','34','34','34','34','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','22','58','58','58','58','58','58','58','58','58','58','58','58','58','58','58','58','58','58','58','58','200','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','60','60','60','60','60','60','60','60','60','60','60','60','60','60','60','60','60','60','60','60','60','60','60','60','60','60','60','60','60','60','60','60','61','61','61','61','61','61','61','61','61','61','61','61','61','61','62','62','62','62','62','62','62','62','62','62','62','62','62','62','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','18','18','18','18','18','18','18','18','18','18','18','18','18','18','18','18','18','18','18','18','18','18','18','18','1','1','1','1','1','1','1','1','1','1','1','1','19','19','19','19','19','19','19','19','19','19','19','19','17','17','17','17','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','20','20','20','20','20','20','20','20','20','20','11','11','11','11','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','21','21','21','21','22','22','22','22','22','25','25','25','13','13','13','25','25','25','26','26','26','28','28','28','29','29','29','31','31','31','32','32','32','33','33','33','35','35','35','41','41','41','30','30','30','39','39','39','17','17','17','17','17','17','17','17','17','17','17','17','17','17','17','17','17','17','3','95','100','2','3','95','100','91','72','107','111','116','71','72','107','111','116','72','107','111','116','71','71','71','71','71','71','2','3','100','72','100','100','1','2','2','64','69','71','65','2','2','2','2','2','2','72','72','100','1','2','92','70','2','2','2','2','2','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','18','18','18','18','18','18','18','18','18','18','18','18','18','18','18','18','200','200','199','199','199','199','199','200','200','61','62','22','22','22','200','200','200','200','18','18','18','18','18','18','18','18','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','25','25','25','26','26','26','27','27','27','28','28','28','25','25','25','25','25','25','25','25','25','25','25','25','25','25','25','25','26','26','26','26','26','26','26','26','26','26','26','26','26','26','26','26','27','27','27','27','27','27','27','27','27','27','27','27','27','27','27','27','25','25','25','25','25','25','26','26','26','26','26','26','27','27','27','27','27','27','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','0','0','131','71','131','71','131','43','200','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','59','132','132','132','132','132','132','132','132','132','132','132','132','132','132','132','15','15','15','16','16','16','26','26','26','1','2','133','133','133','134','134','134','42','42','42','59','59','60','60','0','0','28','28','28','135','135','135','200','200','200','200','200','200','200','200','200','200','200','200','200','200','200','200','200','25','28','200','200','200','200','200','200','200','200','200','200','200','200','200','200','25','25','1','1','1','1','141','141','141','141','141','141','141','141','141','141','141','141','141','141','141','141','141','141','141','141','141','141','141','141','43','43','142','142','142','142','142','142','142','142','142','142','142','142','142','142','142','142','142','0','0','0','0','0','0','0','0','50','50','50','49','49','49','47','47','47','46','46','46','144','144','144','0','0','0','0','1','1','1','1','2','2','2','2','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','63','3','95','100','3','95','100','2','3','95','100','2','3','95','100','18','18','18','18','31','31','31','31','27','27','27','30','30','30','34','34','34','36','36','36','37','37','37','38','38','38','39','39','39','40','40','40','135','135','135','26','26','26','16','16','16','29','29','29','23','23','23','36','36','36','146','146','146','147','147','147','148','148','148','149','149','149','150','150','150','151','151','151','152','152','152','153','153','153','154','154','154','11','11','11','11','155','155','155','155','155','155','155','155','156','156','156','156','156','156','156','156','155','155','155','155','156','156','156','156','165','165','166','166','16','16','145','145','26','26','13','3','95','100','2','3','95','100','2','3','95','100','3','95','100','1','1','1','1','1','71','71','71','71','71','71','1','2','2','92','73','70','2','2','2','2','2','2','2','2','2','1','2','64','69','65','3','167','167','168','168','169','169','170','170','171','171','172','172');
var KPaper_Name = new Array('코팅단면4도','코팅양면5도','코팅양면8도','비코팅단면4도','비코팅양면5도','비코팅양면8도','코팅단면4도','코팅양면5도','코팅양면8도','비코팅단면4도','비코팅양면5도','비코팅양면8도','코팅단면4도','코팅양면5도','코팅양면8도','복권단면4도','복권양면5도','복권양면8도','라레단면4도','라레양면5도','라레양면8도','누브단면4도','누브양면5도','누브양면8도','탄트단면4도','탄트양면5도','탄트양면8도','화인라레단면4도','화인라레양면5도','화인라레양면8도','스타단면4도','스타양면5도','스타양면8도','키칼단면4도','키칼양면5도','키칼양면8도','그레단면4도','그레양면5도','그레양면8도','빌리단면4도','빌리양면5도','빌리양면8도','머쉬단면4도','머쉬양면5도','머쉬양면8도','스코단면4도','스코양면5도','스코양면8도','팝셋단면4도','팝셋양면5도','팝셋양면8도','유포단면4도','유포양면5도','유포양면8도','카멜단면4도','카멜양면5도','카멜양면8도','컨셉단면4도','컨셉양면5도','컨셉양면8도','키칼아이스골드단면4도','키칼아이스골드양면5도','키칼아이스골드양면8도','스타골드단면4도','스타골드양면5도','스타골드양면8도','화이트무광단면4도','화이트무광양면5도','화이트무광양면8도','누드단면4도','골드플러스단면4도','골드플러스양면5도','골드플러스양면8도','실버플러스단면4도','실버플러스양면5도','실버플러스양면8도','골드단면4도','골드양면5도','골드양면8도','실버단면4도','실버양면5도','실버양면8도','거울단면4도','거울양면5도','거울양면8도','금펄단면4도','금펄양면5도','금펄양면8도','은펄단면4도','은펄양면5도','은펄양면8도','레인보우단면4도','레인보우양면5도','레인보우양면8도','300화인스노우단면4도','300화인스노우양면5도','300화인스노우양면8도','스피드카드4도','비코팅160x70단면','비코팅160x70양면','비코팅170x80단면','비코팅170x80양면','비코팅150x70단면','비코팅150x70양면','비코팅155x70단면','비코팅155x70양면','비코팅146x76단면','비코팅146x76양면','비코팅170x70단면','비코팅170x70양면','비코팅156x74단면','비코팅156x74양면','비코팅144x64단면','비코팅144x64양면','코팅160x70단면','코팅160x70양면','코팅170x80단면','코팅170x80양면','코팅150x70단면','코팅150x70양면','코팅155x70단면','코팅155x70양면','코팅146x76단면','코팅146x76양면','코팅170x70단면','코팅170x70양면','코팅156x74단면','코팅156x74양면','코팅144x64단면','코팅144x64양면','라레160x70단면','라레160x70양면','라레170x80단면','라레170x80양면','라레150x70단면','라레150x70양면','라레155x70단면','라레155x70양면','라레146x76단면','라레146x76양면','라레170x70단면','라레170x70양면','라레156x74단면','라레156x74양면','라레144x64단면','라레144x64양면','누브160x70단면','누브160x70양면','누브170x80단면','누브170x80양면','누브150x70단면','누브150x70양면','누브155x70단면','누브155x70양면','누브146x76단면','누브146x76양면','누브170x70단면','누브170x70양면','누브156x74단면','누브156x74양면','누브144x64단면','누브144x64양면','탄트160x70단면','탄트160x70양면','탄트170x80단면','탄트170x80양면','탄트150x70단면','탄트150x70양면','탄트155x70단면','탄트155x70양면','탄트146x76단면','탄트146x76양면','탄트170x70단면','탄트170x70양면','탄트156x74단면','탄트156x74양면','탄트144x64단면','탄트144x64양면','스타160x70단면','스타160x70양면','스타170x80단면','스타170x80양면','스타150x70단면','스타150x70양면','스타155x70단면','스타155x70양면','스타146x76단면','스타146x76양면','스타170x70단면','스타170x70양면','스타156x74단면','스타156x74양면','스타144x64단면','스타144x64양면','키칼160x70단면','키칼160x70양면','키칼170x80단면','키칼170x80양면','키칼150x70단면','키칼150x70양면','키칼155x70단면','키칼155x70양면','키칼146x76단면','키칼146x76양면','키칼170x70단면','키칼170x70양면','키칼156x74단면','키칼156x74양면','키칼144x64단면','키칼144x64양면','그레160x70단면','그레160x70양면','그레170x80단면','그레170x80양면','그레150x70단면','그레150x70양면','그레155x70단면','그레155x70양면','그레146x76단면','그레146x76양면','그레170x70단면','그레170x70양면','그레156x74단면','그레156x74양면','그레144x64단면','그레144x64양면','빌리160x70단면','빌리160x70양면','빌리170x80단면','빌리170x80양면','빌리150x70단면','빌리150x70양면','빌리155x70단면','빌리155x70양면','빌리146x76단면','빌리146x76양면','빌리170x70단면','빌리170x70양면','빌리156x74단면','빌리156x74양면','빌리144x64단면','빌리144x64양면','머쉬160x70단면','머쉬160x70양면','머쉬170x80단면','머쉬170x80양면','머쉬150x70단면','머쉬150x70양면','머쉬155x70단면','머쉬155x70양면','머쉬146x76단면','머쉬146x76양면','머쉬170x70단면','머쉬170x70양면','머쉬156x74단면','머쉬156x74양면','머쉬144x64단면','머쉬144x64양면','스코160x70단면','스코160x70양면','스코170x80단면','스코170x80양면','스코150x70단면','스코150x70양면','스코155x70단면','스코155x70양면','스코146x76단면','스코146x76양면','스코170x70단면','스코170x70양면','스코156x74단면','스코156x74양면','스코144x64단면','스코144x64양면','비코팅16절단면','비코팅16절양면','비코팅A4단면','비코팅A4양면','비코팅A5단면','비코팅A5양면','코팅16절단면','코팅16절양면','코팅A4단면','코팅A4양면','코팅A5단면','코팅A5양면','라레16절단면','라레16절양면','라레A4단면','라레A4양면','라레A5단면','라레A5양면','누브16절단면','누브16절양면','누브A4단면','누브A4양면','누브A5단면','누브A5양면','탄트16절단면','탄트16절양면','탄트A4단면','탄트A4양면','탄트A5단면','탄트A5양면','스타16절단면','스타16절양면','스타A4단면','스타A4양면','스타A5단면','스타A5양면','키칼16절단면','키칼16절양면','키칼A4단면','키칼A4양면','키칼A5단면','키칼A5양면','그레16절단면','그레16절양면','그레A4단면','그레A4양면','그레A5단면','그레A5양면','빌리16절단면','빌리16절양면','빌리A4단면','빌리A4양면','빌리A5단면','빌리A5양면','머쉬16절단면','머쉬16절양면','머쉬A4단면','머쉬A4양면','머쉬A5단면','머쉬A5양면','스코16절단면','스코16절양면','스코A4단면','스코A4양면','스코A5단면','스코A5양면','88x54단면4도','88x54양면5도','88x54양면8도','88x108단면4도','88x108양면5도','88x108양면8도','88x135단면4도','88x135양면5도','88x135양면8도','91x61단면4도','91x61양면5도','91x61양면8도','112x77단면4도','112x77양면5도','112x77양면8도','122x86단면4도','122x86양면5도','122x86양면8도','132x94단면4도','132x94양면5도','132x94양면8도','156x106단면4도','156x106양면5도','156x106양면8도','곰76x87단면4도','곰76x87양면5도','곰76x87양면8도','타원114x62단면4도','타원114x62양면5도','타원114x62양면8도','발88x115단면4도','발88x115양면5도','발88x115양면8도','사과90x100단면4도','사과90x100양면5도','사과90x100양면8도','타원꼭지154x100단면4도','타원꼭지154x100양면5도','타원꼭지154x100양면8도','차114x79단면4도','차114x79양면5도','차114x79양면8도','집114x79단면4도','집114x79양면5도','집114x79양면8도','하트112x81단면4도','하트112x81양면5도','하트112x81양면8도','반원108x83단면4도','반원108x83양면5도','반원108x83양면8도','원반120x70단면4도','원반120x70양면5도','원반120x70양면8도','복주머니110x80단면4도','복주머니110x80양면5도','복주머니110x80양면8도','토끼110x80단면4도','토끼110x80양면5도','토끼110x80양면8도','곰모양','복주머니모양','타원모양114x82','반원모양','발모양','사과모양','토끼모양','타원모양134x98','타원모양168x114','차모양','집모양','하트모양','86x52','106x86','116x81','126x90','139x92','95x65','136x98','154x104','세트품목','코팅60x40','코팅80x50','코팅90x55','코팅90x60','코팅90x70','코팅90x80','코팅90x90','코팅90x100','코팅90x110','코팅90x120','코팅90x130','코팅90x140','코팅90x150','비코팅60x40','비코팅80x50','비코팅90x55','비코팅90x60','비코팅90x70','비코팅90x80','비코팅90x90','비코팅90x100','비코팅90x110','비코팅90x120','비코팅90x130','비코팅90x140','비코팅90x150','코팅별사이즈','코팅투터치','비코팅별사이즈','비코팅투터치','도무송코팅','도무송비코팅','코팅60x40','코팅80x50','코팅90x55','코팅90x60','코팅90x70','코팅90x80','코팅90x90','코팅90x100','코팅90x110','코팅90x120','코팅90x130','코팅90x140','코팅90x150','비코팅60x40','비코팅80x50','비코팅90x55','비코팅90x60','비코팅90x70','비코팅90x80','비코팅90x90','비코팅90x100','비코팅90x110','비코팅90x120','비코팅90x130','비코팅90x140','비코팅90x150','코팅별사이즈','비코팅별사이즈','코팅투터치','비코팅투터치','도무송코팅','도무송비코팅','80x50','90x55','90x60','90x70','90x80','90x90','90x100','90x110','90x120','90x130','90x140','90x150','별사이즈','투터치','80x50','90x55','90x60','90x70','90x80','90x90','90x100','90x110','90x120','90x130','90x140','90x150','별사이즈','투터치','55x24','55x33','50x30','50x20','50x17','AR-10','AR-11','AR-12','AR-13','AR-14','AR-15','AR-16','AR-17','AR-18','AR-19','AR-20','AR-21','AR-22','AR-25','AR-28','AR-30','AR-33','AR-35','AR-38','AR-40','AR-43','AR-45','AR-48','AR-50','AR-55','AR-60','AR-65','ARR-5017','ARR-5020','ARR-5030','ARR-4220','ARR-4223','ARR-5515','ARR-5517','ARR-5520','ARR-5524','ARR-5533','ARR-3525','ARR-4030','AC-10','AC-11','AC-12','AC-13','AC-14','AC-15','AC-16','AC-17','AC-18','AC-19','AC-20','AC-21','AC-22','AC-25','AC-28','AC-30','AC-33','AC-35','AC-38','AC-40','AC-43','AC-45','AC-48','AC-50','AC-55','AC-60','AC-65','AE-5020','AE-5025','AE-5030','AE-5525','AE-5530','AE-6025','AE-6030','AS-10','AS-11','AS-12','AS-13','AS-14','AS-15','AS-16','AS-17','AS-18','AS-19','AS-20','AS-21','AS-22','AS-25','AS-28','AS-30','AS-33','AS-35','AS-38','AS-40','AS-43','AS-45','AS-48','AS-50','AS-55','AS-60','AS-65','AH-10','AH-11','AH-12','AH-13','AH-14','AH-15','AH-16','AH-17','AH-18','AH-19','AH-20','AH-21','AH-22','AH-25','AH-28','AH-30','AH-33','AH-35','AH-38','AH-40','AH-43','AH-45','AH-48','AH-50','AH-55','AH-60','AH-65','비디오1','비디오2','비디오3','Akey-5423','Akey-6527','카세트테이프','CD','64절단면4도','64절양면8도','32절단면4도','32절양면8도','16절단면4도','16절양면8도','8절단면4도','8절양면8도','A6단면4도','A6양면8도','A5단면4도','A5양면8도','A4단면4도','A4양면8도','A3단면4도','A3양면8도','4절단면4도','4절양면8도','A2단면4도','A2양면8도','16절단면4도','16절양면8도','A4단면4도','A4양면8도','32절단면4도','32절양면8도','16절단면4도','16절양면8도','8절단면4도','8절양면8도','A5단면4도','A5양면8도','A4단면4도','A4양면8도','A3단면4도','A3양면8도','32절단면4도','32절양면8도','16절단면4도','16절양면8도','8절단면4도','8절양면8도','A5단면4도','A5양면8도','A4단면4도','A4양면8도','A3단면4도','A3양면8도','64절양면8도','32절양면8도','16절양면8도','8절양면8도','64절단면4도','64절양면8도','32절단면4도','32절양면8도','16절단면4도','16절양면8도','8절단면4도','8절양면8도','4절단면4도','4절양면8도','2절단면4도','2절양면8도','A6단면4도','A6양면8도','A5단면4도','A5양면8도','A4단면4도','A4양면8도','A3단면4도','A3양면8도','A2단면4도','A2양면8도','국전지단면4도','국전지양면8도','16절단면4도','16절양면8도','8절단면4도','8절양면8도','4절단면4도','4절양면8도','A4단면4도','A4양면8도','A3단면4도','A3양면8도','구형장32절단면4도','구형장32절양면8도','구형장A5단면4도','구형장A5양면8도','64절단면1도','64절단면2도','32절단면1도','32절단면2도','16절단면1도','16절단면2도','8절단면1도','8절단면2도','4절단면1도','4절단면2도','A6단면1도','A6단면2도','A5단면1도','A5단면2도','A4단면1도','A4단면2도','A3단면1도','A3단면2도','A2단면1도','A2단면2도','2절단면4도','4절단면4도','국2절단면4도','국전단면4도','A4-08P','A4-12P','A4-16P','A4-20P','A4-24P','A4-08P','A4-12P','A4-16P','A3-2단','국3절-3단(알뜰형)','장국2절-대문','라레-8절-2단','라레-A3-2단','라레-국3절-3단','누브-8절-2단','누브-A3-2단','누브-국3절-3단','화인라레-8절-2단','화인라레-A3-2단','화인라레-국3절-3단','스타-8절-2단','스타-A3-2단','스타-국3절-3단','그레-8절-2단','그레-A3-2단','그레-국3절-3단','빌리-8절-2단','빌리-A3-2단','빌리-국3절-3단','머쉬-8절-2단','머쉬-A3-2단','머쉬-국3절-3단','팝셋-8절-2단','팝셋-A3-2단','팝셋-국3절-3단','심볼-8절-2단','심볼-A3-2단','심볼-국3절-3단','키칼금펄-8절-2단','키칼금펄-A3-2단','키칼금펄-국3절-3단','키칼은펄-8절-2단','키칼은펄-A3-2단','키칼은펄-국3절-3단','HD1-단면4도','HD1-양면8도','HD2-단면4도','HD2-양면8도','HD3-단면4도','HD3-양면8도','HD4-단면4도','HD4-양면8도','HD5-단면4도','HD5-양면8도','HD6-단면4도','HD6-양면8도','HD7-단면4도','HD7-양면8도','HD8-단면4도','HD8-양면8도','HD9-단면4도','HD9-양면8도','120모조백색','체크레자크91백색110g','줄레자크92백색110g','100모조백색','120모조백색','체크레자크91백색110g','줄레자크92백색110g','대소봉투세트','레자크지','탄트지','레이드지','밍크지','크라프트','레자크지','탄트지','레이드지','밍크지','레자크지','탄트지','레이드지','밍크지','4절크라프트(A급)','5절크라프트(A급)','6절크라프트(A급)','9절크라프트양중각(A급)','10절크라프트양장중각(A급)','12절크라프트(A급)','5절100모조','5절120모조','4절레자크','5절레자크','6절레자크','9절레자크','신규격-80모조','신규격-100모조','이중신규격','황봉투신규격','신규격(A급)','16절120크라프트(A급)','색모조신규격','장교A봉투','장교B봉투','장교C봉투','자켓봉투','A4-100모조구형항공','신형항공봉투','레자크자켓봉투','수강료봉투','레자크티켓봉투','A4봉투-80모조','A4봉투-100모조','A4봉투-레자크','월급봉투(A급)','카드봉투(135*195)','카드봉투(130*180)','카드봉투(120*180)','카드봉투(120*190)','카드봉투(115*165)','48절-100매-1도','48절-100매-2도','32절-100매-1도','32절-100매-2도','A5-100매-1도','A5-100매-2도','A4-3등분-100매-1도','A4-3등분-100매-2도','A4-100매-1도','A4-100매-2도','16절-100매-1도','16절-100매-2도','국전연단위-1도','국전연단위-2도','46전연단위-1도','46전연단위-2도','국전연단위(제본)-1도','국전연단위(제본)-2도','46전연단위(제본)-1도','46전연단위(제본)-2도','48절-2매1조-1도','48절-2매1조-2도','32절-2매1조-1도','32절-2매1조-2도','A5-2매1조-1도','A5-2매1조-2도','A4-3등분-2매1조-1도','A4-3등분-2매1조-2도','48절-3매1조-1도','48절-3매1조-2도','32절-3매1조-1도','32절-3매1조-2도','A5-3매1조-1도','A5-3매1조-2도','A4-3등분-3매1조-1도','A4-3등분-3매1조-2도','48절-4매1조-1도','48절-4매1조-2도','32절-4매1조-1도','32절-4매1조-2도','A5-4매1조-1도','A5-4매1조-2도','A4-3등분-4매1조-1도','A4-3등분-4매1조-2도','A4-2매1조-1도','A4-2매1조-2도','16절-2매1조-1도','16절-2매1조-2도','A4-3매1조-1도','A4-3매1조-2도','16절-3매1조-1도','16절-3매1조-2도','A4-4매1조-1도','A4-4매1조-2도','16절-4매1조-1도','16절-4매1조-2도','국전연단위-2매1조-1도','국전연단위-2매1조-2도','46전연단위-2매1조-1도','46전연단위-2매1조-2도','국전연단위-3매1조-1도','국전연단위-3매1조-2도','46전연단위-3매1조-1도','46전연단위-3매1조-2도','4절단면4도','4절양면8도','국2절단면4도','국2절양면8도','2절단면4도','2절양면8도','국전단면4도','국전양면8도','16절단면4도','16절양면8도','A4단면4도','A4양면8도','8절단면4도','8절양면8도','A3단면4도','A3양면8도','기타인쇄물','FTP접수','명함/스티커운송비','전단운송비','봉투운송비','기타운송비','월배송비','부가세','차감액','도무송','도무송','고품격코팅단면4도','고품격코팅양면5도','고품격코팅양면8도','CD(이미지책자)','아크릴명함케이스','종이명함각(100개)','메뉴판끈(5000개)','16절단면4도','16절양면8도','8절단면4도','8절양면8도','A4단면4도','A4양면8도','A3단면4도','A3양면8도','ARR-090040','ARR-090050','ARR-090055','ARR-090060','ARR-090070','ARR-090080','ARR-090090','ARR-090100','AC-70','AC-75','AC-80','AC-85','AC-90','AC-95','AC-100','AC-105','AC-110','AC-115','AC-120','라레단면4도','라레양면5도','라레양면8도','누브단면4도','누브양면5도','누브양면8도','탄트단면4도','탄트양면5도','탄트양면8도','화인라레단면4도','화인라레양면5도','화인라레양면8도','라레160x70단면','라레160x70양면','라레170x80단면','라레170x80양면','라레150x70단면','라레150x70양면','라레155x70단면','라레155x70양면','라레146x76단면','라레146x76양면','라레170x70단면','라레170x70양면','라레156x74단면','라레156x74양면','라레144x64단면','라레144x64양면','누브160x70단면','누브160x70양면','누브170x80단면','누브170x80양면','누브150x70단면','누브150x70양면','누브155x70단면','누브155x70양면','누브146x76단면','누브146x76양면','누브170x70단면','누브170x70양면','누브156x74단면','누브156x74양면','누브144x64단면','누브144x64양면','탄트160x70단면','탄트160x70양면','탄트170x80단면','탄트170x80양면','탄트150x70단면','탄트150x70양면','탄트155x70단면','탄트155x70양면','탄트146x76단면','탄트146x76양면','탄트170x70단면','탄트170x70양면','탄트156x74단면','탄트156x74양면','탄트144x64단면','탄트144x64양면','라레16절단면','라레16절양면','라레A4단면','라레A4양면','라레A5단면','라레A5양면','누브16절단면','누브16절양면','누브A4단면','누브A4양면','누브A5단면','누브A5양면','탄트16절단면','탄트16절양면','탄트A4단면','탄트A4양면','탄트A5단면','탄트A5양면','AR-70','AR-75','AR-80','AR-85','AR-90','AR-95','AR-100','AR-105','AR-110','AR-115','AR-200','ARR-9040','ARR-9050','ARR-9055','ARR-9060','ARR-9070','ARR-9080','ARR-9090','ARR-90100','A4양면2도/2도','16절양면2도/2도','화일지','크라프트지','화일지','크라프트지','화일지','누드플러스','자동스탬프','Fm01(50x17)','Fm02(55x15)','Fm03(55x20)','Fm04(55x25)','Fm05(50x28)','Fm06(50x17)','Fm07(55x20,55x25)','Fm07(55x20,55x25)','Fm08(55x28)','Fm09(60x40)','C-01(60x30)','C-01(60x15)','C-02(75x35)','C-02(75x20)','C-03(67x44)','C-04(84x46)','C-05(85x40)','C-06(90x55)','C-07(80x35)','C-08(85x50)','R-01(10x10)','R-02(10x10)','R-03(11x11)','R-04(11x11)','R-05(13x13)','R-06(13x13)','R-07(15x15)','R-08(15x15)','R-09(15x15)','R-10(20x20)','R-11(20x20)','R-12(25x25)','R-13(30x30)','R-14(35x35)','R-15(38x38)','R-16(40x40)','R-17(45x45)','R-18(50x50)','R-19(55x55)','R-20(60x60)','R-21(65x65)','R-22(70x70)','R-23(75x75)','R-24(80x80)','R-25(85x85)','R-26(150x150)','R-27(105x105)','R-28(140x140)','R-29(100x100)','R-30(130x130)','R-31(95x95)','R-32(120x120)','R-33(90x90)','R-34(110x110)','RA-01(50x20)','RA-02(45x35)','RA-03(55x25)','RA-04(50x35)','RA-05(55x35)','RA-06(50x40)','RA-07(60x30)','RA-08(60x40)','RA-09(65x35)','RA-10(65x45)','RA-11(70x40)','RA-12(75x45)','RA-13(80x50)','RA-14(85x55)','RA-15(90x55)','RA-16(90x60)','RA-17(90x70)','RA-18(95x65)','RA-19(95x75)','RA-20(100x60)','RA-21(100x70)','RA-22(135x105)','RA-23(120x80)','RA-24(135x115)','보통01(85x80)','보통02(65x63)','보통03(35x35)','보통04(13x13)','뚱뚱01(92x64)','뚱뚱02(71x50)','뚱뚱03(50x35)','날씬01(65x71)','날씬02(55x60)','날씬03(35x40)','날씬04(13x13)','F3-01(30x60)','F3-02(30x70)','F3-03(30x80)','F3.5-01(35x60)','F3.5-02(35x70)','F3.5-03(35x80)','F4-01(40x60)','F4-02(40x70)','F4-03(40x80)','F4.5-01(45x60)','F4.5-02(45x70)','F4.5-03(45x80)','F5-01(50x50)','F5-02(50x60)','F6-01(60x60)','F7-01(65x50)','F7-02(65x55)','F7-03(65x65)','F7-04(75x65)','F7-05(85x65)','F7-06(105x65)','F7-07(125x65)','F7-08(145x65)','F8-01(75x50)','F8-02(75x55)','F8-03(75x65)','F8-04(75x75)','F8-05(75x85)','F8-06(105x75)','F8-07(125x75)','F8-08(145x75)','F9-01(85x50)','F9-02(85x55)','F9-03(85x65)','F9-04(85x75)','F9-05(85x85)','F9-06(105x85)','F9-07(125x85)','F9-08(145x85)','F방-01(105x105)','F방-02(105x125)','F방-03(105x145)','F방-04(125x125)','F방-05(125x145)','F방-06(145x145)','Q-01(75x95)','Q-03(100x52)','Q-04(105x95)','Q-05(90x60)','Q-06(67x67)','Q-07(37x43)','Q-08(55x30)','Q-09(65x65)','Q-10(53x47)','Q-11(53x51)','Q-12(80x35)','Q-13(25x10)','Q-14(95x60)','Q-15(82x63)','Q-16(80x73)','Q-17(127x27)','Q-18(70x20)','Q-19(70x56)','Q-20(130x90)','Q-21(100x70)','Q-22(80x70)','Q-23(45x35)','Q-24(40x25)','Q-25(60x15)','Q-26(20x15)','Q-27(40x20)','Q-29(35x35)','Q-30(80x80)','Q-31(95x55)','Q-32(97x83)','Q-33(148x19)','Q-34(148x18)','Q-35(40x30)','Q-36(35x25)','Q-37(30x20)','Q-38(95x55)','Q-39(50x87)','Q-40(70x40)','Q-41(30x70)','Q-42(50x40)','Q-43(45x17)','Q-44(45x17)','Q-45(57x17)','Q-46(57x17)','Q-47(40x90)','Q-48(35x90)','Q-49(50x60)','Q-50(50x60)','Q-51(50x60)','Q-52(35x90)','Q-53(30x20)','Q-54(40x120)','Y-11(30x30)','Y-12(33x30)','Y-13(40x40)','Y-14(40x25)','Y-15(100x70)','Y-16(25x35)','Y-17(80x25)','Y-18(55x35)','Y-19(90x60)','Y-20(95x95)','Y-21(110x80)','아름다운(53x32)','아름다운(55x45)','아름다운(60x40)','아름다운(80x50)','아름다운(90x55)','아름다운(90x60)','아름다운(90x70)','아름다운(90x80)','아름다운(90x90)','아름다운(90x110)','아름다운(90x130)','아름다운(90x150)','80x50','90x55','90x60','90x70','90x80','90x90','90x100','90x110','90x120','90x130','90x140','90x150','별사이즈','투터치','도무송','200스노우-13매','200스노우-14매','200스노우-15매','250스노우-13매','250스노우-14매','250스노우-15매','누브지-13매','누브지-14매','누브지-15매','무지봉투(100모조)','창문봉투(자켓형)','화인누브단면4도','화인누브양면5도','화인누브양면8도','화인스노우단면4도','화인스노우양면5도','화인스노우양면8도','화이트유광단면4도','화이트유광양면5도','화이트유광양면8도','코팅70x40','무코팅70x40','코팅70x40','무코팅70x40','A4양면1도/1도','16절양면1도/1도','화인라레단면4도','화인라레양면5도','화인라레양면8도','랑데뷰화이트단면4도','랑데뷰화이트양면5도','랑데뷰화이트양면8도','90x60','90x70','90x80','90x90','90x100','90x110','90x120','90x130','90x140','90x150','사각별사이즈','45Φ/38x55','50Φ/41x60','55Φ/44x65','65Φ/55x80','70Φ/65x90','별사이즈','사각89x50','귀돌이88x52','4절특대봉투','5절자켓대봉투','6절중봉투','9절중봉투','창문봉투','규격봉투','수강료봉투','부동산소봉투','카드봉투1','카드봉투2','카드봉투3','카드봉투4','카드봉투5','티켓봉투','A3단면4도','A3양면8도','A3단면4도','A3양면8도','A3단면4도','A3양면8도','64절단면4도','64절양면8도','32절단면4도','32절양면8도','16절단면4도','16절양면8도','8절단면4도','8절양면8도','4절단면4도','4절양면8도','2절단면4도','2절양면8도','A6단면4도','A6양면8도','A5단면4도','A5양면8도','A4단면4도','A4양면8도','A3단면4도','A3양면8도','A2단면4도','A2양면8도','국전지단면4도','국전지양면8도','누드금펄단면4도','누드은펄단면4도','80x50','90x55','90x60','90x70','90x80','90x90','90x100','90x110','90x120','90x130','90x140','90x150','별사이즈','투터치','도무송','60x40','70x40','2절단면1도','2절단면2도','A1단면1도','A1단면2도','A1양면2도/2도','2절양면2도/2도','A1양면1도/1도','2절양면1도/1도','MK은펄플러스단면4도','MK은펄플러스양면5도','MK은펄플러스양면8도','MK금펄플러스단면4도','MK금펄플러스양면5도','MK금펄플러스양면8도','MK헤어라인실버단면4도','MK헤어라인실버양면5도','MK헤어라인실버양면8도','MK헤어라인골드단면4도','MK헤어라인골드양면5도','MK헤어라인골드양면8도','270울트라화이트단면4도','270울트라화이트양면5도','270울트라화이트양면8도','16절-연단가/1도','16절-연단가/2도','A4-연단가/1도','A4-연단가/2도','16절-연단가/1도','16절-연단가/2도','A4-연단가/1도','A4-연단가/2도','16절-연단가/1도','16절-연단가/2도','A4-연단가/1도','A4-연단가/2도','48절-1조2매-1도','48절-1조2매-2도','48절-1조2매-3도','A4-3등분-1조2매-1도','A4-3등분-1조2매-2도','A4-3등분-1조2매-3도','16절-1조2매-1도','16절-1조2매-2도','16절-1조2매-3도','A4-1조2매-1도','A4-1조2매-2도','A4-1조2매-3도','48절-1조3매-1도','48절-1조3매-2도','48절-1조3매-3도','48절-1조3매-4도','A4-3등분-1조3매-1도','A4-3등분-1조3매-2도','A4-3등분-1조3매-3도','A4-3등분-1조3매-4도','16절-1조3매-1도','16절-1조3매-2도','16절-1조3매-3도','16절-1조3매-4도','A4-1조3매-1도','A4-1조3매-2도','A4-1조3매-3도','A4-1조3매-4도','48절-1조4매-1도','48절-1조4매-2도','48절-1조4매-3도','48절-1조4매-4도','48절-1조4매-5도','A4-3등분-1조4매-1도','A4-3등분-1조4매-2도','A4-3등분-1조4매-3도','A4-3등분-1조4매-4도','A4-3등분-1조4매-5도','16절-1조4매-1도','16절-1조4매-2도','16절-1조4매-3도','16절-1조4매-4도','16절-1조4매-5도','A4-1조4매-1도','A4-1조4매-2도','A4-1조4매-3도','A4-1조4매-4도','A4-1조4매-5도','120모조백색','체크레자크91백색110g','줄레자크92백색110g','120모조백색','체크레자크91백색110g','줄레자크92백색110g','100모조백색','120모조백색','체크레자크91백색110g','줄레자크92백색110g','100모조백색','120모조백색','체크레자크91백색110g','줄레자크92백색110g','A3단면4도','A3양면8도','A4단면4도','A4양면8도','A3단면4도','A3양면8도','A4단면4도','A4양면8도','탄트-8절-2단','탄트-A3-2단','탄트-국3절-3단','키칼라-8절-2단','키칼라-A3-2단','키칼라-국3절-3단','스코-8절-2단','스코-A3-2단','스코-국3절-3단','유포지-8절-2단','유포지-A3-2단','유포지-국3절-3단','카멜레온-8절-2단','카멜레온-A3-2단','카멜레온-국3절-3단','컨셉-8절-2단','컨셉-A3-2단','컨셉-국3절-3단','키칼라아이스골드-8절-2단','키칼라아이스골드-A3-2단','키칼라아이스골드-국3절-3단','스타골드-8절-2단','스타골드-A3-2단','스타골드-국3절-3단','랑데뷰-8절-2단','랑데뷰-A3-2단','랑데뷰-국3절-3단','누브4도에폭단면','누브8도에폭단면','누브8도에폭양면','비코팅4도에폭단면','비코팅8도에폭단면','비코팅8도에폭양면','스타드림4도에폭단면','스타드림8도에폭단면','스타드림8도에폭양면','무광코팅4도에폭단면','무광코팅8도에폭단면','무광코팅8도에폭양면','유포지4도에폭단면','유포지8도에폭단면','유포지8도에폭양면','앙코르단면4도','앙코르양면5도','앙코르양면8도','마제스틱단면4도','마제스틱양면5도','마제스틱양면8도','스타더스트단면4도','스타더스트양면5도','스타더스트양면8도','루프단면4도','루프양면5도','루프양면8도','크라프트단면4도','크라프트양면5도','크라프트양면8도','대례지단면4도','대례지양면5도','대례지양면8도','라레화이트펄단면4도','라레화이트펄양면5도','라레화이트펄양면8도','라레골드펄단면4도','라레골드펄양면5도','라레골드펄양면8도','양면무늬탄트단면4도','양면무늬탄트양면5도','양면무늬탄트양면8도','신형장32절단면4도','신형장32절양면8도','신형장A5단면4도','신형장A5양면8도','48절(100매철)-1도','48절(100매철)-2도','16절(100매철)-1도','16절(100매철)-2도','A4-3등분(100매철)-1도','A4-3등분(100매철)-2도','A4(100매철)-1도','A4(100매철)-2도','48절(100매철)-1도','48절(100매철)-2도','16절(100매철)-1도','16절(100매철)-2도','A4-3등분(100매철)-1도','A4-3등분(100매철)-2도','A4(100매철)-1도','A4(100매철)-2도','16절-연단가/1도','16절-연단가/2도','A4-연단가/1도','A4-연단가/2도','16절-연단가/1도','16절-연단가/2도','A4-연단가/1도','A4-연단가/2도','350엑스트라퓨어단면4도','350엑스트라퓨어양면8도','350엑스트라매트단면4도','350엑스트라매트양면8도','비코팅단면4도','비코팅양면8도','코팅단면4도','코팅양면8도','누브단면4도','누브양면8도','국3절-3단','120모조백색','체크레자크91백색110g','줄레자크92백색110g','100모조백색','120모조백색','체크레자크91백색110g','줄레자크92백색110g','100모조백색','120모조백색','체크레자크91백색110g','줄레자크92백색110g','120모조백색','체크레자크91백색110g','줄레자크92백색110g','배너거치대','실사출력','현수막','폼보드','폼맥스','4절대봉투(290*390)','5절대봉투(245*332)','6절대봉투(215*300)','9절대봉투(190*260)','10절대봉투(140*300)','12절대봉투(140*260)','A4다대봉투(105*220)','A4자켓봉투(105*220)','A4창문봉투(105*220)','티켓봉투(85*175)','수강료봉투(100*205)','월급봉투(110*200)','카드봉투(135*195)','카드봉투(130*180)','카드봉투(120*180)','카드봉투(120*190)','카드봉투(115*165)','장교A봉투(105*235)','장교B봉투(100*210)','장교C봉투(95*188)','항공봉투(105*235)','16절다대봉투(100*200)','16절이중봉투(100*205)','16절황봉투(100*205)','16절크라프트(100*205)','16절색지봉투(100*205)','부동산봉투(230*120)','띤또레또단면4도','띤또레또양면8도','뉴에코크라프트단면','뉴에코크라프트양면','뉴블랙단면','뉴블랙양면','딥블루단면','딥블루양면','레드단면','레드양면','코코단면','코코양면');
var KWidth = new Array('86','86','86','86','86','86','90','90','90','90','90','90','86','86','86','86','86','86','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','86','86','86','86','86','86','86','86','86','86','86','86','86','86','86','86','86','86','86','86','86','86','86','86','86','86','86','86','90','90','90','86','160','160','170','170','150','150','155','155','146','146','170','170','156','156','144','144','160','160','170','170','150','150','155','155','146','146','170','170','156','156','144','144','160','160','170','170','150','150','155','155','146','146','170','170','156','156','144','144','160','160','170','170','150','150','155','155','146','146','170','170','156','156','144','144','160','160','170','170','150','150','155','155','146','146','170','170','156','156','144','144','160','160','170','170','150','150','155','155','146','146','170','170','156','156','144','144','160','160','170','170','150','150','155','155','146','146','170','170','156','156','144','144','160','160','170','170','150','150','155','155','146','146','170','170','156','156','144','144','160','160','170','170','150','150','155','155','146','146','170','170','156','156','144','144','160','160','170','170','150','150','155','155','146','146','170','170','156','156','144','144','160','160','170','170','150','150','155','155','146','146','170','170','156','156','144','144','182','182','210','210','148','148','182','182','210','210','148','148','182','182','210','210','148','148','182','182','210','210','148','148','182','182','210','210','148','148','182','182','210','210','148','148','182','182','210','210','148','148','182','182','210','210','148','148','182','182','210','210','148','148','182','182','210','210','148','148','182','182','210','210','148','148','86','86','86','86','86','86','86','86','86','89','89','89','110','110','110','120','120','120','130','130','130','154','154','154','84','84','84','122','122','122','96','96','96','98','98','98','163','163','163','122','122','122','122','122','122','120','120','120','117','117','117','133','133','133','118','118','118','118','118','118','84','118','122','117','96','98','118','142','176','122','122','120','86','106','116','126','139','95','136','154','0','60','80','90','90','90','90','90','90','90','90','90','90','90','60','80','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','60','60','60','80','90','90','90','90','90','90','90','90','90','90','90','60','80','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','60','60','80','90','90','90','90','90','90','90','90','90','90','90','90','90','80','90','90','90','90','90','90','90','90','90','90','90','90','90','55','55','50','50','50','72','77','82','87','75','79','83','87','70','73','77','79','82','91','100','73','79','83','89','93','53','55','58','60','65','70','75','60','60','60','52','52','65','65','65','65','65','63','73','72','77','82','87','75','79','83','87','70','73','77','79','82','91','100','73','79','83','89','93','53','55','58','60','65','70','75','60','60','60','65','65','70','70','72','77','82','87','75','79','83','87','70','73','76','79','82','91','100','73','79','83','89','93','53','55','58','60','65','70','75','72','77','82','87','75','79','83','87','70','73','77','79','82','91','100','73','79','83','89','93','53','55','58','60','65','70','75','158','87','55','64','75','98','127','89.5','89.5','127','127','182','182','257','257','103.5','103.5','147','147','210','210','297','297','367','367','423','423','181','181','209','209','127','127','182','182','257','257','147','147','210','210','297','297','127','127','182','182','257','257','147','147','210','210','297','297','90','127','182','256','89.5','89.5','127','127','182','182','257','257','367','367','517','517','103.5','103.5','147','147','210','210','297','297','423','423','598','598','181','181','260','260','366','366','209','209','299','299','90','90','102','102','89.5','89.5','127','127','182','182','257','257','367','367','103.5','103.5','147','147','210','210','297','297','423','423','517','367','423','598','210','210','210','210','210','210','210','210','420','620','840','367','420','620','367','420','620','367','420','620','367','420','620','367','420','620','367','420','620','367','420','620','367','420','620','367','420','620','367','420','620','367','420','620','220','220','220','220','215','215','215','215','228','228','215','215','225','225','225','225','225','225','330','330','330','105','105','105','105','330','330','330','330','330','330','105','105','105','105','105','105','105','105','290','245','215','190','140','140','245','245','290','245','215','190','100','100','100','100','100','100','100','105','100','95','105','100','105','105','110','85','105','105','105','110','135','130','120','120','115','190','190','190','190','210','210','99','99','210','210','190','190','610','610','763','763','610','610','763','763','190','190','190','190','210','210','99','99','190','190','190','190','210','210','99','99','190','190','190','190','210','210','99','99','210','210','190','190','210','210','190','190','210','210','190','190','610','610','763','763','610','610','763','763','367','367','423','423','517','517','598','598','182','182','210','210','257','257','297','297','0','0','0','0','0','0','0','0','0','90','90','89','89','89','0','0','0','0','182','182','257','257','210','210','297','297','100','100','100','100','100','100','100','100','80','85','90','95','100','105','110','115','120','125','130','90','90','90','90','90','90','90','90','90','88','88','88','160','160','170','170','150','150','155','155','146','146','170','170','156','156','144','144','160','160','170','170','150','150','155','155','146','146','170','170','156','156','144','144','160','160','170','170','150','150','155','155','146','146','170','170','156','156','144','144','182','182','210','210','148','148','182','182','210','210','148','148','182','182','210','210','148','148','80','85','90','95','100','105','110','115','120','125','210','100','100','100','100','100','100','100','100','210','182','330','105','105','105','105','86','0','55','60','60','60','55','55','60','60','60','65','65','65','80','80','72','89','90','95','85','90','67','67','72','72','82','83','55','72.5','90','50','70','85','70','80','85','90','50','55','60','65','70','75','80','85','90','155','110','145','105','135','100','125','95','115','55','77.5','60','55','60','55','65','65','70','70','75','80','85','90','95','95','95','100','100','105','105','140','125','140','90','70','80','83','97','76','55','70','60','80','83','65','75','85','65','75','85','65','75','85','65','75','85','55','65','65','70','70','70','80','90','110','130','150.5','80','80','80','80','90','110','130','150','90','90','90','90','90','110','130','150','110','110','110','130','130','150','80','105','110','95','72','84','67.5','70','58','58','85','60','100','87','85','132','75','75','135','105','85','50','90','65','80','100','120','85','100','102','153','153','155','130','105','120','110','90','105','90','50','50','62','62','90','80','110','110','110','80','70','45','70','74','90','60','105','78','85','60','95','100','115','58','60','65','90','95','95','95','95','95','95','95','95','80','90','90','90','90','90','90','90','90','90','90','90','90','90','90','230','230','230','230','230','230','230','230','230','230','105','88','88','88','88','88','88','86','86','86','70','70','70','70','210','182','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','38','41','44','55','65','38','89','88','290','245','215','190','105','100','110','120','130','115','120','120','135','85','297','297','297','297','297','297','89.5','89.5','127','127','182','182','257','257','367','367','517','517','103.5','103.5','147','147','210','210','297','297','423','423','598','598','86','86','80','90','90','90','90','90','90','90','90','90','90','90','90','90','90','60','70','517','517','598','598','598','517','598','517','86','86','86','86','86','86','86','86','86','86','86','86','90','90','90','190','190','210','210','190','190','210','210','190','190','210','210','190','190','190','99','99','99','190','190','190','210','210','210','190','190','190','190','99','99','99','99','190','190','190','190','210','210','210','210','190','190','190','190','190','99','99','99','99','99','190','190','190','190','190','210','210','210','210','210','300','300','300','260','260','260','220','220','220','220','175','175','175','175','297','297','210','210','297','297','210','210','367','420','620','367','420','620','367','420','620','367','420','620','367','420','620','367','420','620','367','420','620','367','420','620','367','420','620','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','90','102','102','190','190','190','190','99','99','210','210','190','190','190','190','99','99','210','210','190','190','210','210','190','190','210','210','90','90','90','90','90','90','90','90','90','90','620','230','230','230','175','175','175','175','200','200','200','200','230','230','230','100','100','100','100','100','290','245','215','190','140','140','105','105','105','85','100','110','135','130','120','120','115','105','100','95','105','100','100','100','100','100','230','90','90','90','90','90','90','90','90','90','90','90','90');
var KHeight = new Array('52','52','52','52','52','52','50','50','50','50','50','50','52','52','52','52','52','52','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','54','54','54','54','54','54','54','54','54','54','54','54','54','54','54','54','54','54','54','54','54','54','54','54','54','54','54','54','50','50','50','54','70','70','80','80','70','70','70','70','76','76','70','70','74','74','64','64','70','70','80','80','70','70','70','70','76','76','70','70','74','74','64','64','70','70','80','80','70','70','70','70','76','76','70','70','74','74','64','64','70','70','80','80','70','70','70','70','76','76','70','70','74','74','64','64','70','70','80','80','70','70','70','70','76','76','70','70','74','74','64','64','70','70','80','80','70','70','70','70','76','76','70','70','74','74','64','64','70','70','80','80','70','70','70','70','76','76','70','70','74','74','64','64','70','70','80','80','70','70','70','70','76','76','70','70','74','74','64','64','70','70','80','80','70','70','70','70','76','76','70','70','74','74','64','64','70','70','80','80','70','70','70','70','76','76','70','70','74','74','64','64','70','70','80','80','70','70','70','70','76','76','70','70','74','74','64','64','257','257','297','297','210','210','257','257','297','297','210','210','257','257','297','297','210','210','257','257','297','297','210','210','257','257','297','297','210','210','257','257','297','297','210','210','257','257','297','297','210','210','257','257','297','297','210','210','257','257','297','297','210','210','257','257','297','297','210','210','257','257','297','297','210','210','52','52','52','106','106','106','133','133','133','59','59','59','75','75','75','84','84','84','92','92','92','104','104','104','95','95','95','70','70','70','123','123','123','108','108','108','108','108','108','88','88','88','88','88','88','88','88','88','88','88','88','78','78','78','88','88','88','88','88','88','95','88','70','88','123','108','88','106','122','88','88','88','52','86','81','90','92','65','98','104','0','40','50','55','60','70','80','90','100','110','120','130','140','150','40','50','55','60','70','80','90','100','110','120','130','140','150','55','55','55','55','40','40','40','50','55','60','70','80','90','100','110','120','130','140','150','40','50','55','60','70','80','90','100','110','120','130','140','150','55','55','55','55','40','40','50','55','60','70','80','90','100','110','120','130','140','150','55','55','50','55','60','70','80','90','100','110','120','130','140','150','55','55','24','33','30','20','17','46','49','52','55','41','43','45','47','49','51','53','55','57','35','38','40','43','45','48','50','53','55','58','60','65','70','75','47','53','73','53','59','43','47','53','61','79','45','50','46','49','52','55','41','43','45','47','49','51','53','55','57','35','38','40','43','45','48','50','53','55','58','60','65','70','75','53','63','73','63','73','63','73','40','43','46','49','37','39','41','43','45','47','49','51','53','33','36','38','41','43','46','48','51','53','56','58','63','68','73','46','49','52','55','41','43','45','47','49','51','53','55','57','35','38','40','43','45','48','50','53','55','58','60','65','70','75','51','103','63','59','67','93','127','127','127','182','182','257','257','367','367','147','147','210','210','297','297','423','423','517','517','597','597','256','256','296','296','182','182','257','257','367','367','210','210','297','297','423','423','182','182','257','257','367','367','210','210','297','297','423','423','127','182','256','366','127','127','182','182','257','257','367','367','517','517','737','737','147','147','210','210','297','297','423','423','597','597','852','852','256','256','374','374','516','516','296','296','422','422','260','260','296','296','127','127','182','182','257','257','367','367','517','517','147','147','210','210','297','297','423','423','597','597','737','517','597','852','297','297','297','297','297','297','297','297','297','288','297','257','297','297','257','297','297','257','297','297','257','297','297','257','297','297','257','297','297','257','297','297','257','297','297','257','297','297','257','297','297','257','297','297','310','310','310','310','302','302','302','302','290','290','300','300','310','310','310','310','310','310','245','245','245','220','220','220','220','245','245','245','245','245','245','220','220','220','220','220','220','220','220','390','335','300','265','300','265','330','330','390','335','300','265','200','200','205','205','205','200','205','235','210','188','220','235','235','220','200','175','220','220','220','200','195','180','180','190','165','85','85','130','130','148','148','210','210','297','297','260','260','864','864','1060','1060','864','864','1060','1060','85','85','130','130','148','148','210','210','85','85','130','130','148','148','210','210','85','85','130','130','148','148','210','210','297','297','260','260','297','297','260','260','297','297','260','260','864','864','1060','1060','864','864','1060','1060','517','517','597','597','737','737','852','852','257','257','297','297','367','367','423','423','0','0','0','0','0','0','0','0','0','55','55','50','50','50','0','0','0','0','257','257','367','367','297','297','423','423','50','60','65','70','80','90','100','110','80','85','90','95','100','105','110','115','120','125','130','50','50','50','50','50','50','50','50','50','52','52','52','70','70','80','80','70','70','70','70','76','76','70','70','74','74','64','64','70','70','80','80','70','70','70','70','76','76','70','70','74','74','64','64','70','70','80','80','70','70','70','70','76','76','70','70','74','74','64','64','257','257','297','297','210','210','257','257','297','297','210','210','257','257','297','297','210','210','80','85','90','95','100','105','110','115','120','125','210','50','60','65','70','80','90','100','110','297','257','245','220','220','220','220','54','0','41','37','47','57','63','41','52','52','63','45','55','55','65.5','65.5','49','51','45','60','40','55','28','41','30','44','34','50','37.5','37.5','37.5','50','47.5','30','35','40','43','45','50','55','60','65','70','75','80','85','90','155','110','145','105','135','100','125','95','115','47.5','50','30','40','40','45','35','45','40','50','45','50','55','60','60','65','75','70','80','65','75','110','85','120','85','68','40','50','69','55','80','76','65','45','34','35','35','35','40','40','40','45','45','45','50','50','50','55','55','65','55','60','70','70','70','70','70','70.5','55','60','70','80','80','80','80','80','55','60','70','80','90','90','90','90','110','130','150','130','150','150','100','57','100','65','72','48','60','70','52','56','40','65.5','65','68','78','64','50','61','95','75','75','80','90','100','50','45','80','85','60','88','48','116','85','75','65','100','92','75','75','55','41.5','61.5','41.5','61.5','95','95','65','65','65','95','50','125','35','35','45','45','75','30','30','40','65','100','85','37','50','45','60','60','65','75','85','95','115','135','155','50','55','60','70','80','90','100','110','120','130','140','150','55','55','55','165','165','165','165','165','165','165','165','165','165','220','52','52','52','52','52','52','54','54','54','40','40','40','40','297','257','50','50','50','50','50','50','60','70','80','90','100','110','120','130','140','150','60','55','60','65','80','90','55','50','52','390','330','300','260','220','200','200','230','180','165','190','180','195','175','423','423','423','423','423','423','127','127','182','182','257','257','367','367','517','517','737','737','147','147','210','210','297','297','423','423','597','597','852','852','54','54','50','55','60','70','80','90','100','110','120','130','140','150','55','55','55','40','40','737','737','852','852','852','737','852','737','54','54','54','54','54','54','54','54','54','54','54','54','50','50','50','260','260','297','297','260','260','297','297','260','260','297','297','85','85','85','210','210','210','260','260','260','297','297','297','85','85','85','85','210','210','210','210','260','260','260','260','297','297','297','297','85','85','85','85','85','210','210','210','210','210','260','260','260','260','260','297','297','297','297','297','215','215','215','190','190','190','105','105','105','105','85','85','85','85','423','423','297','297','423','423','297','297','257','297','297','257','297','297','257','297','297','257','297','297','257','297','297','257','297','297','257','297','297','257','297','297','257','297','297','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','50','260','260','296','296','85','85','260','260','210','210','297','297','85','85','260','260','210','210','297','297','260','260','297','297','260','260','297','297','50','50','50','50','50','50','50','50','50','50','297','120','120','120','90','90','90','90','100','100','100','100','120','120','120','100','100','100','100','100','390','332','300','260','300','260','220','220','220','175','205','200','195','180','180','190','165','235','210','188','235','200','205','205','205','205','120','50','50','50','50','50','50','50','50','50','50','50','50');
var KColor = new Array('4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','8','8','8','8','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','8','4','8','4','8','4','8','4','8','4','8','4','8','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','4','4','4','4','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','0','0','0','0','0','0','0','0','0','4','4','4','5','8','0','0','0','0','4','8','4','8','4','8','4','8','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','5','8','4','5','8','4','5','8','4','5','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','5','0','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','5','8','4','5','8','4','5','8','4','4','4','4','2','2','4','5','8','4','5','8','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','0','0','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','8','4','4','4','8','4','8','4','8','4','8','4','8','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','1','2','1','2','4','4','2','2','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','1','2','1','2','1','2','1','2','1','2','1','2','1','2','3','1','2','3','1','2','3','1','2','3','1','2','3','4','1','2','3','4','1','2','3','4','1','2','3','4','1','2','3','4','5','1','2','3','4','5','1','2','3','4','5','1','2','3','4','5','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','8','4','8','4','8','4','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','8','4','8','8','4','8','8','4','8','8','4','8','8','4','8','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','5','8','4','8','4','8','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','1','2','4','8','4','8','4','8','4','8','4','8','8','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','4','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','1','4','8','4','8','4','8','4','8','4','8','4','8');
var Paper_Name_count = 175;
var Paper_Name = new Array('70모조','80모조','100모조','120모조','150모조','180모조','220모조','260모조','70미색모조','80미색모조','100미색모조','100스노우','120스노우','150스노우','180스노우','200스노우','250스노우','300스노우','100아트','120아트','150아트','180아트','200아트','250아트','300아트','라레','누브','탄트지','화인라레','스타드림','키칼라','그레이스','빌리지','머쉬멜로우','스코틀랜드','팝셋','유포지','카멜레온','컨셉','키칼라아이스골드','스타골드','심볼','화이트카드','누드카드','골드플러스카드','실버플러스카드','골드카드','실버카드','거울카드','금펄카드','은펄카드','레인보우','리치골드카드','리치실버카드','블랙카드','블루카드','레드카드','아이보리카드','PP원단','스티커','강접스티커','유포지스티커','은데드롱스티커','NCR','스지','70모조노랑','70모조초록','70모조하늘','70모조분홍','70크라프트지','양크라프트지','98크라프트지','레자크64백색','레자크64크림색','레자크64연갈색','레자크66베이지색','레자크71미색','레자크75하늘색','레자크75쥐색','레자크83백색','레자크83연보라색','레자크87백색','레자크87연연두색','레자크87연분홍색','레자크87연황색','레자크87연옥색','레자크88연미색','레자크88베이지색','레자크88연갈색','레자크88연분홍색','레자크88연보라색','레자크90백색','레자크90연미색','레자크90베이지색','레자크90호두색','레자크91백색','레자크91연미색','레자크91은회색','레자크91계란색','레자크91황갈색','레자크92백색','레자크92연미색','레자크92옥색','레자크94연미색','레자크95백색','레자크96백색','레자크96아이보리색','탄트지백색','탄트지아이보리색','탄트지연옥색','탄트지연회색','레이드백색','레이드연미색','레이드연연두색','레이드연청색','레이드연분홍색','밍크지백색','밍크지연옥색','밍크지백회색','밍크지크림색','밍크지계란색','밍크지분홍색','밍크지연분홍색','밍크지회황색','밍크지은회색','밍크지황회색','밍크지회갈색','밍크지연연두색','밍크지옥색','밍크지연보라색','밍크지연청색','화일지','투명스티커','화인누보','화인스노우','랑데뷰화이트','레자크A형','레자크B형','레자크C형','레자크D형','레자크E형','80코트지','80모조스티커','98크라프트지','울트라화이트','216아트','앙코르','마제스틱','스타더스트','루프','크라프트','대례지','라레화이트펄','라레골드펄','양면무늬탄트지','백색지45g','백색지90g','적색(분홍)지45g','적색(분홍)지90g','황색지45g','황색지90g','청색(옥색)지45g','청색(옥색)지90g','녹색(연두)지45g','녹색(연두)지90g','엑스트라퓨어','엑스트라매트','띤또레또250g','뉴에코크라프트250g','뉴블랙216g','딥블루216g','레드216g','코코298g','운송비','기타');
var AccuracyC_B = new Array('5000','6000','7000','8000','9000','11000','14000','16000','5000','6000','7000','6000','7000','9000','11000','13000','15000','18000','6000','7000','9000','11000','13000','15000','18000','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var AccuracyC_A = new Array('6000','7000','9000','10000','13000','15000','19000','23000','6000','7000','9000','9000','10000','12000','15000','17000','21000','25000','9000','10000','12000','15000','17000','21000','25000','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0','0');
var Paper_0_count = 3;
var Paper_0_Code = new Array('16','22','145');
var Paper_0_Name = new Array('250스노우','200아트','216아트');
var Paper_1_count = 3;
var Paper_1_Code = new Array('16','22','145');
var Paper_1_Name = new Array('250스노우','200아트','216아트');
var Paper_2_count = 2;
var Paper_2_Code = new Array('22','145');
var Paper_2_Name = new Array('200아트','216아트');
var Paper_3_count = 1;
var Paper_3_Code = new Array('16');
var Paper_3_Name = new Array('250스노우');
var Paper_4_count = 5;
var Paper_4_Code = new Array('25','26','27','28','167');
var Paper_4_Name = new Array('라레','누브','탄트지','화인라레','띤또레또250g');
var Paper_5_count = 30;
var Paper_5_Code = new Array('25','26','27','28','29','30','31','32','33','34','35','36','37','38','39','40','41','135','144','146','147','148','149','150','151','152','153','165','166','167');
var Paper_5_Name = new Array('라레','누브','탄트지','화인라레','스타드림','키칼라','그레이스','빌리지','머쉬멜로우','스코틀랜드','팝셋','유포지','카멜레온','컨셉','키칼라아이스골드','스타골드','심볼','랑데뷰화이트','울트라화이트','앙코르','마제스틱','스타더스트','루프','크라프트','대례지','라레화이트펄','라레골드펄','엑스트라퓨어','엑스트라매트','띤또레또250g');
var Paper_6_count = 10;
var Paper_6_Code = new Array('42','43','44','45','46','47','48','49','50','51');
var Paper_6_Name = new Array('화이트카드','누드카드','골드플러스카드','실버플러스카드','골드카드','실버카드','거울카드','금펄카드','은펄카드','레인보우');
var Paper_7_count = 13;
var Paper_7_Code = new Array('42','46','47','52','53','54','55','56','57','134','144','165','166');
var Paper_7_Name = new Array('화이트카드','골드카드','실버카드','리치골드카드','리치실버카드','블랙카드','블루카드','레드카드','아이보리카드','화인스노우','울트라화이트','엑스트라퓨어','엑스트라매트');
var Paper_8_count = 2;
var Paper_8_Code = new Array('16','22');
var Paper_8_Name = new Array('250스노우','200아트');
var Paper_9_count = 4;
var Paper_9_Code = new Array('25','26','27','167');
var Paper_9_Name = new Array('라레','누브','탄트지','띤또레또250g');
var Paper_10_count = 3;
var Paper_10_Code = new Array('29','30','31');
var Paper_10_Name = new Array('스타드림','키칼라','그레이스');
var Paper_11_count = 7;
var Paper_11_Code = new Array('25','26','27','32','33','34','167');
var Paper_11_Name = new Array('라레','누브','탄트지','빌리지','머쉬멜로우','스코틀랜드','띤또레또250g');
var Paper_12_count = 2;
var Paper_12_Code = new Array('16','22');
var Paper_12_Name = new Array('250스노우','200아트');
var Paper_13_count = 4;
var Paper_13_Code = new Array('25','26','27','167');
var Paper_13_Name = new Array('라레','누브','탄트지','띤또레또250g');
var Paper_14_count = 9;
var Paper_14_Code = new Array('26','27','28','29','30','31','32','33','34');
var Paper_14_Name = new Array('누브','탄트지','화인라레','스타드림','키칼라','그레이스','빌리지','머쉬멜로우','스코틀랜드');
var Paper_15_count = 1;
var Paper_15_Code = new Array('22');
var Paper_15_Name = new Array('200아트');
var Paper_16_count = 1;
var Paper_16_Code = new Array('22');
var Paper_16_Name = new Array('200아트');
var Paper_17_count = 1;
var Paper_17_Code = new Array('58');
var Paper_17_Name = new Array('PP원단');
var Paper_18_count = 1;
var Paper_18_Code = new Array('200');
var Paper_18_Name = new Array('기타');
var Paper_19_count = 1;
var Paper_19_Code = new Array('59');
var Paper_19_Name = new Array('스티커');
var Paper_20_count = 1;
var Paper_20_Code = new Array('60');
var Paper_20_Name = new Array('강접스티커');
var Paper_21_count = 1;
var Paper_21_Code = new Array('61');
var Paper_21_Name = new Array('유포지스티커');
var Paper_22_count = 1;
var Paper_22_Code = new Array('62');
var Paper_22_Name = new Array('은데드롱스티커');
var Paper_23_count = 1;
var Paper_23_Code = new Array('59');
var Paper_23_Name = new Array('스티커');
var Paper_24_count = 1;
var Paper_24_Code = new Array('59');
var Paper_24_Name = new Array('스티커');
var Paper_25_count = 1;
var Paper_25_Code = new Array('59');
var Paper_25_Name = new Array('스티커');
var Paper_26_count = 1;
var Paper_26_Code = new Array('59');
var Paper_26_Name = new Array('스티커');
var Paper_27_count = 1;
var Paper_27_Code = new Array('59');
var Paper_27_Name = new Array('스티커');
var Paper_28_count = 1;
var Paper_28_Code = new Array('59');
var Paper_28_Name = new Array('스티커');
var Paper_29_count = 1;
var Paper_29_Code = new Array('59');
var Paper_29_Name = new Array('스티커');
var Paper_30_count = 1;
var Paper_30_Code = new Array('59');
var Paper_30_Name = new Array('스티커');
var Paper_31_count = 1;
var Paper_31_Code = new Array('59');
var Paper_31_Name = new Array('스티커');
var Paper_32_count = 1;
var Paper_32_Code = new Array('59');
var Paper_32_Name = new Array('스티커');
var Paper_33_count = 1;
var Paper_33_Code = new Array('18');
var Paper_33_Name = new Array('100아트');
var Paper_34_count = 1;
var Paper_34_Code = new Array('18');
var Paper_34_Name = new Array('100아트');
var Paper_35_count = 1;
var Paper_35_Code = new Array('1');
var Paper_35_Name = new Array('80모조');
var Paper_36_count = 1;
var Paper_36_Code = new Array('20');
var Paper_36_Name = new Array('150아트');
var Paper_37_count = 1;
var Paper_37_Code = new Array('17');
var Paper_37_Name = new Array('300스노우');
var Paper_38_count = 25;
var Paper_38_Code = new Array('0','1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20','21','22','23','24');
var Paper_38_Name = new Array('70모조','80모조','100모조','120모조','150모조','180모조','220모조','260모조','70미색모조','80미색모조','100미색모조','100스노우','120스노우','150스노우','180스노우','200스노우','250스노우','300스노우','100아트','120아트','150아트','180아트','200아트','250아트','300아트');
var Paper_38_Cost_B = new Array('-39000','-35000','-25000','-13000','3000','20000','47000','71000','-39000','-35000','-25000','-25000','-16000','0','17000','32000','60000','89000','-25000','-16000','0','17000','32000','60000','89000');
var Paper_38_Cost_A = new Array('-27000','-24000','-17000','-9000','2000','14000','33000','49000','-27000','-24000','-17000','-17000','-11000','0','12000','23000','43000','62000','-17000','-11000','0','12000','23000','43000','62000');
var Paper_39_count = 14;
var Paper_39_Code = new Array('11','12','13','14','15','16','17','18','19','20','21','22','23','24');
var Paper_39_Name = new Array('100스노우','120스노우','150스노우','180스노우','200스노우','250스노우','300스노우','100아트','120아트','150아트','180아트','200아트','250아트','300아트');
var Paper_39_Cost_B = new Array('-28000','-18000','0','18000','36000','67000','99000','-28000','-18000','0','18000','33000','63000','99000');
var Paper_39_Cost_A = new Array('-18000','-11000','0','13000','25000','47000','70000','-20000','-13000','0','13000','25000','47000','70000');
var Paper_40_count = 14;
var Paper_40_Code = new Array('11','12','13','14','15','16','17','18','19','20','21','22','23','24');
var Paper_40_Name = new Array('100스노우','120스노우','150스노우','180스노우','200스노우','250스노우','300스노우','100아트','120아트','150아트','180아트','200아트','250아트','300아트');
var Paper_40_Cost_B = new Array('-28000','-28000','0','18000','36000','67000','99000','-28000','-18000','0','18000','36000','67000','99000');
var Paper_40_Cost_A = new Array('-18000','-11000','0','13000','25000','47000','70000','-20000','-13000','0','13000','25000','47000','70000');
var Paper_41_count = 24;
var Paper_41_Code = new Array('0','1','2','3','4','5','6','7','9','10','11','12','13','14','15','16','17','18','19','20','21','22','23','24');
var Paper_41_Name = new Array('70모조','80모조','100모조','120모조','150모조','180모조','220모조','260모조','80미색모조','100미색모조','100스노우','120스노우','150스노우','180스노우','200스노우','250스노우','300스노우','100아트','120아트','150아트','180아트','200아트','250아트','300아트');
var Paper_41_Cost_B = new Array('-3000','0','11000','20000','35000','50000','74000','105000','3000','14000','14000','23000','38000','54000','70000','97000','124000','14000','23000','38000','54000','70000','97000','124000');
var Paper_41_Cost_A = new Array('-2000','0','8000','14000','25000','35000','52000','74000','2000','9000','10000','16000','27000','36000','49000','68000','87000','10000','16000','27000','36000','49000','68000','87000');
var Paper_42_count = 1;
var Paper_42_Code = new Array('21');
var Paper_42_Name = new Array('180아트');
var Paper_43_count = 6;
var Paper_43_Code = new Array('13','15','16','20','22','23');
var Paper_43_Name = new Array('150스노우','200스노우','250스노우','150아트','200아트','250아트');
var Paper_44_count = 18;
var Paper_44_Code = new Array('25','26','27','28','29','30','31','32','33','34','35','36','37','38','39','40','135','167');
var Paper_44_Name = new Array('라레','누브','탄트지','화인라레','스타드림','키칼라','그레이스','빌리지','머쉬멜로우','스코틀랜드','팝셋','유포지','카멜레온','컨셉','키칼라아이스골드','스타골드','랑데뷰화이트','띤또레또250g');
var Paper_45_count = 2;
var Paper_45_Code = new Array('15','22');
var Paper_45_Name = new Array('200스노우','200아트');
var Paper_46_count = 19;
var Paper_46_Code = new Array('25','26','27','28','29','30','31','32','33','34','35','36','37','38','39','40','41','135','167');
var Paper_46_Name = new Array('라레','누브','탄트지','화인라레','스타드림','키칼라','그레이스','빌리지','머쉬멜로우','스코틀랜드','팝셋','유포지','카멜레온','컨셉','키칼라아이스골드','스타골드','심볼','랑데뷰화이트','띤또레또250g');
var Paper_47_count = 2;
var Paper_47_Code = new Array('17','24');
var Paper_47_Name = new Array('300스노우','300아트');
var Paper_48_count = 3;
var Paper_48_Code = new Array('3','95','100');
var Paper_48_Name = new Array('120모조','레자크91백색','레자크92백색');
var Paper_49_count = 4;
var Paper_49_Code = new Array('2','3','95','100');
var Paper_49_Name = new Array('100모조','120모조','레자크91백색','레자크92백색');
var Paper_50_count = 4;
var Paper_50_Code = new Array('92','95','96','100');
var Paper_50_Name = new Array('레자크90연미색','레자크91백색','레자크91연미색','레자크92백색');
var Paper_51_count = 61;
var Paper_51_Code = new Array('71','72','73','74','75','76','77','78','79','80','81','82','83','84','85','86','87','88','89','90','91','92','93','94','95','96','97','98','99','100','101','102','103','104','105','106','107','108','109','110','111','112','113','114','115','116','117','118','119','120','121','122','123','124','125','126','127','128','129','130','131');
var Paper_51_Name = new Array('98크라프트지','레자크64백색','레자크64크림색','레자크64연갈색','레자크66베이지색','레자크71미색','레자크75하늘색','레자크75쥐색','레자크83백색','레자크83연보라색','레자크87백색','레자크87연연두색','레자크87연분홍색','레자크87연황색','레자크87연옥색','레자크88연미색','레자크88베이지색','레자크88연갈색','레자크88연분홍색','레자크88연보라색','레자크90백색','레자크90연미색','레자크90베이지색','레자크90호두색','레자크91백색','레자크91연미색','레자크91은회색','레자크91계란색','레자크91황갈색','레자크92백색','레자크92연미색','레자크92옥색','레자크94연미색','레자크95백색','레자크96백색','레자크96아이보리색','탄트지백색','탄트지아이보리색','탄트지연옥색','탄트지연회색','레이드백색','레이드연미색','레이드연연두색','레이드연청색','레이드연분홍색','밍크지백색','밍크지연옥색','밍크지백회색','밍크지크림색','밍크지계란색','밍크지분홍색','밍크지연분홍색','밍크지회황색','밍크지은회색','밍크지황회색','밍크지회갈색','밍크지연연두색','밍크지옥색','밍크지연보라색','밍크지연청색','화일지');
var Paper_52_count = 61;
var Paper_52_Code = new Array('71','72','73','74','75','76','77','78','79','80','81','82','83','84','85','86','87','88','89','90','91','92','93','94','95','96','97','98','99','100','101','102','103','104','105','106','107','108','109','110','111','112','113','114','115','116','117','118','119','120','121','122','123','124','125','126','127','128','129','130','131');
var Paper_52_Name = new Array('98크라프트지','레자크64백색','레자크64크림색','레자크64연갈색','레자크66베이지색','레자크71미색','레자크75하늘색','레자크75쥐색','레자크83백색','레자크83연보라색','레자크87백색','레자크87연연두색','레자크87연분홍색','레자크87연황색','레자크87연옥색','레자크88연미색','레자크88베이지색','레자크88연갈색','레자크88연분홍색','레자크88연보라색','레자크90백색','레자크90연미색','레자크90베이지색','레자크90호두색','레자크91백색','레자크91연미색','레자크91은회색','레자크91계란색','레자크91황갈색','레자크92백색','레자크92연미색','레자크92옥색','레자크94연미색','레자크95백색','레자크96백색','레자크96아이보리색','탄트지백색','탄트지아이보리색','탄트지연옥색','탄트지연회색','레이드백색','레이드연미색','레이드연연두색','레이드연청색','레이드연분홍색','밍크지백색','밍크지연옥색','밍크지백회색','밍크지크림색','밍크지계란색','밍크지분홍색','밍크지연분홍색','밍크지회황색','밍크지은회색','밍크지황회색','밍크지회갈색','밍크지연연두색','밍크지옥색','밍크지연보라색','밍크지연청색','화일지');
var Paper_53_count = 61;
var Paper_53_Code = new Array('71','72','73','74','75','76','77','78','79','80','81','82','83','84','85','86','87','88','89','90','91','92','93','94','95','96','97','98','99','100','101','102','103','104','105','106','107','108','109','110','111','112','113','114','115','116','117','118','119','120','121','122','123','124','125','126','127','128','129','130','131');
var Paper_53_Name = new Array('98크라프트지','레자크64백색','레자크64크림색','레자크64연갈색','레자크66베이지색','레자크71미색','레자크75하늘색','레자크75쥐색','레자크83백색','레자크83연보라색','레자크87백색','레자크87연연두색','레자크87연분홍색','레자크87연황색','레자크87연옥색','레자크88연미색','레자크88베이지색','레자크88연갈색','레자크88연분홍색','레자크88연보라색','레자크90백색','레자크90연미색','레자크90베이지색','레자크90호두색','레자크91백색','레자크91연미색','레자크91은회색','레자크91계란색','레자크91황갈색','레자크92백색','레자크92연미색','레자크92옥색','레자크94연미색','레자크95백색','레자크96백색','레자크96아이보리색','탄트지백색','탄트지아이보리색','탄트지연옥색','탄트지연회색','레이드백색','레이드연미색','레이드연연두색','레이드연청색','레이드연분홍색','밍크지백색','밍크지연옥색','밍크지백회색','밍크지크림색','밍크지계란색','밍크지분홍색','밍크지연분홍색','밍크지회황색','밍크지은회색','밍크지황회색','밍크지회갈색','밍크지연연두색','밍크지옥색','밍크지연보라색','밍크지연청색','화일지');
var Paper_54_count = 11;
var Paper_54_Code = new Array('2','3','71','72','73','77','92','95','96','100','101');
var Paper_54_Name = new Array('100모조','120모조','98크라프트지','레자크64백색','레자크64크림색','레자크75하늘색','레자크90연미색','레자크91백색','레자크91연미색','레자크92백색','레자크92연미색');
var Paper_55_count = 17;
var Paper_55_Code = new Array('1','2','3','64','65','66','67','68','69','70','72','73','77','92','95','100','101');
var Paper_55_Name = new Array('80모조','100모조','120모조','스지','70모조노랑','70모조초록','70모조하늘','70모조분홍','70크라프트지','양크라프트지','레자크64백색','레자크64크림색','레자크75하늘색','레자크90연미색','레자크91백색','레자크92백색','레자크92연미색');
var Paper_56_count = 2;
var Paper_56_Code = new Array('0','1');
var Paper_56_Name = new Array('70모조','80모조');
var Paper_56_Cost_B = new Array('0','1000');
var Paper_56_Cost_A = new Array('0','2000');
var Paper_57_count = 2;
var Paper_57_Code = new Array('0','1');
var Paper_57_Name = new Array('70모조','80모조');
var Paper_58_count = 3;
var Paper_58_Code = new Array('0','1','2');
var Paper_58_Name = new Array('70모조','80모조','100모조');
var Paper_59_count = 1;
var Paper_59_Code = new Array('63');
var Paper_59_Name = new Array('NCR');
var Paper_60_count = 1;
var Paper_60_Code = new Array('63');
var Paper_60_Name = new Array('NCR');
var Paper_61_count = 1;
var Paper_61_Code = new Array('63');
var Paper_61_Name = new Array('NCR');
var Paper_62_count = 21;
var Paper_62_Code = new Array('1','2','3','4','5','6','7','11','12','13','14','15','16','17','18','19','20','21','22','23','24');
var Paper_62_Name = new Array('80모조','100모조','120모조','150모조','180모조','220모조','260모조','100스노우','120스노우','150스노우','180스노우','200스노우','250스노우','300스노우','100아트','120아트','150아트','180아트','200아트','250아트','300아트');
var Paper_63_count = 14;
var Paper_63_Code = new Array('11','12','13','14','15','16','17','18','19','20','21','22','23','24');
var Paper_63_Name = new Array('100스노우','120스노우','150스노우','180스노우','200스노우','250스노우','300스노우','100아트','120아트','150아트','180아트','200아트','250아트','300아트');
var Paper_64_count = 1;
var Paper_64_Code = new Array('200');
var Paper_64_Name = new Array('기타');
var Paper_65_count = 1;
var Paper_65_Code = new Array('200');
var Paper_65_Name = new Array('기타');
var Paper_66_count = 6;
var Paper_66_Code = new Array('168','169','170','171','172','199');
var Paper_66_Name = new Array('뉴에코크라프트250g','뉴블랙216g','딥블루216g','레드216g','코코298g','운송비');
var Paper_67_count = 1;
var Paper_67_Code = new Array('200');
var Paper_67_Name = new Array('기타');
var Paper_68_count = 1;
var Paper_68_Code = new Array('200');
var Paper_68_Name = new Array('기타');
var Paper_69_count = 1;
var Paper_69_Code = new Array('200');
var Paper_69_Name = new Array('기타');
var Paper_70_count = 1;
var Paper_70_Code = new Array('59');
var Paper_70_Name = new Array('스티커');
var Paper_71_count = 1;
var Paper_71_Code = new Array('59');
var Paper_71_Name = new Array('스티커');
var Paper_72_count = 1;
var Paper_72_Code = new Array('59');
var Paper_72_Name = new Array('스티커');
var Paper_73_count = 1;
var Paper_73_Code = new Array('59');
var Paper_73_Name = new Array('스티커');
var Paper_74_count = 1;
var Paper_74_Code = new Array('59');
var Paper_74_Name = new Array('스티커');
var Paper_75_count = 1;
var Paper_75_Code = new Array('59');
var Paper_75_Name = new Array('스티커');
var Paper_76_count = 1;
var Paper_76_Code = new Array('59');
var Paper_76_Name = new Array('스티커');
var Paper_77_count = 1;
var Paper_77_Code = new Array('59');
var Paper_77_Name = new Array('스티커');
var Paper_78_count = 1;
var Paper_78_Code = new Array('59');
var Paper_78_Name = new Array('스티커');
var Paper_79_count = 1;
var Paper_79_Code = new Array('132');
var Paper_79_Name = new Array('투명스티커');
var Paper_80_count = 4;
var Paper_80_Code = new Array('2','15','16','26');
var Paper_80_Name = new Array('100모조','200스노우','250스노우','누브');
var Paper_81_count = 5;
var Paper_81_Code = new Array('25','28','133','134','167');
var Paper_81_Name = new Array('라레','화인라레','화인누보','화인스노우','띤또레또250g');
var Paper_82_count = 1;
var Paper_82_Code = new Array('200');
var Paper_82_Name = new Array('기타');
var Paper_83_count = 1;
var Paper_83_Code = new Array('200');
var Paper_83_Name = new Array('기타');
var Paper_84_count = 19;
var Paper_84_Code = new Array('25','26','27','28','29','30','31','32','33','34','35','36','37','38','39','40','41','135','167');
var Paper_84_Name = new Array('라레','누브','탄트지','화인라레','스타드림','키칼라','그레이스','빌리지','머쉬멜로우','스코틀랜드','팝셋','유포지','카멜레온','컨셉','키칼라아이스골드','스타골드','심볼','랑데뷰화이트','띤또레또250g');
var Paper_85_count = 3;
var Paper_85_Code = new Array('28','133','134');
var Paper_85_Name = new Array('화인라레','화인누보','화인스노우');
var Paper_86_count = 1;
var Paper_86_Code = new Array('200');
var Paper_86_Name = new Array('기타');
var Paper_87_count = 1;
var Paper_87_Code = new Array('200');
var Paper_87_Name = new Array('기타');
var Paper_88_count = 1;
var Paper_88_Code = new Array('200');
var Paper_88_Name = new Array('기타');
var Paper_89_count = 1;
var Paper_89_Code = new Array('200');
var Paper_89_Name = new Array('기타');
var Paper_90_count = 12;
var Paper_90_Code = new Array('25','26','29','30','31','32','33','35','38','39','135','167');
var Paper_90_Name = new Array('라레','누브','스타드림','키칼라','그레이스','빌리지','머쉬멜로우','팝셋','컨셉','키칼라아이스골드','랑데뷰화이트','띤또레또250g');
var Paper_91_count = 10;
var Paper_91_Code = new Array('1','5','25','31','136','137','138','139','140','167');
var Paper_91_Name = new Array('80모조','180모조','라레','그레이스','레자크A형','레자크B형','레자크C형','레자크D형','레자크E형','띤또레또250g');
var Paper_93_count = 1;
var Paper_93_Code = new Array('141');
var Paper_93_Name = new Array('80코트지');
var Paper_94_count = 1;
var Paper_94_Code = new Array('142');
var Paper_94_Name = new Array('80모조스티커');
var Paper_95_count = 1;
var Paper_95_Code = new Array('0');
var Paper_95_Name = new Array('70모조');
var Paper_96_count = 1;
var Paper_96_Code = new Array('1');
var Paper_96_Name = new Array('80모조');
var Paper_97_count = 1;
var Paper_97_Code = new Array('2');
var Paper_97_Name = new Array('100모조');
var Paper_98_count = 1;
var Paper_98_Code = new Array('63');
var Paper_98_Name = new Array('NCR');
var Paper_99_count = 1;
var Paper_99_Code = new Array('63');
var Paper_99_Name = new Array('NCR');
var Paper_100_count = 1;
var Paper_100_Code = new Array('63');
var Paper_100_Name = new Array('NCR');
var Paper_101_count = 3;
var Paper_101_Code = new Array('3','95','100');
var Paper_101_Name = new Array('120모조','레자크91백색','레자크92백색');
var Paper_102_count = 3;
var Paper_102_Code = new Array('3','95','100');
var Paper_102_Name = new Array('120모조','레자크91백색','레자크92백색');
var Paper_103_count = 4;
var Paper_103_Code = new Array('2','3','95','100');
var Paper_103_Name = new Array('100모조','120모조','레자크91백색','레자크92백색');
var Paper_104_count = 4;
var Paper_104_Code = new Array('2','3','95','100');
var Paper_104_Name = new Array('100모조','120모조','레자크91백색','레자크92백색');
var Paper_105_count = 5;
var Paper_105_Code = new Array('16','23','26','29','36');
var Paper_105_Name = new Array('250스노우','250아트','누브','스타드림','유포지');
var Paper_106_count = 5;
var Paper_106_Code = new Array('155','157','159','161','163');
var Paper_106_Name = new Array('백색지45g','적색(분홍)지45g','황색지45g','청색(옥색)지45g','녹색(연두)지45g');
var Paper_107_count = 5;
var Paper_107_Code = new Array('156','158','160','162','164');
var Paper_107_Name = new Array('백색지90g','적색(분홍)지90g','황색지90g','청색(옥색)지90g','녹색(연두)지90g');
var Paper_108_count = 5;
var Paper_108_Code = new Array('155','157','159','161','163');
var Paper_108_Name = new Array('백색지45g','적색(분홍)지45g','황색지45g','청색(옥색)지45g','녹색(연두)지45g');
var Paper_109_count = 5;
var Paper_109_Code = new Array('156','158','160','162','164');
var Paper_109_Name = new Array('백색지90g','적색(분홍)지90g','황색지90g','청색(옥색)지90g','녹색(연두)지90g');
var Paper_110_count = 4;
var Paper_110_Code = new Array('16','22','26','145');
var Paper_110_Name = new Array('250스노우','200아트','누브','216아트');
var Paper_111_count = 3;
var Paper_111_Code = new Array('3','95','100');
var Paper_111_Name = new Array('120모조','레자크91백색','레자크92백색');
var Paper_112_count = 4;
var Paper_112_Code = new Array('2','3','95','100');
var Paper_112_Name = new Array('100모조','120모조','레자크91백색','레자크92백색');
var Paper_113_count = 4;
var Paper_113_Code = new Array('2','3','95','100');
var Paper_113_Name = new Array('100모조','120모조','레자크91백색','레자크92백색');
var Paper_114_count = 3;
var Paper_114_Code = new Array('3','95','100');
var Paper_114_Name = new Array('120모조','레자크91백색','레자크92백색');
var Paper_115_count = 1;
var Paper_115_Code = new Array('1');
var Paper_115_Name = new Array('80모조');
var Paper_116_count = 1;
var Paper_116_Code = new Array('1');
var Paper_116_Name = new Array('80모조');
var Paper_117_count = 1;
var Paper_117_Code = new Array('1');
var Paper_117_Name = new Array('80모조');
var Paper_118_count = 1;
var Paper_118_Code = new Array('1');
var Paper_118_Name = new Array('80모조');
var Paper_119_count = 1;
var Paper_119_Code = new Array('1');
var Paper_119_Name = new Array('80모조');
var Paper_120_count = 5;
var Paper_120_Code = new Array('168','169','170','171','172');
var Paper_120_Name = new Array('뉴에코크라프트250g','뉴블랙216g','딥블루216g','레드216g','코코298g');
//*******************************
var Quantity_jundan_count = 145;
var Quantity_jundan = new Array('0.5','1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20','21','22','23','24','25','26','27','28','29','30','31','32','33','34','35','36','37','38','39','40','41','42','43','44','45','46','47','48','49','50','51','52','53','54','55','56','57','58','59','60','61','62','63','64','65','66','67','68','69','70','71','72','73','74','75','76','77','78','79','80','81','82','83','84','85','86','87','88','89','90','91','92','93','94','95','96','97','98','99','100','105','110','115','120','125','130','135','140','145','150','155','160','165','170','175','180','185','190','195','200','205','210','215','220','225','230','235','240','245','250','255','260','265','270','275','280','285','290','295','300','350','400','450','500');
//*******************************
var hostname = window.location.hostname;
function SrcKind(sn,KindCode)
{
    var f = parent.frames[1].document.OrderForm;
    var SRC_Kind_Index = 0;
    eval('var myindex = f.Product_'+sn+'.selectedIndex');
    eval('Product = f.Product_'+sn+'.options[myindex].value');
    SrcKind_clear(sn);
    change_id2(sn,2);
    eval('f.SizeKind_'+sn+'.selectedIndex = 0');
    if(Product==''){ }
    else if(Product==33||Product==35||Product==38||Product==39||Product==40||Product==41||Product==93)
    {
        //100합판전단지,80모조합판전단지,독판전단지,독판문고리,독판문어발,단색독판,80코트합판전단지
        eval('Kind_count = Kind_'+Product+'_count');
        for(var i=0; i<Kind_count; i++)
        {
            eval('f.Kind_'+sn+'.options[i].value= Kind_'+Product+'_Code[i]');
            eval('f.Kind_'+sn+'.options[i].text= Kind_'+Product+'[i]');
            if(KindCode!='')
            { eval('if(KindCode==Kind_'+Product+'_Code[i]){ SRC_Kind_Index = i }') }
        }
        for(var i=0; i<Quantity_jundan_count; i++)
        {
            eval('f.Quantity_'+sn+'.options[i].value= i');
            eval('f.Quantity_'+sn+'.options[i].text= Quantity_jundan[i]');
        }
        eval('f.Quantity_'+sn+'.value = 1');
    }
    else
    {
        eval('Kind_count = Kind_'+Product+'_count');
        for(var i=0; i<Kind_count; i++)
        {
            eval('f.Kind_'+sn+'.options[i].value= Kind_'+Product+'_Code[i]');
            eval('f.Kind_'+sn+'.options[i].text= Kind_'+Product+'[i]');
            if(KindCode!='')
            { eval('if(KindCode==Kind_'+Product+'_Code[i]){ SRC_Kind_Index = i }') }
        }
        eval('Quantity_count = Quantity_'+Product+'_count');
        for(var i=0; i<Quantity_count; i++)
        {
            eval('f.Quantity_'+sn+'.options[i].value= i');
            eval('f.Quantity_'+sn+'.options[i].text= Quantity_'+Product+'[i]');
        }
        if(Product==24||Product==25||Product==26||Product==27||Product==28||Product==29||Product==30||Product==31||Product==32||Product==71||Product==72||Product==73||Product==74||Product==75||Product==76||Product==77||Product==78)
        {
            change_id2(sn,1);  //전면도무송은 후가공 추가
            eval('f.changeid2_'+sn+'[1].checked = true');
            eval('f.changeid2_'+sn+'.disabled = false');
            eval('f.CottingK_'+sn+'.selectedIndex = OptionSI(sn,"CottingK",56)');
        }
    }
    eval('f.Kind_'+sn+'.selectedIndex = SRC_Kind_Index');
}
function SrcPaper(sn,SRC_Paper,SRC_Paper2)
{
    var f = parent.frames[1].document.OrderForm;
    var url = document.URL;
    var SRC_Paper_Index = SRC_Paper2_Index = 0;
    eval('var myindex = f.Product_'+sn+'.selectedIndex');
    eval('Product = f.Product_'+sn+'.options[myindex].value');
    eval('var myindex2 = f.Kind_'+sn+'.selectedIndex');
    eval('Kind = f.Kind_'+sn+'.options[myindex2].value');
    eval('KindT = f.Kind_'+sn+'.options[myindex2].text');
    if(Product!=''&&Kind!='')
    {
        if(SRC_Paper==''){ SRC_Paper = KPaper_Code[Kind] }
        if(SRC_Paper2==''){ SRC_Paper2 = KPaper_Code[Kind] }
        eval('f.Width_'+sn+'.value= KWidth[Kind]');
        eval('f.Height_'+sn+'.value= KHeight[Kind]');
        eval('f.Color_'+sn+'.value= KColor[Kind]');
        //울트라 화이트 사이즈 강제적용
        if(Product==5||Product==7){
            eval('f.Width_'+sn+'.value= 90');
            eval('f.Height_'+sn+'.value= 50');
            if(KindT.indexOf('4도')!=-1){
                eval('f.Color_'+sn+'.value= 4');
            }else if(KindT.indexOf('5도')!=-1){
                eval('f.Color_'+sn+'.value= 5');
            }else if(KindT.indexOf('8도')!=-1){
                eval('f.Color_'+sn+'.value= 8');
            }
        }
        if(Product==62)
        {
            //초소량옵셋인쇄
            eval('var KindQuantityMax = Quantity_'+Product+'_'+Kind+'_count');
            eval('var ProductQuantityMax = Quantity_'+Product+'_count');
            for(var i=0; i<KindQuantityMax; i++)
            {
                eval('f.Quantity_'+sn+'.options[i].value= Quantity_'+Product+'_'+Kind+'[i]');
                eval('f.Quantity_'+sn+'.options[i].text= Quantity_'+Product+'_'+Kind+'[i]');
            }
            for(var i=KindQuantityMax; i<ProductQuantityMax; i++)
            {
                eval('f.Quantity_'+sn+'.options[i].value= ""');
                eval('f.Quantity_'+sn+'.options[i].text= ""');
            }
        }
        if(Product==19||Product==20||Product==21||Product==22||Product==79||Product==94)
        {
            //스티커,강접스티커,유포지스티커,은데드롱스티커,투명스티커,80모조스티커
            if(KindT.indexOf('도무송')!=-1||KindT.indexOf('별사이즈')!=-1||KindT.indexOf('투터치')!=-1){ eval('f.SizeKind_'+sn+'.selectedIndex = 1'); }
            else{ eval('f.SizeKind_'+sn+'.selectedIndex = 0'); }
            //if(url.indexOf('ordermodify.asp')==-1&&url.indexOf('orderrework.asp')==-1){
            if(KindT.indexOf('도무송')!=-1)
            {
                change_id2(sn,1);
                eval('f.changeid2_'+sn+'[1].checked = true');
                eval('f.DomusongK_'+sn+'.selectedIndex = OptionSI(sn,"DomusongK",63)');
            }
            else
            { change_id2(sn,2);	eval('f.DomusongK_'+sn+'.selectedIndex = 0'); }
            //}
        }
        else if(Product==24||Product==25||Product==26||Product==27||Product==28||Product==29||Product==30||Product==31||Product==32||Product==71||Product==72||Product==73||Product==74||Product==75||Product==76||Product==77||Product==78)
        {
            if(url.indexOf('ordermodify.asp')==-1&&url.indexOf('orderrework.asp')==-1){
                change_id2(sn,1);  //전면도무송은 후가공 추가
                eval('f.changeid2_'+sn+'[1].checked = true');
                eval('f.changeid2_'+sn+'.disabled = false');
                eval('f.CottingK_'+sn+'.selectedIndex = OptionSI(sn,"CottingK",56)');
            }
        }
        else if(Product==34)
        {
            if(url.indexOf('ordermodify.asp')==-1&&url.indexOf('orderrework.asp')==-1){
                change_id2(sn,1);  //합판문어발은 후가공 추가
                eval('f.changeid2_'+sn+'[1].checked = true');
                eval('f.changeid2_'+sn+'.disabled = false');
                eval('f.DomusongK_'+sn+'.selectedIndex = OptionSI(sn,"DomusongK",68)');
            }
        }
        else if(Product==37)
        {
            //if(url.indexOf('ordermodify.asp')==-1&&url.indexOf('orderrework.asp')==-1){
            //change_id2(sn,1);  //합판메뉴판은 후가공 추가
            //eval('f.changeid2_'+sn+'[1].checked = true');
            //eval('f.changeid2_'+sn+'.disabled = false');
            //eval('f.OsiK_'+sn+'.selectedIndex = OptionSI(sn,"OsiK",18)');
            //eval('f.TagongK_'+sn+'.selectedIndex = OptionSI(sn,"TagongK",23)');
            //eval('f.CottingK_'+sn+'.selectedIndex = OptionSI(sn,"CottingK",56)');
            //}
        }
        else if(Product==39)
        {
            if(url.indexOf('ordermodify.asp')==-1&&url.indexOf('orderrework.asp')==-1){
                change_id2(sn,1);  //독판문어발은 후가공 추가
                eval('f.changeid2_'+sn+'[1].checked = true');
                eval('f.changeid2_'+sn+'.disabled = false');
                eval('f.DomusongK_'+sn+'.selectedIndex = OptionSI(sn,"DomusongK",68)');
                eval('f.Quantity_'+sn+'.selectedIndex = 1');
            }
        }
        else if(Product==40)
        {
            if(url.indexOf('ordermodify.asp')==-1&&url.indexOf('orderrework.asp')==-1){
                change_id2(sn,1);  //독판문고리는 후가공 추가
                eval('f.changeid2_'+sn+'[1].checked = true');
                eval('f.changeid2_'+sn+'.disabled = false');
                eval('f.DomusongK_'+sn+'.selectedIndex = OptionSI(sn,"DomusongK",87)');
                eval('f.Quantity_'+sn+'.selectedIndex = 1');
            }
        }
        eval('Paper_Product_count = Paper_'+Product+'_count');

        var nsi = 0;
        for(var i=0; i<Paper_Product_count; i++)
        {
            //=========================== 마스터 봉투 종이지질 선택시 수정 By Lee 20130129 =======================================//
            /*
             if(Product==54||Product==55){
             eval('var SCodeT = Paper_'+Product+'_Code[i]');
             if(Kind==849||Kind==850||Kind==851||Kind==852||Kind==853||Kind==854){//마스터 봉투 각대봉투 선택옵션
             if(SCodeT == 71){
             eval('f.Paper_'+sn+'.length = 1');
             eval('f.Paper2_'+sn+'.length = 1');
             eval('f.Paper_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper==Paper_'+Product+'_Code[i]){ SRC_Paper_Index = nsi }')
             eval('f.Paper2_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper2_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper2==Paper_'+Product+'_Code[i]){ SRC_Paper2_Index = nsi }')
             nsi++;
             }
             }else if(Kind==880){//마스터 봉투 5절 각대봉투 선택옵션
             if(SCodeT == 70){
             eval('f.Paper_'+sn+'.length = 1');
             eval('f.Paper2_'+sn+'.length = 1');
             eval('f.Paper_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper==Paper_'+Product+'_Code[i]){ SRC_Paper_Index = nsi }')
             eval('f.Paper2_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper2_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper2==Paper_'+Product+'_Code[i]){ SRC_Paper2_Index = nsi }')
             nsi++;
             }
             }else if(Kind==873 || Kind==868 || Kind==869 || Kind==870 || Kind==871||Kind==863||Kind==862||Kind==878||Kind==855||Kind==881||Kind==882||Kind==883||Kind==884||Kind==885||Kind==1351){//마스터 봉투 5절 각대봉투 선택옵션
             if(SCodeT == 2){
             eval('f.Paper_'+sn+'.length = 1');
             eval('f.Paper2_'+sn+'.length = 1');
             eval('f.Paper_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper==Paper_'+Product+'_Code[i]){ SRC_Paper_Index = nsi }')
             eval('f.Paper2_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper2_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper2==Paper_'+Product+'_Code[i]){ SRC_Paper2_Index = nsi }')
             nsi++;
             }
             }else if(Kind==856){//마스터 봉투 5절 각대봉투 선택옵션
             if(SCodeT == 3){
             eval('f.Paper_'+sn+'.length = 1');
             eval('f.Paper2_'+sn+'.length = 1');
             eval('f.Paper_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper==Paper_'+Product+'_Code[i]){ SRC_Paper_Index = nsi }')
             eval('f.Paper2_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper2_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper2==Paper_'+Product+'_Code[i]){ SRC_Paper2_Index = nsi }')
             nsi++;
             }
             }else if(Kind==857||Kind==859){//마스터 봉투 레자크 4절 각대봉투 선택옵션
             if(SCodeT == 100){
             eval('f.Paper_'+sn+'.length = 1');
             eval('f.Paper2_'+sn+'.length = 1');
             eval('f.Paper_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper==Paper_'+Product+'_Code[i]){ SRC_Paper_Index = nsi }')
             eval('f.Paper2_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper2_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper2==Paper_'+Product+'_Code[i]){ SRC_Paper2_Index = nsi }')
             nsi++;
             }
             }else if(Kind==858){//마스터 봉투 레자크 5절 각대봉투 선택옵션
             if(SCodeT == 72 || SCodeT == 73 || SCodeT == 92 || SCodeT == 95 || SCodeT == 96 || SCodeT == 100 || SCodeT == 101 || SCodeT == 77){
             eval('f.Paper_'+sn+'.length = 8');
             eval('f.Paper2_'+sn+'.length = 8');
             eval('f.Paper_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper==Paper_'+Product+'_Code[i]){ SRC_Paper_Index = nsi }')
             eval('f.Paper2_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper2_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper2==Paper_'+Product+'_Code[i]){ SRC_Paper2_Index = nsi }')
             nsi++;
             }
             }else if(Kind==860){//마스터 봉투 레자크 9절 각대봉투 선택옵션
             if(SCodeT == 100 || SCodeT == 101){
             eval('f.Paper_'+sn+'.length = 2');
             eval('f.Paper2_'+sn+'.length = 2');
             eval('f.Paper_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper==Paper_'+Product+'_Code[i]){ SRC_Paper_Index = nsi }')
             eval('f.Paper2_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper2_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper2==Paper_'+Product+'_Code[i]){ SRC_Paper2_Index = nsi }')
             nsi++;
             }
             }else if(Kind==861||Kind==877){//마스터 봉투신규격소봉투 80모조 선택옵션
             if(SCodeT == 1){
             eval('f.Paper_'+sn+'.length = 1');
             eval('f.Paper2_'+sn+'.length = 1');
             eval('f.Paper_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper==Paper_'+Product+'_Code[i]){ SRC_Paper_Index = nsi }')
             eval('f.Paper2_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper2_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper2==Paper_'+Product+'_Code[i]){ SRC_Paper2_Index = nsi }')
             nsi++;
             }
             }else if(Kind==864){//마스터 봉투신규격소봉투 황봉투신규격 선택옵션
             if(SCodeT == 64){
             eval('f.Paper_'+sn+'.length = 1');
             eval('f.Paper2_'+sn+'.length = 1');
             eval('f.Paper_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper==Paper_'+Product+'_Code[i]){ SRC_Paper_Index = nsi }')
             eval('f.Paper2_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper2_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper2==Paper_'+Product+'_Code[i]){ SRC_Paper2_Index = nsi }')
             nsi++;
             }
             }else if(Kind==865){//마스터 봉투 신규격소봉투  선택옵션
             if(SCodeT == 69){
             eval('f.Paper_'+sn+'.length = 1');
             eval('f.Paper2_'+sn+'.length = 1');
             eval('f.Paper_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper==Paper_'+Product+'_Code[i]){ SRC_Paper_Index = nsi }')
             eval('f.Paper2_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper2_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper2==Paper_'+Product+'_Code[i]){ SRC_Paper2_Index = nsi }')
             nsi++;
             }
             }else if(Kind==867){//마스터 봉투 색모조 신규격 선택옵션
             if(SCodeT == 65 || SCodeT == 66 || SCodeT == 67 || SCodeT == 68){
             eval('f.Paper_'+sn+'.length = 4');
             eval('f.Paper2_'+sn+'.length = 4');
             eval('f.Paper_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper==Paper_'+Product+'_Code[i]){ SRC_Paper_Index = nsi }')
             eval('f.Paper2_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper2_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper2==Paper_'+Product+'_Code[i]){ SRC_Paper2_Index = nsi }')
             nsi++;
             }
             }else if(Kind==874){//마스터 봉투 레자크 소봉투 선택옵션
             if(SCodeT == 72 || SCodeT == 95 || SCodeT == 100 || SCodeT == 101){
             eval('f.Paper_'+sn+'.length = 4');
             eval('f.Paper2_'+sn+'.length = 4');
             eval('f.Paper_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper==Paper_'+Product+'_Code[i]){ SRC_Paper_Index = nsi }')
             eval('f.Paper2_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper2_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper2==Paper_'+Product+'_Code[i]){ SRC_Paper2_Index = nsi }')
             nsi++;
             }
             }else if(Kind==875){//마스터 봉투 수강료봉투 선택옵션
             if(SCodeT == 72 || SCodeT == 73 || SCodeT == 77){
             eval('f.Paper_'+sn+'.length = 3');
             eval('f.Paper2_'+sn+'.length = 3');
             eval('f.Paper_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper==Paper_'+Product+'_Code[i]){ SRC_Paper_Index = nsi }')
             eval('f.Paper2_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper2_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper2==Paper_'+Product+'_Code[i]){ SRC_Paper2_Index = nsi }')
             nsi++;
             }
             }else if(Kind==876){//마스터 봉투 티켓 소 봉투 선택옵션
             if(SCodeT == 92 || SCodeT == 100){
             eval('f.Paper_'+sn+'.length = 2');
             eval('f.Paper2_'+sn+'.length = 2');
             eval('f.Paper_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper==Paper_'+Product+'_Code[i]){ SRC_Paper_Index = nsi }')
             eval('f.Paper2_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper2_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper2==Paper_'+Product+'_Code[i]){ SRC_Paper2_Index = nsi }')
             nsi++;
             }
             }else if(Kind==879){//마스터 봉투 A4 소 봉투 선택옵션
             if(SCodeT == 92 || SCodeT == 95 || SCodeT == 100){
             eval('f.Paper_'+sn+'.length = 3');
             eval('f.Paper2_'+sn+'.length = 3');
             eval('f.Paper_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper==Paper_'+Product+'_Code[i]){ SRC_Paper_Index = nsi }')
             eval('f.Paper2_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[i]');
             eval('f.Paper2_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[i]');
             eval('if(SRC_Paper2==Paper_'+Product+'_Code[i]){ SRC_Paper2_Index = nsi }')
             nsi++;
             }
             }else{
             eval('f.Paper_'+sn+'.length = 200');
             eval('f.Paper2_'+sn+'.length = 200');
             eval('f.Paper_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[nsi]');
             eval('f.Paper_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[nsi]');
             eval('if(SRC_Paper==Paper_'+Product+'_Code[nsi]){ SRC_Paper_Index = nsi }')
             eval('f.Paper2_'+sn+'.options[nsi].value = Paper_'+Product+'_Code[nsi]');
             eval('f.Paper2_'+sn+'.options[nsi].text = Paper_'+Product+'_Name[nsi]');
             eval('if(SRC_Paper2==Paper_'+Product+'_Code[nsi]){ SRC_Paper2_Index = nsi }')
             nsi++;
             }


             }else{
             */
            eval('f.Paper_'+sn+'.length = 200');
            eval('f.Paper2_'+sn+'.length = 200');
            eval('f.Paper_'+sn+'.options[i].value = Paper_'+Product+'_Code[i]');
            eval('f.Paper_'+sn+'.options[i].text = Paper_'+Product+'_Name[i]');
            eval('if(SRC_Paper==Paper_'+Product+'_Code[i]){ SRC_Paper_Index = i }')
            eval('f.Paper2_'+sn+'.options[i].value = Paper_'+Product+'_Code[i]');
            eval('f.Paper2_'+sn+'.options[i].text = Paper_'+Product+'_Name[i]');
            eval('if(SRC_Paper2==Paper_'+Product+'_Code[i]){ SRC_Paper2_Index = i }')

            //}
            //=========================== 마스터 봉투 종이지질 선택시 수정 By Lee 20130129 =======================================//
        }

        //if(Product==54||Product==55){
        //}else{
        for(var i=Paper_Product_count; i<Paper_Name_count; i++)
        {
            eval('f.Paper_'+sn+'.options[i].value = ""');
            eval('f.Paper_'+sn+'.options[i].text = ""');
            eval('f.Paper2_'+sn+'.options[i].value = ""');
            eval('f.Paper2_'+sn+'.options[i].text = ""');
        }
        //}
        //if((url.indexOf('ordermodify.asp')!=-1||url.indexOf('orderrework.asp')!=-1)&&(Product==33||Product==38||Product==39||Product==40||Product==41||Product==93)){}
        //else{ eval('f.Paper_'+sn+'.value = KPaper_Code['+Kind+']'); }
        //else
        //{
        eval('f.Paper_'+sn+'.selectedIndex = SRC_Paper_Index');
        eval('f.Paper2_'+sn+'.selectedIndex = SRC_Paper2_Index');
        //}
    }
    else
    {
        var blank = '';
        eval('f.Width_'+sn+'.value= blank');
        eval('f.Height_'+sn+'.value= blank');
        eval('f.Color_'+sn+'.value= 4');
        for(var i=0; i<Paper_Name_count; i++)
        {
            eval('f.Paper_'+sn+'.options[i].value= i');
            eval('f.Paper_'+sn+'.options[i].text= Paper_Name[i]');
            eval('f.Paper2_'+sn+'.options[i].value= i');
            eval('f.Paper2_'+sn+'.options[i].text= Paper_Name[i]');
        }
    }
}
function SrcKind_clear(sn)
{
    var f = parent.frames[1].document.OrderForm;
    var blank = '';
    for(var i=0;i<=96;i++)
    {
        eval('f.Kind_'+sn+'.options[i].value = blank ');
        eval('f.Kind_'+sn+'.options[i].text = blank ');
    }
    eval('f.Kind_'+sn+'.selectedIndex = 0');
    for(var i=0;i<=150;i++)
    {
        eval('f.Quantity_'+sn+'.options[i].value = blank ');
        eval('f.Quantity_'+sn+'.options[i].text = blank ');
    }
    eval('f.Quantity_'+sn+'.selectedIndex = 0');
    eval('f.Pcases_'+sn+'.selectedIndex = 0');
}
function SKChange(sn)
{
    var f = parent.frames[1].document.OrderForm;
    eval('var myindex6 = f.SizeKind_'+sn+'.selectedIndex');
    if(myindex6!=1){ alert('별사이즈만 입력이 가능합니다.'); SrcPaper(sn,'',''); }
}
function PErr(){ alert('선택하실 수 없습니다!'); }
function Cost(sn)
{
    var f = parent.frames[1].document.OrderForm;
    eval('var myindex1 = f.Product_'+sn+'.selectedIndex');
    eval('Product = f.Product_'+sn+'.options[myindex1].value');
    eval('ProductT = f.Product_'+sn+'.options[myindex1].text');
    f.Product.value = ProductT;
    eval('var myindex2 = f.Kind_'+sn+'.selectedIndex');
    eval('Kind = f.Kind_'+sn+'.options[myindex2].value');
    eval('KindT = f.Kind_'+sn+'.options[myindex2].text');
    f.Kind.value = KindT;
    eval('var myindex3 = f.Quantity_'+sn+'.selectedIndex');
    eval('Quantity = f.Quantity_'+sn+'.options[myindex3].value');
    eval('QuantityR = f.Quantity_'+sn+'.options[myindex3].text');
    eval('var myindex4 = f.Pcases_'+sn+'.selectedIndex');
    eval('Pcases = f.Pcases_'+sn+'.options[myindex4].value');
    eval('var myindex5 = f.Paper_'+sn+'.selectedIndex');
    eval('Paper = f.Paper_'+sn+'.options[myindex5].value');
    eval('PaperT = f.Paper_'+sn+'.options[myindex5].text');
    eval('var myindex6 = f.SizeKind_'+sn+'.selectedIndex');
    eval('SizeKind = f.SizeKind_'+sn+'.options[myindex6].value');
    eval('SizeKindT = f.SizeKind_'+sn+'.options[myindex6].text');
    eval('var myindex7 = f.Paper2_'+sn+'.selectedIndex');
    eval('Paper2 = f.Paper2_'+sn+'.options[myindex7].value');
    eval('Paper2T = f.Paper2_'+sn+'.options[myindex7].text');
    eval('WidthV = f.Width_'+sn+'.value');
    eval('HeightV = f.Height_'+sn+'.value');
    var Baesu = 1;
    var EstimateCount = 0;
    var EstimateMSG = '';

    if(Product==0||Product==1||Product==110||Product==2||Product==8||Product==12)
    {
        if(KindT.substring(0,1)=='비'&&Paper!=16){ PErr(); SrcPaper(sn,'16','16'); }
        //else if(KindT.substring(0,1)=='코'&&Paper!=145){ PErr(); SrcPaper(sn,'145','145'); }
        else if(KindT.substring(0,1)=='코'&&Paper!=16){ PErr(); SrcPaper(sn,'16','16'); }
    }
    else if(Product==3&&Paper!=16){ PErr(); SrcPaper(sn,'16','16'); }
    else if(Product==4||Product==9||Product==13)
    {
        if(KindT.substring(0,2)=='라레'&&Paper!=25){ PErr(); SrcPaper(sn,'25','25'); }
        else if(KindT.indexOf('누브')!=-1&&Paper!=26){ PErr(); SrcPaper(sn,'26','26'); }
        else if(KindT.indexOf('탄트')!=-1&&Paper!=27){ PErr(); SrcPaper(sn,'27','27'); }
        else if(KindT.indexOf('화인라레')!=-1&&Paper!=28){ PErr(); SrcPaper(sn,'28','28'); }
    }
    else if(Product==105)
    {
        if(KindT.indexOf('누브')!=-1&&Paper!=26){ PErr(); SrcPaper(sn,'26','26'); }
        else if(KindT.indexOf('비코팅')!=-1&&Paper!=16){ PErr(); SrcPaper(sn,'16','16'); }
        else if(KindT.indexOf('스타')!=-1&&Paper!=29){ PErr(); SrcPaper(sn,'29','29'); }
        else if(KindT.indexOf('무광')!=-1&&Paper!=23){ PErr(); SrcPaper(sn,'23','23'); }
        else if(KindT.indexOf('유포')!=-1&&Paper!=36){ PErr(); SrcPaper(sn,'36','36'); }
    }
    else if(Product==5||Product==10||Product==1||Product==1101||Product==14||Product==81||Product==7||Product==120)
    {
        if(KindT.indexOf('화인라레')!=-1&&Paper!=28){ PErr(); SrcPaper(sn,'28','28'); }
        else if((KindT.indexOf('스타단면')!=-1||KindT.indexOf('스타양면')!=-1||KindT.indexOf('스타1')!=-1||KindT.indexOf('스타A')!=-1)&&Paper!=29)
        { PErr(); SrcPaper(sn,'29','29'); }
        else if((KindT.indexOf('키칼단면')!=-1||KindT.indexOf('키칼양면')!=-1||KindT.indexOf('키칼1')!=-1||KindT.indexOf('키칼A')!=-1)&&Paper!=30)
        { PErr(); SrcPaper(sn,'30','30'); }
        else if(KindT.indexOf('그레')!=-1&&Paper!=31){ PErr(); SrcPaper(sn,'31','31'); }
        else if(KindT.indexOf('빌리')!=-1&&Paper!=32){ PErr(); SrcPaper(sn,'32','32'); }
        else if(KindT.indexOf('머쉬')!=-1&&Paper!=33){ PErr(); SrcPaper(sn,'33','33'); }
        else if(KindT.indexOf('스코')!=-1&&Paper!=34){ PErr(); SrcPaper(sn,'34','34'); }
        else if(KindT.indexOf('팝셋')!=-1&&Paper!=35){ PErr(); SrcPaper(sn,'35','35'); }
        else if(KindT.indexOf('유포')!=-1&&Paper!=36){ PErr(); SrcPaper(sn,'36','36'); }
        else if(KindT.indexOf('카멜')!=-1&&Paper!=37){ PErr(); SrcPaper(sn,'37','37'); }
        else if(KindT.indexOf('컨셉')!=-1&&Paper!=38){ PErr(); SrcPaper(sn,'38','38'); }
        else if(KindT.indexOf('키칼라아이스')!=-1&&Paper!=39){ PErr(); SrcPaper(sn,'39','39'); }
        else if(KindT.indexOf('스타골드')!=-1&&Paper!=40){ PErr(); SrcPaper(sn,'40','40'); }
        else if(KindT.indexOf('화인누브')!=-1&&Paper!=133){ PErr(); SrcPaper(sn,'133','133'); }
        else if(KindT.indexOf('화인스노우')!=-1&&Paper!=134){ PErr(); SrcPaper(sn,'134','134'); }
        else if(KindT.indexOf('띤또')!=-1&&Paper!=167){ PErr(); SrcPaper(sn,'167','167'); }
        else if(KindT.indexOf('뉴에코')!=-1&&Paper!=168){ PErr(); SrcPaper(sn,'168','168'); }
        else if(KindT.indexOf('뉴블랙')!=-1&&Paper!=169){ PErr(); SrcPaper(sn,'169','169'); }
        else if(KindT.indexOf('딥블루')!=-1&&Paper!=170){ PErr(); SrcPaper(sn,'170','170'); }
        else if(KindT.indexOf('레드')!=-1&&Paper!=171){ PErr(); SrcPaper(sn,'171','171'); }
        else if(KindT.indexOf('코코')!=-1&&Paper!=172){ PErr(); SrcPaper(sn,'172','172'); }
        else if(KindT.indexOf('탄트')!=-1&&Paper!=27&&Kind<1626){ PErr(); SrcPaper(sn,'27','27'); }
        else if(KindT.indexOf('랑데뷰화이트')!=-1&&Paper!=135){ PErr(); SrcPaper(sn,'135','135'); }
        else if(KindT.indexOf('울트라화이트')!=-1&&Paper!=144){ PErr(); SrcPaper(sn,'144','144'); }
        else if(KindT.indexOf('퓨어')!=-1&&Paper!=165){ PErr(); SrcPaper(sn,'165','165'); }
        else if(KindT.indexOf('매트')!=-1&&Paper!=166){ PErr(); SrcPaper(sn,'166','166'); }
        if(Product==5||Product==7){
            if((KindT.indexOf('라레단면')!=-1||KindT.indexOf('라레양면')!=-1)&&Paper!=25){ PErr(); SrcPaper(sn,'25','25'); }
            else if((KindT.indexOf('누브단면')!=-1||KindT.indexOf('누브양면')!=-1)&&Paper!=26){ PErr(); SrcPaper(sn,'26','26'); }
            else if(KindT.indexOf('앙코르')!=-1&&Paper!=146){ PErr(); SrcPaper(sn,'146','146'); }
            else if(KindT.indexOf('마제스틱')!=-1&&Paper!=147){ PErr(); SrcPaper(sn,'147','147'); }
            else if(KindT.indexOf('스타더스트')!=-1&&Paper!=148){ PErr(); SrcPaper(sn,'148','148'); }
            else if(KindT.indexOf('루프')!=-1&&Paper!=149){ PErr(); SrcPaper(sn,'149','149'); }
            else if(KindT.indexOf('크라프트')!=-1&&Paper!=150){ PErr(); SrcPaper(sn,'150','150'); }
            else if(KindT.indexOf('대례지')!=-1&&Paper!=151){ PErr(); SrcPaper(sn,'151','151'); }
            else if(KindT.indexOf('화이트펄')!=-1&&Paper!=152){ PErr(); SrcPaper(sn,'152','152'); }
            else if(KindT.indexOf('골드펄')!=-1&&Paper!=153){ PErr(); SrcPaper(sn,'153','153'); }
            else if(KindT.indexOf('양면무늬탄트')!=-1&&Paper!=154){ PErr(); SrcPaper(sn,'154','154'); }
            else if(KindT.indexOf('띤또')!=-1&&Paper!=167){ PErr(); SrcPaper(sn,'167','167'); }
        }
    }
    else if(Product==6)
    {
        if(KindT.indexOf('화이트')!=-1&&Paper!=42){ PErr(); SrcPaper(sn,'42','42'); }
        else if(KindT.indexOf('누드')!=-1&&Paper!=43){ PErr(); SrcPaper(sn,'43','43'); }
        else if(KindT.indexOf('골드플러스')!=-1&&Paper!=44){ PErr(); SrcPaper(sn,'44','44'); }
        else if(KindT.indexOf('실버플러스')!=-1&&Paper!=45){ PErr(); SrcPaper(sn,'45','45'); }
        else if(KindT.substring(0,2)=='골드'&&KindT.indexOf('골드플러스')==-1&&Paper!=46){ PErr(); SrcPaper(sn,'46','46'); }
        else if(KindT.substring(0,2)=='실버'&&KindT.indexOf('실버플러스')==-1&&Paper!=47){ PErr(); SrcPaper(sn,'47','47'); }
        else if(KindT.indexOf('거울')!=-1&&Paper!=48){ PErr(); SrcPaper(sn,'48','48'); }
        else if(KindT.substring(0,2)=='금펄'&&Paper!=49){ PErr(); SrcPaper(sn,'49','49'); }
        else if(KindT.substring(0,2)=='은펄'&&Paper!=50){ PErr(); SrcPaper(sn,'50','50'); }
        else if(KindT.indexOf('레인보우')!=-1&&Paper!=51){ PErr(); SrcPaper(sn,'51','51'); }
    }
    else if((Product==15||Product==16)&&Paper!=22){ PErr(); SrcPaper(sn,'22','22'); }
    else if((Product==17)&&Paper!=58){ PErr(); SrcPaper(sn,'58','58'); }
    else if((Product==19||(Product>=23&&Product<=32))&&Paper!=59){ PErr(); SrcPaper(sn,'59','59'); }
    else if((Product==20)&&Paper!=60){ PErr(); SrcPaper(sn,'60','60'); }
    else if((Product==21)&&Paper!=61){ PErr(); SrcPaper(sn,'61','61'); }
    else if((Product==22)&&Paper!=62){ PErr(); SrcPaper(sn,'62','62'); }
    else if((Product==33||Product==34)&&Paper!=18){ PErr(); SrcPaper(sn,'18','18'); }
    else if((Product==35)&&Paper!=1){ PErr(); SrcPaper(sn,'1','1'); }
    else if((Product==36)&&Paper!=20){ PErr(); SrcPaper(sn,'20','20'); }
    else if((Product==37)&&Paper!=17){ PErr(); SrcPaper(sn,'17','17'); }
    else if((Product==38)&&!(Paper>=0&&Paper<=24)){ PErr(); SrcPaper(sn,'20','20'); }
    else if((Product==39)&&!(Paper>=11&&Paper<=24)){ PErr(); SrcPaper(sn,'20','20'); }
    else if((Product==40)&&!(Paper>=11&&Paper<=24)){ PErr(); SrcPaper(sn,'20','20'); }
    else if((Product==41)&&!((Paper>=0&&Paper<=7)||(Paper>=9&&Paper<=24))){ PErr(); SrcPaper(sn,'1','1'); }
    else if((Product==42)&&Paper!=21){ PErr(); SrcPaper(sn,'21','21'); }
    else if((Product==43)&&!(Paper==15||Paper==16||Paper==22||Paper==23)){ PErr(); SrcPaper(sn,'22','22'); Cost(sn); }
    else if((Product==43)&&!(Paper2==13||Paper2==15||Paper2==20||Paper2==22)){ PErr(); SrcPaper(sn,'22','22'); Cost(sn); }
    //else if((Product==44)&&!(Paper==25||Paper==26||Paper==28||Paper==29||Paper==31||Paper==32||Paper==33||Paper==34||Paper==35||Paper==41||Paper==30||Paper==39)){ PErr(); SrcPaper(sn,'25','25'); Cost(sn); }
    else if((Product==45)&&!(Paper==13||Paper==14||Paper==15||Paper==16||Paper==17||Paper==20||Paper==21||Paper==22||Paper==23||Paper==24)){ PErr(); SrcPaper(sn,'15','15'); }
    else if(Product==46)
    {
        if(KindT.substring(0,2)=='라레'&&Paper!=25){ PErr(); SrcPaper(sn,'25','25'); }
        else if(KindT.indexOf('누브')!=-1&&Paper!=26){ PErr(); SrcPaper(sn,'26','26'); }
        else if(KindT.indexOf('화인라레')!=-1&&Paper!=28){ PErr(); SrcPaper(sn,'28','28'); }
        else if(KindT.indexOf('스타-')!=-1&&Paper!=29){ PErr(); SrcPaper(sn,'29','29'); }
        else if(KindT.indexOf('그레')!=-1&&Paper!=31){ PErr(); SrcPaper(sn,'31','31'); }
        else if(KindT.indexOf('빌리')!=-1&&Paper!=32){ PErr(); SrcPaper(sn,'32','32'); }
        else if(KindT.indexOf('머쉬')!=-1&&Paper!=33){ PErr(); SrcPaper(sn,'33','33'); }
        else if(KindT.indexOf('스코')!=-1&&Paper!=34){ PErr(); SrcPaper(sn,'34','34'); }
        else if(KindT.indexOf('팝셋')!=-1&&Paper!=35){ PErr(); SrcPaper(sn,'35','35'); }
        else if(KindT.indexOf('심볼')!=-1&&Paper!=41){ PErr(); SrcPaper(sn,'41','41'); }
        else if(KindT.indexOf('키칼금펄')!=-1&&Paper!=30){ PErr(); SrcPaper(sn,'30','30'); }
        else if(KindT.indexOf('키칼은펄')!=-1&&Paper!=39){ PErr(); SrcPaper(sn,'39','39'); }
    }
    else if((Product==47)&&!(Paper==17||Paper==24)){ PErr(); SrcPaper(sn,'17','17'); }
    else if(Product==48||Product==49||Product==101||Product==102||Product==103||Product==104||Product==112||Product==113||Product==114)
    {
        if(KindT.indexOf('100모조')!=-1&&Paper!=2){ PErr(); SrcPaper(sn,'2','2'); }
        else if(KindT.indexOf('120모조')!=-1&&Paper!=3){ PErr(); SrcPaper(sn,'3','3'); }
        else if(KindT.indexOf('체크레자크91')!=-1&&Paper!=95){ PErr(); SrcPaper(sn,'95','95'); }
        else if(KindT.indexOf('줄레자크92')!=-1&&Paper!=100){ PErr(); SrcPaper(sn,'100','100'); }
    }
    else if((Product==50)&&!(Paper==91||Paper==92||Paper==95||Paper==96||Paper==100||Paper==101)){ PErr(); SrcPaper(sn,'91','91'); }
    else if(Product==51||Product==52||Product==53)
    {
        if(KindT.indexOf('레자크')!=-1&&!(Paper>=72&&Paper<=106)){ PErr(); SrcPaper(sn,'72','72'); }
        else if(KindT.indexOf('탄트')!=-1&&!(Paper>=107&&Paper<=110)){ PErr(); SrcPaper(sn,'107','107'); }
        else if(KindT.indexOf('레이드')!=-1&&!(Paper>=111&&Paper<=115)){ PErr(); SrcPaper(sn,'111','111'); }
        else if(KindT.indexOf('밍크지')!=-1&&!(Paper>=116&&Paper<=130)){ PErr(); SrcPaper(sn,'116','116'); }
        else if(KindT.indexOf('크라프트')!=-1&&Paper!=71){ PErr(); SrcPaper(sn,'71','71'); }
    }
    else if(Product==54)
    {
        if(KindT.indexOf('4절')!=-1&&!(Paper==71||Paper==100)){ alert('98크라프트지, 레자크92백색만 선택가능합니다!'); SrcPaper(sn,'71','71');Cost(sn); }
        else if(KindT.indexOf('5절')!=-1&&!(Paper==71 || Paper==2 || Paper==3 || Paper==72 || Paper==73 || Paper==77 || Paper==92 || Paper==95 || Paper==96 || Paper==100 || Paper==101)){ alert('98크라프트지, 100모조, 120모조, 레자크65백색, 레자크64크림색, 레자크75하늘색, 레자크90연미색, 레자크91백색, 레자크91연미색, 레자크92백색, 레자크92연미색만 선택가능합니다!'); SrcPaper(sn,'71','71');Cost(sn); }
        else if(KindT.indexOf('6절')!=-1&&!(Paper==71||Paper==100)){ alert('98크라프트지, 레자크92백색만 선택가능합니다!'); PErr(); SrcPaper(sn,'71','71');Cost(sn); }
        else if(KindT.indexOf('9절')!=-1&&!(Paper==71 || Paper==100 || Paper==101)){ alert('98크라프트지, 레자크92백색, 레자크92연미색만 선택가능합니다!'); SrcPaper(sn,'71','71');Cost(sn); }
        else if(KindT.indexOf('10절')!=-1&&!(Paper==71)){ alert('98크라프트지만 선택가능합니다!'); SrcPaper(sn,'71','71');Cost(sn); }
        else if(KindT.indexOf('12절')!=-1&&!(Paper==71)){ alert('98크라프트지만 선택가능합니다!'); SrcPaper(sn,'71','71');Cost(sn); }
    }
    else if(Product==55)
    {
        if(KindT.indexOf('A4다대봉투')!=-1&&!(Paper==1 || Paper==2 || Paper==92 || Paper==95 || Paper==100)){ alert('80모조, 100모조, 레자크90연미, 레자크91백색, 레자크92백색만 선택가능합니다!'); SrcPaper(sn,'1','1');Cost(sn); }
        else if(KindT.indexOf('자켓봉투')!=-1&&!(Paper==2 || Paper==72 || Paper==95 || Paper==100 || Paper==101)){ alert('100모조, 레자크64백색, 레자크91백색, 레자크92백색, 레자크92연미색만 선택가능합니다!'); SrcPaper(sn,'2','2');Cost(sn); }
        else if(KindT.indexOf('티켓봉투')!=-1&&!(Paper==92 || Paper==100)){ alert(' 레자크90연미색, 레자크92백색만 선택가능합니다!'); SrcPaper(sn,'92','92');Cost(sn); }
        else if(KindT.indexOf('수강료봉투')!=-1&&!(Paper==72 || Paper==73 || Paper==77)){ alert(' 레자크64백색, 레자크64크림색, 레자크75하늘색만 선택가능합니다!'); SrcPaper(sn,'72','72');Cost(sn); }
        else if(KindT.indexOf('16절다대봉투')!=-1&&!(Paper==1 || Paper==2)){ alert(' 80모조, 100모조만 선택가능합니다!'); SrcPaper(sn,'1','1');Cost(sn); }
        else if(KindT.indexOf('16절황봉투')!=-1&&!(Paper==64)){ alert(' 스지만 선택가능합니다!'); SrcPaper(sn,'64','64');Cost(sn); }
        else if(KindT.indexOf('16절크라프트')!=-1&&!(Paper==69)){ alert(' 70크라프트지만 선택가능합니다!'); SrcPaper(sn,'69','69');Cost(sn); }
        else if(KindT.indexOf('16절색지봉투')!=-1&&!(Paper==65 || Paper==66 || Paper==67 || Paper==68)){ alert(' 70모조노랑, 70모조초록, 70모조하늘, 70모조분홍만 선택가능합니다!'); SrcPaper(sn,'65','65');Cost(sn); }
        else if(KindT.indexOf('부동산봉투')!=-1&&!(Paper==3 || Paper==95 || Paper==100)){ alert(' 120모조, 레크자91백색, 레자크92백색만 선택가능합니다!'); SrcPaper(sn,'3','3');Cost(sn); }
        else if(KindT.indexOf('월급봉투')!=-1&&(Paper!=70)){alert(' 양크라프트지만 선택가능합니다!'); SrcPaper(sn,'70','70');Cost(sn);}
        else if(KindT.indexOf('A4창문봉투')!=-1&&(Paper!=2)){alert(' 100모조만 선택가능합니다!'); SrcPaper(sn,'2','2');Cost(sn);}
        else if(KindT.indexOf('카드봉투')!=-1&&(Paper!=2)){alert(' 100모조만 선택가능합니다!'); SrcPaper(sn,'2','2');Cost(sn);}
        else if(KindT.indexOf('장교')!=-1&&(Paper!=2)){alert(' 100모조만 선택가능합니다!'); SrcPaper(sn,'2','2');Cost(sn);}
        else if(KindT.indexOf('항공')!=-1&&(Paper!=2)){alert(' 100모조만 선택가능합니다!'); SrcPaper(sn,'2','2');Cost(sn);}
        else if(KindT.indexOf('16절이중봉투')!=-1&&(Paper!=2)){alert(' 100모조만 선택가능합니다!'); SrcPaper(sn,'2','2');Cost(sn);}
    }
    else if(Product==111)
    {
        if(KindT.indexOf('100모조')!=-1&&Paper!=2){ PErr(); SrcPaper(sn,'2','2'); }
        else if(KindT.indexOf('120모조')!=-1&&Paper!=3){ PErr(); SrcPaper(sn,'3','3'); }
        else if(KindT.indexOf('체크레자크')!=-1&&!(Paper==95)){ alert('레자크91백색만 선택가능합니다!'); SrcPaper(sn,'95','95'); }
        else if(KindT.indexOf('줄레자크')!=-1&&!(Paper==100)){ alert('레자크92백색만 선택가능합니다!'); SrcPaper(sn,'100','100'); }
    }
    //by lee 20130414 마스타 56 지질 추가
    else if((Product==56||Product==57)&&!(Paper>=0&&Paper<=1)){ PErr(); SrcPaper(sn,'0','0'); }
    //else if((Product==56||Product==57)&&Paper!=0){ PErr(); SrcPaper(sn,'0','0'); }
    //by lee 20130414 신규마스타 98 지질 추가
    else if((Product==59||Product==60||Product==61||Product==98||Product==99||Product==100)&&Paper!=63){ PErr(); SrcPaper(sn,'63','63'); }
    else if((Product==62)&&!((Paper>=1&&Paper<=7)||(Paper>=11&&Paper<=24))){ PErr(); SrcPaper(sn,'1','1'); }
    else if((Product==63)&&!((Paper>=1&&Paper<=7)||(Paper>=11&&Paper<=24))){ PErr(); SrcPaper(sn,'11','11'); }
    else if((Product==79)&&Paper!=132){ PErr(); SrcPaper(sn,'132','132'); }
    else if(Product==80)
    {
        if(KindT.indexOf('100모조')!=-1&&Paper!=2){ PErr(); SrcPaper(sn,'2','2'); }
        else if(KindT.indexOf('200스노우')!=-1&&Paper!=15){ PErr(); SrcPaper(sn,'15','15'); }
        else if(KindT.indexOf('250스노우')!=-1&&Paper!=16){ PErr(); SrcPaper(sn,'16','16'); }
        else if(KindT.indexOf('누브')!=-1&&Paper!=26){ PErr(); SrcPaper(sn,'26','26'); }
    }
    else if(Product==81)
    {
        if(KindT.indexOf('화인라레')!=-1&&Paper!=28){ PErr(); SrcPaper(sn,'28','28'); }
        else if(KindT.indexOf('화인누보')!=-1&&Paper!=133){ PErr(); SrcPaper(sn,'133','133'); }
        else if(KindT.indexOf('화인스노우')!=-1&&Paper!=134){ PErr(); SrcPaper(sn,'134','134'); }
    }


    if((Product==4||Product==5||Product==14||Product==46||Product==7)&&KindT.indexOf('화인라레')!=-1)
    {
        alert('죄송합니다. 화인라레는 판매중단되었습니다!');
        eval('f.Kind_'+sn+'.selectedIndex=0');
        Cost(sn);
    }
    if((Product==44||Product==84||Product==85)&&PaperT.indexOf('화인라레')!=-1)
    {
        alert('죄송합니다. 화인라레는 판매중단되었습니다!');
        eval('f.Kind_'+sn+'.selectedIndex=0');  eval('f.Paper_'+sn+'.selectedIndex=0');
        Cost(sn);
    }

    if((Product==19||Product==20||Product==21||Product==22||Product==79||Product==94)&&KindT.indexOf('도무송')!=-1)
    {
        //스티커,강접스티커,유포지스티커,은데드롱스티커,투명스티커,80모조스티커
        eval('var DomusongKindex = f.DomusongK_'+sn+'.selectedIndex');
        if(DomusongKindex==0)
        {
            change_id2(sn,1);
            eval('f.changeid2_'+sn+'[1].checked = true');
            eval('f.DomusongK_'+sn+'.selectedIndex = OptionSI(sn,"DomusongK",63)');
        }
    }

    //if((Product==19||Product==20||Product==21||Product==22||Product==79||Product==94)&&QuantityR>=100000)
    //{
    //   //스티커,강접스티커,유포지스티커,은데드롱스티커,투명스티커
    //   alert('스티커 10만장이상 접수시에는 관리과로 견적상담후 접수부탁드립니다.');
    //}

    if(!(Product==0||Product==1||Product==110||Product==2||Product==3||Product==4||Product==5||Product==7||Product==6||Product==19||Product==20||Product==21||Product==22||Product==64||Product==65||Product==79||Product==94||Product==120)&&myindex6==1)
    //by lee 고품격 별사이즈
    { alert('별사이즈를 선택하실 수 없습니다...'); eval('f.SizeKind_'+sn+'.selectedIndex = 0');  myindex6 = 0; }

    if((Product==19||Product==20||Product==21||Product==22||Product==79||Product==94)&&(KindT.indexOf('별사이즈')!=-1||KindT.indexOf('투터치')!=-1||KindT.indexOf('도무송')!=-1)){ eval('f.SizeKind_'+sn+'.selectedIndex = myindex6 = 1'); }
    else if((Product==19||Product==20||Product==21||Product==22||Product==79||Product==94)){ eval('f.SizeKind_'+sn+'.selectedIndex = myindex6 = 0'); }

    if((Product==0||Product==1||Product==110||Product==2||Product==3||Product==4||Product==5||Product==6||Product==81||Product==7||Product==120)&&(WidthV<40||HeightV<40||(WidthV*HeightV<2000)))
    {
        alert('50mm×40mm 미만은 재단작업이 안됩니다!');
        eval('f.Width_'+sn+'.value = 50');
        eval('f.Height_'+sn+'.value = 40');
    }

    if((Product==19||Product==20||Product==21||Product==22||Product==79||Product==94)&&(KindT.indexOf('별사이즈')!=-1||KindT.indexOf('투터치')!=-1)&&(WidthV<40||HeightV<40))
    {
        alert('40mm이하는 도무송스티커로 주문하시길 바랍니다!');
        eval('f.Width_'+sn+'.value = 40');
        eval('f.Height_'+sn+'.value = 40');
    }

    if((Product==19||Product==20||Product==21||Product==22||Product==79||Product==94)&&KindT.indexOf('도무송')!=-1&&(WidthV<10||HeightV<10))
    {
        alert('10mm이하는 도무송하실 수 없습니다!');
        eval('f.Width_'+sn+'.value = 10');
        eval('f.Height_'+sn+'.value = 10');
    }

    if(Product==58&&KindT.indexOf('제본')!=-1)
    {
        eval('var changeid2 = f.changeid2_'+sn+'[1].checked');
        if(changeid2==false)
        {
            change_id2(sn,1);
            eval('f.changeid2_'+sn+'[1].checked = true');
        }
        eval('f.JaebonK_'+sn+'.selectedIndex = OptionSI(sn,"JaebonK",106)');
    }

    if(myindex6==0){ eval('f.Width_'+sn+'.disabled = true'); eval('f.Height_'+sn+'.disabled = true'); }
    else{ eval('f.Width_'+sn+'.disabled = false'); eval('f.Height_'+sn+'.disabled = false'); }

    eval('f.PaperCost_'+sn+'.value = 0');
    eval('f.JaepanC_'+sn+'.value = 0');
    eval('f.JaepanC_V_'+sn+'.value = 0');

    if((Product==19||Product==20)&&(WidthV>700||HeightV>700||WidthV*HeightV>350000))
    {
        alert('700보다 큰 사이즈이거나 판에 넘치는 사이즈로 인쇄가 불가합니다! 자세한 사항은 전화문의바랍니다.');
        eval('f.Width_'+sn+'.value = 80');
        eval('f.Height_'+sn+'.value = 50');
        eval('f.Kind_'+sn+'.selectedIndex = 0');
    }
    if((Product==21||Product==22||Product==79||Product==94)&&(WidthV>500||HeightV>500||WidthV*HeightV>175000))
    {
        alert('500보다 큰 사이즈이거나 판에 넘치는 사이즈로 인쇄가 불가합니다! 자세한 사항은 전화문의바랍니다.');
        eval('f.Width_'+sn+'.value = 80');
        eval('f.Height_'+sn+'.value = 50');
        eval('f.Kind_'+sn+'.selectedIndex = 0');
    }

    if((Product==19||Product==20||Product==21||Product==22||Product==79||Product==94)&&(WidthV>750||HeightV>750||WidthV*HeightV>375000))
    {
        alert('750보다 큰 사이즈이거나 판에 넘치는 사이즈로 인쇄가 불가합니다! 자세한 사항은 전화문의바랍니다.');
        eval('f.Width_'+sn+'.value = 80');
        eval('f.Height_'+sn+'.value = 50');
        eval('f.Kind_'+sn+'.selectedIndex = 0');
    }

    if(Product==60&&KindT.indexOf('3매1조')!=-1&&QuantityR>60)
    {
        alert('3매1조는 60권까지 주문이 가능합니다.');
        eval('f.Quantity_'+sn+'.selectedIndex = 0'); Cost(sn);
    }
    if(Product==60&&KindT.indexOf('A4-4매1조')!=-1&&(QuantityR==60||QuantityR==70||QuantityR==90||QuantityR==100))
    {
        alert('A4-4매1조는 60,70,90,100권은 주문을 하실 수 없습니다.');
        eval('f.Quantity_'+sn+'.selectedIndex = 0'); Cost(sn);
    }
    if(Product==60&&KindT.indexOf('16절-4매1조')!=-1&&(QuantityR==30||QuantityR==70||QuantityR==90||QuantityR==100))
    {
        alert('16절-4매1조는 30,70,90,100권은 주문을 하실 수 없습니다.');
        eval('f.Quantity_'+sn+'.selectedIndex = 0'); Cost(sn);
    }

    if(Product==43)
    {
        eval('f.Paper2_'+sn+'.disabled = false');
        eval("f.Paper2_"+sn+".style.background = '#FFFFFF'");
    }
    else
    {
        eval('f.Paper2_'+sn+'.disabled = true');
        eval("f.Paper2_"+sn+".style.background = '#CCCCCC'");
    }

    if(Product==33||Product==35||Product==38||Product==39||Product==40||Product==41)     //100아트합판전단지,80모조합판전단지,독판전단지,독판문고리,독판문어발,단색독판
    {
        if(KindT.substring(0,5)=='국전지단면'){ eval('f.JaepanK_'+sn+'.selectedIndex = 1'); }
        else if(KindT.substring(0,5)=='국전지양면'){ eval('f.JaepanK_'+sn+'.selectedIndex = 2'); }
        else if(KindT.substring(0,4)=='A2단면'){ eval('f.JaepanK_'+sn+'.selectedIndex = 3'); }
        else if(KindT.substring(0,4)=='A2양면'){ eval('f.JaepanK_'+sn+'.selectedIndex = 4'); }
        else if(KindT.substring(0,4)=='2절단면'){ eval('f.JaepanK_'+sn+'.selectedIndex = 5'); }
        else if(KindT.substring(0,4)=='2절양면'){ eval('f.JaepanK_'+sn+'.selectedIndex = 6'); }
        else if(KindT.substring(0,4)=='4절단면'){ eval('f.JaepanK_'+sn+'.selectedIndex = 7'); }
        else if(KindT.substring(0,4)=='4절양면'){ eval('f.JaepanK_'+sn+'.selectedIndex = 8'); }
        else if(eval('f.JaepanK_'+sn+'.selectedIndex!=9')){eval('f.JaepanK_'+sn+'.selectedIndex=0');}
    }
    if(Product==93)     //80코트합판전단지
    {
        eval('f.JaepanK_'+sn+'.selectedIndex = OptionSI(sn,"JaepanK",134)');
        //5배수로만 신청 가능 20110110 수정
        if(QuantityR%5!=0&&QuantityR<20)
        {
            alert('80코트 합판전단지는 5의 배수를 신청하셔야 합니다!');
            eval('f.Quantity_'+sn+'.selectedIndex = 5');
            Quantity = 5; QuantityR = 5; myindex3 = 5;
            parent.frames[1].ChangeQuantity(sn);
            //5배수로만 신청 가능 20110110 수정
        }
    }
    //by lee 20130807 마스타양식지 50장 단위로만 신청가능
    if((Product==56||Product==57||Product==106||Product==107)&&(KindT.indexOf('48절')!=-1||KindT.indexOf('3등분')!=-1))
    {
        if(QuantityR%50!=0||QuantityR > 100)
        {
            alert('50매, 100매만 주문가능합니다.!');
            eval('f.Quantity_'+sn+'.selectedIndex = 6');Cost(sn);
            parent.frames[1].ChangeQuantity(sn);
        }
    }
    //by lee 20130414 NCR 50장 단위로만 신청가능
    if((Product==98||Product==99||Product==100)&&KindT.indexOf('48절')!=-1)
    {
        if(QuantityR%50!=0||QuantityR > 100)
        {
            alert('50장, 100장만 주문가능합니다.!');
            eval('f.Quantity_'+sn+'.selectedIndex = 6');Cost(sn);
            parent.frames[1].ChangeQuantity(sn);
        }
    }
    //by lee 20130414 NCR 50장 단위로만 신청가능
    if((Product==98||Product==99||Product==100)&&KindT.indexOf('A4-3')!=-1)
    {
        if(QuantityR%50!=0||QuantityR > 100)
        {
            alert('50장, 100장만 주문가능합니다.!');
            eval('f.Quantity_'+sn+'.selectedIndex = 6');Cost(sn);
            parent.frames[1].ChangeQuantity(sn);
        }
    }
    if(Product!=''&&Kind!=''&&Paper!=''&&Paper2!=''&&Quantity!='')
    {
        if(Product==33||Product==35)     //100아트합판전단지,80모조합판전단지
        {
            if((KindT.substring(0,2)=='4절'||KindT.substring(0,2)=='A2')&&QuantityR%4!=0&&QuantityR<10)
            {
                alert('10연이하 4절 또는 A2(국2절)은 4의 배수를 신청하셔야 합니다!');
                eval('f.Quantity_'+sn+'.selectedIndex = 4');
                Quantity = 4; QuantityR = 4; myindex3 = 4;
                parent.frames[1].ChangeQuantity(sn);
            }
            if((Product==35)&&(KindT.substring(0,2)=='8절'||KindT.substring(0,2)=='A3')&&QuantityR%2!=0&&QuantityR<10)
            {
                alert('10연이하 8절 또는 A3(국2절)은 2의 배수를 신청하셔야 합니다!');
                eval('f.Quantity_'+sn+'.selectedIndex = 2');
                Quantity = 2; QuantityR = 2; myindex3 = 2;
                parent.frames[1].ChangeQuantity(sn);
            }
            if(!(KindT.substring(0,2)=='8절'||KindT.substring(0,2)=='4절'||KindT.substring(0,2)=='A3'||KindT.substring(0,2)=='A2')&&Product==33&&QuantityR==0.5)
            {
                alert('100아트 합판전단 0.5연은 납기일이 하루 더 소요될 수 있습니다.\n\n접수시에 주의하시기 바랍니다!!');
            }
            if((KindT.substring(0,2)=='A3'||KindT.substring(0,2)=='8절'||Product==35)&&QuantityR==0.5)
            {
                alert('1연 이상만 주문가능합니다.');
                eval('f.Quantity_'+sn+'.selectedIndex = 1');
                Quantity = 1; QuantityR = 1; myindex3 = 1;
                parent.frames[1].ChangeQuantity(sn);
            }
            if(myindex6==1)
            {
                PErr();
                eval('f.SizeKind_'+sn+'.selectedIndex = 0');
            }

            xQuantityR = QuantityR;

            //*******************************
            if(Product==33)     //100아트합판전단지
            {
                if(xQuantityR==0.5)     {Quantity=0;xQuantityR=1;}
                else if(xQuantityR<=30) {Quantity=xQuantityR;}
                else if(xQuantityR<=34) {Quantity=29}
                else if(xQuantityR==35) {Quantity=31}
                else if(xQuantityR<=39) {Quantity=29}
                else if(xQuantityR==40) {Quantity=32}
                else if(xQuantityR<=44) {Quantity=29}
                else if(xQuantityR==45) {Quantity=33}
                else if(xQuantityR<=49) {Quantity=29}
                else if(xQuantityR==50) {Quantity=34}
                else
                {
                    if(xQuantityR%5==0)  {Quantity=35}
                    else{ Quantity=35 }
                }
            }
            else if(Product==35)     //80모조합판전단지
            {
                if(xQuantityR>4)  { alert('80모조합판 5연이상은 독판전단으로 접수부탁드립니다!');eval('f.Quantity_1.selectedIndex = 4'); }
                if(xQuantityR==0.5)     {Quantity=0;xQuantityR=1;}
                else if(xQuantityR==1)  {Quantity=1}
                else if(xQuantityR==2)  {Quantity=2}
                else if(xQuantityR==3)  {Quantity=3}
                else if(xQuantityR==4)  {Quantity=4}
                else if(xQuantityR==5)  {Quantity=5}
                else if(xQuantityR==6)  {Quantity=6}
                else if(xQuantityR==7)  {Quantity=7}
                else if(xQuantityR==8)  {Quantity=8}
                else if(xQuantityR<10)  {Quantity=8}
                else if(xQuantityR<12)  {Quantity=9}
                else if(xQuantityR<15)  {Quantity=10}
                else if(xQuantityR<20)  {Quantity=11}
                else if(xQuantityR<25)  {Quantity=12}
                else if(xQuantityR<30)  {Quantity=13}
                else if(xQuantityR<50)  {Quantity=14}
                else if(xQuantityR>=50) {Quantity=15}
            }
            //*******************************
            //*********50연이하 제판비추가*****
            //if(xQuantityR<50)
            if(xQuantityR >= 10&&xQuantityR <= 14 &&(KindT.substring(0,4)=='A2양면'||KindT.substring(0,4)=='4절양면'))
            {
                eval('var Film_Add = FilmAdd['+Kind+']');
            }
            else{ var Film_Add = 0; }
            //*********50연이하 제판비추가*****
            //*********재단비 추가*****
            eval('var Jaedan_Add = JaedanAdd['+Kind+']');
            //*********재단비 추가*****

            eval('f.Cost_'+sn+'.value = Math.ceil(parseInt(Cost_'+Product+'_'+Kind+'['+Quantity+'])*xQuantityR/100)*100 + parseInt(Jaedan_Add)*xQuantityR');
            eval('f.PaperCost_'+sn+'.value = 0*xQuantityR')
            eval('f.EtcC_'+sn+'.value = 0');
            eval('f.JaepanC_'+sn+'.value = f.JaepanC_V_'+sn+'.value = parseInt(Film_Add)');
            eval('f.TotalCost_'+sn+'.value = ( parseInt(f.Cost_'+sn+'.value) + parseInt(f.PaperCost_'+sn+'.value) + parseInt(Film_Add) )*Pcases');

        }
        else if(Product==93)     //80코트합판전단지
        {
            if(QuantityR<1)
            {
                alert('80코트합판전단는 1연 이상만 주문가능합니다.');
                eval('f.Quantity_'+sn+'.selectedIndex = 1');
                Quantity = 1; QuantityR = 1; myindex3 = 1;
                parent.frames[1].ChangeQuantity(sn);
            }
            xQuantityR = QuantityR
            xxQuantityR = 1
            if(myindex6==1)
            {
                PErr();
                eval('f.SizeKind_'+sn+'.selectedIndex = 0');
            }

            xQuantityR = QuantityR;

            //*******************************
            if(Product==93)     //80코트합판전단지
            {
                if(xQuantityR==0.5)     {Quantity=0;xQuantityR=1;}
                else if(xQuantityR<=30) {Quantity=xQuantityR;}
                else if(xQuantityR<=35) {Quantity=31}
                else if(xQuantityR<=40) {Quantity=32}
                else if(xQuantityR<=45) {Quantity=33}
                else if(xQuantityR<=50) {Quantity=34}
                else                    {Quantity=35}
            }
            //*******************************

            //*********제판비추가*****
            if(xQuantityR<40&&(KindT.substring(0,2)=='2절'||KindT.substring(0,2)=='국전'))
            {
                eval('var Film_Add = FilmAdd['+Kind+']');
            }
            else if(xQuantityR<20&&xQuantityR%5!=0&&KindT.substring(0,2)!='2절'&&KindT.substring(0,2)!='국전')
            {
                eval('var Film_Add = FilmAdd['+Kind+']');
            }
            else if(xQuantityR<20&&(KindT.substring(0,2)=='4절'||KindT.substring(0,2)=='A2'))
            {
                eval('var Film_Add = FilmAdd['+Kind+']');
            }
            else{ var Film_Add = 0; }
            //*********제판비추가*****

            //*********재단비 추가*****
            eval('var Jaedan_Add = JaedanAdd['+Kind+']');
            //*********재단비 추가*****

            eval('f.Cost_'+sn+'.value = Math.ceil(parseInt(Cost_'+Product+'_'+Kind+'['+Quantity+'])*xQuantityR/100)*100 + parseInt(Jaedan_Add)*xQuantityR');
            eval('f.PaperCost_'+sn+'.value = 0*xQuantityR')
            eval('f.EtcC_'+sn+'.value = 0');
            eval('f.JaepanC_'+sn+'.value = f.JaepanC_V_'+sn+'.value = parseInt(Film_Add)');
            eval('f.TotalCost_'+sn+'.value = ( parseInt(f.Cost_'+sn+'.value) + parseInt(f.PaperCost_'+sn+'.value) + parseInt(Film_Add) )*Pcases');

        }
        else if(Product==37)
        {
            xQuantityR = QuantityR //메뉴판합판 --> 후가공계산을 위해
            //*********재단비 추가*****
            eval('var Jaedan_Add = JaedanAdd['+Kind+']');
            //*********재단비 추가*****
            eval('f.Cost_'+sn+'.value = parseInt(Cost_'+Product+'_'+Kind+'['+Quantity+']) + parseInt(Jaedan_Add)*xQuantityR');
            eval('f.PaperCost_'+sn+'.value = 0');
            eval('f.TotalCost_'+sn+'.value = (f.Cost_'+sn+'.value)*Pcases');
        }
        else if(Product==38||Product==39||Product==40||Product==41)
        {
            //독판전단지,독판문고리,독판문어발,단색독판
            if((Product==39||Product==40)&&QuantityR<1)
            {
                //alert('독판문고리,독판문어발은 1연 이상만 주문가능합니다.');
                //eval('f.Quantity_'+sn+'.selectedIndex = 1');
                //Quantity = 1; QuantityR = 1; myindex3 = 1;
                //parent.frames[1].ChangeQuantity(sn);
            }
            xQuantityR = QuantityR
            xxQuantityR = 1
            //*******************************
            ////201204 80모조 추가
            if(Product==41){
                if(xQuantityR==0.5)     {Quantity=0;xQuantityR=1;xxQuantityR=0.5;}
                else if(xQuantityR==1)  {Quantity=1;}
                else if(xQuantityR==2)  {Quantity=2;}
                else if(xQuantityR==3)  {Quantity=3;}
                else if(xQuantityR==4)  {Quantity=4;}
                else if(xQuantityR==5)  {Quantity=5;}
                else if(xQuantityR==6)  {Quantity=6;}
                else if(xQuantityR==7)  {Quantity=7;}
                else if(xQuantityR==8)  {Quantity=8;}
                else if(xQuantityR==9)  {Quantity=9;}
                else if(xQuantityR<20) 	{Quantity=10;}
                else if(xQuantityR<30) 	{Quantity=13;}
                else if(xQuantityR<50)  {Quantity=15;}
                else{Quantity=16;}
            }else if(Product==38){
                //alert(xQuantityR);
                if(xQuantityR==0.5)     {Quantity=0;xQuantityR=1;xxQuantityR=0.5}
                else if(xQuantityR==1)  {Quantity=1}
                else if(xQuantityR==2)  {Quantity=2}
                else if(xQuantityR==3)  {Quantity=3}
                else if(xQuantityR==4)  {Quantity=4}
                else if(xQuantityR==5)  {Quantity=5}
                else if(xQuantityR==6)  {Quantity=6}
                else if(xQuantityR==7)  {Quantity=7}
                else if(xQuantityR==8)  {Quantity=8}
                else if(xQuantityR==9)  {Quantity=9}
                else if(xQuantityR==10) {Quantity=10}
                else if(xQuantityR<15)  {Quantity=10}
                else if(xQuantityR<20)  {Quantity=11}
                else if(xQuantityR<25)  {Quantity=12}
                else if(xQuantityR<30)  {Quantity=13}
                else if(xQuantityR<40)  {Quantity=14}
                else if(xQuantityR<50)  {Quantity=15}
                else if(xQuantityR>=50) {Quantity=16}
            }else{
                if(xQuantityR==0.5)     {Quantity=0;xQuantityR=1;xxQuantityR=0.5}
                else if(xQuantityR==1)  {Quantity=1}
                else if(xQuantityR==2)  {Quantity=2}
                else if(xQuantityR==3)  {Quantity=3}
                else if(xQuantityR==4)  {Quantity=4}
                else if(xQuantityR==5)  {Quantity=5}
                else if(xQuantityR==6)  {Quantity=6}
                else if(xQuantityR==7)  {Quantity=7}
                else if(xQuantityR==8)  {Quantity=8}
                else if(xQuantityR<10)  {Quantity=8}
                else if(xQuantityR<12)  {Quantity=9}
                else if(xQuantityR<15)  {Quantity=10}
                else if(xQuantityR<20)  {Quantity=11}
                else if(xQuantityR<25)  {Quantity=12}
                else if(xQuantityR<30)  {Quantity=13}
                else if(xQuantityR<50)  {Quantity=14}
                else if(xQuantityR>=50) {Quantity=15}
            }
            //*******************************
            //*********50연이하 필름절수가*****
            if(xQuantityR<50)
            {
                eval('var Film_Add = FilmAdd['+Kind+']');
            }
            else{ var Film_Add = 0; }
            //*********50연이하 필름절수가*****
            //*********재단비 추가*****
            eval('var Jaedan_Add = JaedanAdd['+Kind+']');
            //*********재단비 추가*****
            eval('f.Cost_'+sn+'.value = ( parseInt(Cost_'+Product+'_'+Kind+'['+Quantity+']) + parseInt(Jaedan_Add) )*xQuantityR');
            if(xxQuantityR==0.5){ Multiple_Num = 1 }
            else{ Multiple_Num = 1 }
            if(KindT.indexOf('절')!=-1||KindT.indexOf('46전지')!=-1)
            {eval('f.PaperCost_'+sn+'.value = ( Paper_'+Product+'_Cost_B['+myindex5+']*Multiple_Num )*xQuantityR*xxQuantityR');}
            else
            {eval('f.PaperCost_'+sn+'.value = ( Paper_'+Product+'_Cost_A['+myindex5+']*Multiple_Num)*xQuantityR*xxQuantityR');}
            eval('f.EtcC_'+sn+'.value = 0');
            eval('f.JaepanC_'+sn+'.value = f.JaepanC_V_'+sn+'.value = parseInt(Film_Add)');
            eval('f.TotalCost_'+sn+'.value = (parseInt(f.Cost_'+sn+'.value)+parseInt(f.PaperCost_'+sn+'.value) + parseInt(Film_Add))*Pcases');
        }
        //by lee 20130807 마스타 지질별 가격 추가
        else if((Product==56 || Product==57)){
            xQuantityR = QuantityR
            xxQuantityR = 1
            if(KindT.indexOf('48절') == -1 && KindT.indexOf('3등분') == -1){
                eval('f.Cost_'+sn+'.value = Cost_'+Product+'_'+Kind+'['+Quantity+']');
                if(myindex5==0){
                    eval('f.PaperCost_'+sn+'.value = 0');
                }else{
                    if(KindT.indexOf('절')!=-1){
                        if(xQuantityR==10){ 			Tomoney =   1000  ;}
                        else if(xQuantityR==15){ 	Tomoney =   1000  ;}
                        else if(xQuantityR==20){ 	Tomoney =   1000  ;}
                        else if(xQuantityR==25){ 	Tomoney =   3000  ;}
                        else if(xQuantityR==30){ 	Tomoney =   2000  ;}
                        else if(xQuantityR==40){ 	Tomoney =   2000  ;}
                        else if(xQuantityR==50){ 	Tomoney =   3000  ;}
                        else if(xQuantityR==60){ 	Tomoney =   4000  ;}
                        else if(xQuantityR==70){ 	Tomoney =   5000  ;}
                        else if(xQuantityR==80){ 	Tomoney =   5000  ;}
                        else if(xQuantityR==90){ 	Tomoney =   6000  ;}
                        else if(xQuantityR==100){ Tomoney =   7000  ;}
                        else if(xQuantityR==120){ Tomoney =   7000  ;}
                        else if(xQuantityR==140){ Tomoney =   9000  ;}
                        else if(xQuantityR==160){ Tomoney =   10000 ;}
                        else if(xQuantityR==200){ Tomoney =   12000 ;}
                        else if(xQuantityR==240){ Tomoney =   15000 ;}
                        else if(xQuantityR==280){ Tomoney =   17000 ;}
                        else if(xQuantityR==320){ Tomoney =   20000 ;}
                        else if(xQuantityR==360){ Tomoney =   22000 ;}
                        else if(xQuantityR==400){ Tomoney =   25000 ;}
                    }else{
                        if(xQuantityR==10){ Tomoney =  1000;  }
                        else if(xQuantityR==15){ Tomoney =  2000;  }
                        else if(xQuantityR==20){ Tomoney =  3000;  }
                        else if(xQuantityR==25){ Tomoney =  4000;  }
                        else if(xQuantityR==30){ Tomoney =  4000;  }
                        else if(xQuantityR==40){ Tomoney =  5000;  }
                        else if(xQuantityR==50){ Tomoney =  6000;  }
                        else if(xQuantityR==60){ Tomoney =  8000;  }
                        else if(xQuantityR==70){ Tomoney =  9000;  }
                        else if(xQuantityR==80){ Tomoney =  10000; }
                        else if(xQuantityR==90){ Tomoney =  11000; }
                        else if(xQuantityR==100){ Tomoney =  12000; }
                        else if(xQuantityR==120){ Tomoney =  15000; }
                        else if(xQuantityR==140){ Tomoney =  18000; }
                        else if(xQuantityR==160){ Tomoney =  20000; }
                        else if(xQuantityR==200){ Tomoney =  25000; }
                        else if(xQuantityR==240){ Tomoney =  30000; }
                        else if(xQuantityR==280){ Tomoney =  35000; }
                        else if(xQuantityR==320){ Tomoney =  40000; }
                        else if(xQuantityR==360){ Tomoney =  45000; }
                        else if(xQuantityR==400){ Tomoney =  50000; }
                    }
                    eval('f.PaperCost_'+sn+'.value = Tomoney;');
                }
                eval('f.TotalCost_'+sn+'.value = (parseInt(f.Cost_'+sn+'.value)+parseInt(f.PaperCost_'+sn+'.value))*Pcases');
            }else{
                if(xQuantityR==50)     		{xxQuantityR=1}
                else if(xQuantityR==100)  {xxQuantityR=2}
                else if(xQuantityR==200)  {xxQuantityR=4}
                else if(xQuantityR==300)  {xxQuantityR=6}
                else if(xQuantityR==400)  {xxQuantityR=8}
                else if(xQuantityR==500)  {xxQuantityR=10}
                else if(xQuantityR==600)  {xxQuantityR=12}
                else if(xQuantityR==700)  {xxQuantityR=14}
                else if(xQuantityR==800)  {xxQuantityR=16}
                else if(xQuantityR==900)  {xxQuantityR=18}
                else if(xQuantityR==1000) {xxQuantityR=20}
                eval('f.Cost_'+sn+'.value = Cost_'+Product+'_'+Kind+'['+Quantity+']');
                if(myindex5==0){
                    eval('f.PaperCost_'+sn+'.value = 0');
                }else{
                    if(KindT.indexOf('절')!=-1){
                        eval('f.PaperCost_'+sn+'.value = ( Paper_'+Product+'_Cost_B['+myindex5+']*1)*xxQuantityR');
                    }else{
                        eval('f.PaperCost_'+sn+'.value = ( Paper_'+Product+'_Cost_A['+myindex5+']*1)*xxQuantityR');
                    }
                }
                eval('f.TotalCost_'+sn+'.value = (parseInt(f.Cost_'+sn+'.value)+parseInt(f.PaperCost_'+sn+'.value))*Pcases');
            }
        }
        else if((Product==43))  //중철카다로그
        {
            if(Paper==13){ xPaper = 20; }
            else if(Paper==14){ xPaper = 21; }
            else if(Paper==15){ xPaper = 22; }
            else if(Paper==16){ xPaper = 23; }
            else if(Paper==17){ xPaper = 24; }
            else{ xPaper = Paper; }
            if(Paper2==13){ xPaper2 = 20; }
            else if(Paper2==14){ xPaper2 = 21; }
            else if(Paper2==15){ xPaper2 = 22; }
            else if(Paper2==16){ xPaper2 = 23; }
            else if(Paper2==17){ xPaper2 = 24; }
            else{ xPaper2 = Paper2; }
            if(xPaper==22&&(xPaper2==20||xPaper2==22)){  }
            else if(xPaper==23&&(xPaper2==22)){  }
            else { alert('단가표에 있는 표지,내지만 선택가능합니다!'); SrcPaper(sn,'22','22'); Cost(sn); }
            eval('f.Cost_'+sn+'.value = Cost_'+Product+'_'+QuantityR+'_'+xPaper+'_'+xPaper2+'['+myindex2+']');
            eval('f.PaperCost_'+sn+'.value = 0');
            eval('f.TotalCost_'+sn+'.value = (f.Cost_'+sn+'.value)*Pcases');
        }
        else if((Product==44||Product==54||Product==55))  //수입지카다로그
        {
            eval('myindex7 = f.Paper2_'+sn+'.selectedIndex = myindex5');
            eval('Paper2 = f.Paper2_'+sn+'.options[myindex7].value = Paper');
            eval('Paper2T = f.Paper2_'+sn+'.options[myindex7].text = PaperT');
            eval('f.Cost_'+sn+'.value = Cost_'+Product+'_'+Kind+'_'+Paper+'_'+Paper2+'['+myindex3+']');
            eval('f.PaperCost_'+sn+'.value = 0');
            eval('f.TotalCost_'+sn+'.value = (f.Cost_'+sn+'.value)*Pcases');
        }
        else if((Product==62||Product==63))  //초소량옵셋인쇄,디지탈인쇄
        {
            if(Paper==1||Paper==11){ xPaper = 18; }
            else if(Paper==2||Paper==12){ xPaper = 19; }
            else if(Paper==3||Paper==13){ xPaper = 20; }
            else if(Paper==4||Paper==14){ xPaper = 21; }
            else if(Paper==5||Paper==15){ xPaper = 22; }
            else if(Paper==6||Paper==16){ xPaper = 23; }
            else if(Paper==7||Paper==17){ xPaper = 24; }
            else{ xPaper = Paper; }
            xPaper2 = xPaper;
            eval('f.Cost_'+sn+'.value = Cost_'+Product+'_'+Kind+'_'+xPaper+'_'+xPaper2+'['+myindex3+']');
            eval('f.PaperCost_'+sn+'.value = 0');
            eval('f.TotalCost_'+sn+'.value = (f.Cost_'+sn+'.value)*Pcases');
        }
        else if((Product==105))  //20141118 by lee 부분에폭시 추가
        {
            eval('f.Cost_'+sn+'.value = Cost_'+Product+'_'+Kind+'['+Quantity+']');
            eval('f.PaperCost_'+sn+'.value = 0');
            eval('f.TotalCost_'+sn+'.value = (f.Cost_'+sn+'.value)*Pcases');
        }
        else if((Product==90||Product==91||Product==92))  //디지탈소량인쇄(신제품),디지탈인쇄(후가공1),디지탈인쇄(후가공2)
        {
            xPaper = Paper;
            xPaper2 = xPaper;
            eval('f.Cost_'+sn+'.value = Cost_'+Product+'_'+Kind+'_'+xPaper+'_'+xPaper2+'['+myindex3+']');
            //eval('f.Cost_'+sn+'.value = 0');//가격 막혀있던 부분 해제 by lee 20150213
            eval('f.PaperCost_'+sn+'.value = 0');
            eval('f.TotalCost_'+sn+'.value = (f.Cost_'+sn+'.value)*Pcases');
        }
        else if((Product==19||Product==20||Product==94))  //스티커,강접스티커,80모조스티커
        {
            if(myindex6==1)
            {
                if(Product==19||Product==94)
                {
                    if(QuantityR==1000){ QuantityRValue = 0.15; }
                    else if(QuantityR<5000){ QuantityRValue = 0.15; }
                    else if(QuantityR<=5000){ QuantityRValue = 0.14; }
                    else if(QuantityR<10000){ QuantityRValue = 0.13; }
                    else if(QuantityR<50000){ QuantityRValue = 0.12; }
                    else{ QuantityRValue = 0.11; }
                }
                else
                {
                    if(QuantityR==1000){ QuantityRValue = 0.18; }
                    else if(QuantityR<5000){ QuantityRValue = 0.18; }
                    else if(QuantityR<=5000){ QuantityRValue = 0.17; }
                    else if(QuantityR<10000){ QuantityRValue = 0.16; }
                    else if(QuantityR<50000){ QuantityRValue = 0.15; }
                    else{ QuantityRValue = 0.14; }
                }
                if(KindT.indexOf('별사이즈')!=-1){ WidthV10 = (WidthV/10); HeightV10 = (HeightV/10); }
                else{ WidthV10 = (WidthV/10+0.6); HeightV10 = (HeightV/10+0.6); } //투터치
                WHCost = QuantityR*WidthV10*HeightV10*QuantityRValue*1.1;
                WHCost = Math.ceil(parseInt(WHCost)/100)*100;
                if(Product==19)
                {
                    eval('BWHCost = parseInt(Cost_'+Product+'_421[myindex3])'); //****기준가격 60*40
                }
                else if(Product==94)
                {
                    eval('BWHCost = parseInt(Cost_'+Product+'_1453[myindex3])'); //****기준가격 60*40
                }
                else
                {
                    eval('BWHCost = parseInt(Cost_'+Product+'_453[myindex3])'); //****기준가격 60*40
                }
                if(WHCost<BWHCost)	{ WHCost = BWHCost; }
                eval('f.Cost_'+sn+'.value = WHCost');
            }
            else{ eval('f.Cost_'+sn+'.value = Cost_'+Product+'_'+Kind+'['+Quantity+']');  }
            eval('f.PaperCost_'+sn+'.value = 0');
            eval('f.TotalCost_'+sn+'.value = (f.Cost_'+sn+'.value)*Pcases');
        }
        else if((Product==21||Product==22||Product==79))  //유포지스티커,은데드롱스티커,투명스티커
        {
            if(myindex6==1)
            {
                if(Product==22||Product==79)
                {
                    if(QuantityR==1000){ QuantityRValue = 0.35; }
                    else if(QuantityR<5000){ QuantityRValue = 0.34; }
                    else if(QuantityR<=5000){ QuantityRValue = 0.32; }
                    else if(QuantityR<10000){ QuantityRValue = 0.31; }
                    else if(QuantityR<50000){ QuantityRValue = 0.30; }
                    else{ QuantityRValue = 0.25; }
                }
                else
                {
                    if(QuantityR==1000){ QuantityRValue = 0.35; }
                    else if(QuantityR<5000){ QuantityRValue = 0.34; }
                    else if(QuantityR<=5000){ QuantityRValue = 0.32; }
                    else if(QuantityR<10000){ QuantityRValue = 0.31; }
                    else if(QuantityR<50000){ QuantityRValue = 0.30; }
                    else{ QuantityRValue = 0.25; }
                }
                //QuantityRValue = 0.28;
                if(KindT.indexOf('별사이즈')!=-1){ WidthV10 = WidthV/10; HeightV10 = HeightV/10; }
                else{ WidthV10 = WidthV/10+1.0; HeightV10 = HeightV/10+1.0; } //투터치
                if(KindT.indexOf('도무송')!=-1&&WidthV10<4){ WidthV10 = 4;}
                if(KindT.indexOf('도무송')!=-1&&HeightV10<4){ HeightV10 = 4;}
                if(QuantityR==500){ WHCost = 1000*WidthV10*HeightV10*QuantityRValue*0.8*1.1; }
                else{ WHCost = QuantityR*WidthV10*HeightV10*QuantityRValue*1.1; }
                WHCost = Math.ceil(parseInt(WHCost)/100)*100;
                if(Product==21)
                {
                    eval('BWHCost = parseInt(Cost_'+Product+'_485[myindex3])'); //****기준가격 80*50
                }
                else if(Product==22)
                {
                    eval('BWHCost = parseInt(Cost_'+Product+'_499[myindex3])'); //****기준가격 80*50
                }
                else
                {
                    eval('BWHCost = parseInt(Cost_'+Product+'_1326[myindex3])'); //****기준가격 80*50
                }
                if(WHCost<BWHCost)	{ WHCost = BWHCost; }
                eval('f.Cost_'+sn+'.value = WHCost');
            }
            else{  eval('f.Cost_'+sn+'.value = Cost_'+Product+'_'+Kind+'['+Quantity+']');  }
            eval('f.PaperCost_'+sn+'.value = 0');
            eval('f.TotalCost_'+sn+'.value = (f.Cost_'+sn+'.value)*Pcases');
        }
        else if(Product==0||Product==1||Product==110||Product==2||Product==3||Product==4||Product==5||Product==6||Product==81||Product==7||Product==120)
        {
            //일반명함,고품격명함,당일오전판,복권,수입지명함300,수입지명함200,카드명함,수입지귀돌이명함
            if(myindex6==1)
            {
                if(Product==0||Product==1||Product==110||Product==2)
                {
                    var BWidth = 92;
                    var BHeight = 52;
                    var BBWidth = 90;
                    var BBHeight = 50;
                    var C_BWidth = 88;
                    var C_BHeight = 54;
                    var C_BBWidth = 86;
                    var C_BBHeight = 52;
                }
                else if(Product==3)
                {
                    //if(Product==3){ alert('복권별사이즈는 관리부로 문의하십시요!'); }
                    var BWidth = 88;
                    var BHeight = 54;
                    var BBWidth = 86;
                    var BBHeight = 52;
                }
                else if(Product==4||Product==5||Product==7||Product==120)
                {
                    var BWidth = 92;
                    var BHeight = 52;
                    var BBWidth = 90;
                    var BBHeight = 50;
                }
                else if(Product==81)
                {
                    var BWidth = 90;
                    var BHeight = 54;
                    var BBWidth = 88;
                    var BBHeight = 52;
                }
                else if(Product==6)
                {
                    var BWidth = 90;
                    var BHeight = 58;
                    var BBWidth = 86;
                    var BBHeight = 54;
                }
                var Baesu = 1;
                var Baesu1 = 1;
                var Baesu3 = 1;
                var Baesu4 = 1;
                eval('Width = parseInt(f.Width_'+sn+'.value)')
                eval('Height = parseInt(f.Height_'+sn+'.value)')
                //****가로계산***********************
                WidthV = Width - BBWidth;
                HeightV = Height - BBHeight;
                if(WidthV<=0&&HeightV<=0){ Baesu = 1; }
                else if(WidthV==0)
                {
                    DividingH = HeightV/BHeight+1;
                    Baesu = Math.ceil(DividingH);
                }
                else if(HeightV==0)
                {
                    DividingW = WidthV/BWidth+1;
                    Baesu = Math.ceil(DividingW);
                }
                else
                {
                    DividingW = WidthV/BWidth+1;
                    DividingH = HeightV/BHeight+1;
                    Baesu = Math.ceil(DividingW)*Math.ceil(DividingH);
                }
                //****세로계산***********************
                WidthV = Height - BBWidth;
                HeightV = Width - BBHeight;
                if(WidthV<=0&&HeightV<=0){ Baesu1 = 1; }
                else if(WidthV==0)
                {
                    DividingH = HeightV/BHeight+1;
                    Baesu1 = Math.ceil(DividingH);
                }
                else if(HeightV==0)
                {
                    DividingW = WidthV/BWidth+1;
                    Baesu1 = Math.ceil(DividingW);
                }
                else
                {
                    DividingW = WidthV/BWidth+1;
                    DividingH = HeightV/BHeight+1;
                    Baesu1 = Math.ceil(DividingW)*Math.ceil(DividingH);
                }
                if(Product==0||Product==1||Product==110||Product==2){
                    //****가로계산***********************
                    WidthV = Width - C_BBWidth;
                    HeightV = Height - C_BBHeight;
                    if(WidthV<=0&&HeightV<=0){ Baesu3 = 1; }
                    else if(WidthV==0)
                    {
                        DividingH = HeightV/C_BHeight+1;
                        Baesu3 = Math.ceil(DividingH);
                    }
                    else if(HeightV==0)
                    {
                        DividingW = WidthV/C_BWidth+1;
                        Baesu3 = Math.ceil(DividingW);
                    }
                    else
                    {
                        DividingW = WidthV/C_BWidth+1;
                        DividingH = HeightV/C_BHeight+1;
                        Baesu3 = Math.ceil(DividingW)*Math.ceil(DividingH);
                    }
                    //****세로계산***********************
                    WidthV = Height - C_BBWidth;
                    HeightV = Width - C_BBHeight;
                    if(WidthV<=0&&HeightV<=0){ Baesu4 = 1; }
                    else if(WidthV==0)
                    {
                        DividingH = HeightV/C_BHeight+1;
                        Baesu4 = Math.ceil(DividingH);
                    }
                    else if(HeightV==0)
                    {
                        DividingW = WidthV/C_BWidth+1;
                        Baesu4 = Math.ceil(DividingW);
                    }
                    else
                    {
                        DividingW = WidthV/C_BWidth+1;
                        DividingH = HeightV/C_BHeight+1;
                        Baesu4 = Math.ceil(DividingW)*Math.ceil(DividingH);
                    }
                    //****결론*****************************
                    var LastBaesu = [Baesu, Baesu1, Baesu3, Baesu4];
                    Baesu = Math.min.apply(null, LastBaesu);
                }else{
                    //****결론*****************************
                    if(Baesu<=Baesu1){ Baesu = Baesu; }
                    else if(Baesu>Baesu1){ Baesu = Baesu1; }
                }
            }
            else{ Baesu=1; }
            eval('f.Cost_'+sn+'.value = Cost_'+Product+'_'+Kind+'['+Quantity+']*Baesu');
            eval('f.PaperCost_'+sn+'.value = 0');
            eval('f.TotalCost_'+sn+'.value = (f.Cost_'+sn+'.value)*Pcases');
        }
        else if(Product==58)  //마스타양식지3
        {
            if(Paper==1)     { eval('f.PaperCost_'+sn+'.value = 3000*QuantityR'); }
            else if(Paper==2){ eval('f.PaperCost_'+sn+'.value = 10000*QuantityR'); }
            eval('f.Cost_'+sn+'.value = parseInt(Cost_'+Product+'_'+Kind+'['+Quantity+'])');
            eval('f.TotalCost_'+sn+'.value = ( parseInt(f.Cost_'+sn+'.value) + parseInt(f.PaperCost_'+sn+'.value) )*Pcases');
        }
        else
        {
            if((Product==36)&&(KindT.substring(0,2)=='8절'||KindT.substring(0,2)=='A3')&&QuantityR%2!=0&&QuantityR<10)
            {
                alert('10연이하 8절 또는 A3(국2절)은 2의 배수를 신청하셔야 합니다!');
                eval('f.Quantity_'+sn+'.selectedIndex = 1');
                Quantity = 1; QuantityR = 1; myindex3 = 1;
                parent.frames[1].ChangeQuantity(sn);
            }
            eval('f.Cost_'+sn+'.value = Cost_'+Product+'_'+Kind+'['+Quantity+']');
            eval('f.PaperCost_'+sn+'.value = 0');
            eval('f.TotalCost_'+sn+'.value = (f.Cost_'+sn+'.value)*Pcases');
            if(Product==34||Product==36)
            {
                //문어발합판,150아트합판전단지 --> 후가공계산을 위해
                xQuantityR = QuantityR
            }
            else if(Product==7)
            {
                //EstimateMSG = EstimateMSG + ', 스피드카드'; EstimateCount = EstimateCount + 1;
            }
        }

        var BAmount = 0;
        var BJAmount = 0;
        var MisingValue = 0;
        var OsiValue = 0;
        var TagongValue = 0;
        var DomusongValue = 0;
        var CottingValue = 0;
        var JubgyValue = 0;
        var JaebonValue = 0;
        var FoilValue = 0;
        var HungAbValue = 0;
        var JaeDanValue = 0;
        var SpecialColorValue = 0;
        var NumberingValue = 0;
        var JaepanValue = 0;
        var AccuracyValue = 0;

        var BJubgyKValue = 0;
        var BOsiValue = 0;
        var BTagongValue = 0;
        var BJaebonKValue = 0;

        eval('var MisingKindex = f.MisingK_'+sn+'.selectedIndex');
        eval('MisingKV = f.MisingK_'+sn+'.options[MisingKindex].value');
        eval('MisingKTxt = f.MisingK_'+sn+'.options[MisingKindex].text');
        eval('var OsiKindex = f.OsiK_'+sn+'.selectedIndex');
        eval('OsiKV = f.OsiK_'+sn+'.options[OsiKindex].value');
        eval('OsiKTxt = f.OsiK_'+sn+'.options[OsiKindex].text');
        eval('var TagongKindex = f.TagongK_'+sn+'.selectedIndex');
        eval('TagongKV = f.TagongK_'+sn+'.options[TagongKindex].value');
        eval('TagongKTxt = f.TagongK_'+sn+'.options[TagongKindex].text');
        eval('var DomusongKindex = f.DomusongK_'+sn+'.selectedIndex');
        eval('DomusongKV = f.DomusongK_'+sn+'.options[DomusongKindex].value');
        eval('DomusongKTxt = f.DomusongK_'+sn+'.options[DomusongKindex].text');
        eval('var CottingKindex = f.CottingK_'+sn+'.selectedIndex');
        eval('CottingKV = f.CottingK_'+sn+'.options[CottingKindex].value');
        eval('CottingKTxt = f.CottingK_'+sn+'.options[CottingKindex].text');
        eval('var JubgyKindex = f.JubgyK_'+sn+'.selectedIndex');
        eval('JubgyKV = f.JubgyK_'+sn+'.options[JubgyKindex].value');
        eval('JubgyKTxt = f.JubgyK_'+sn+'.options[JubgyKindex].text');
        eval('var JaebonKindex = f.JaebonK_'+sn+'.selectedIndex');
        eval('JaebonKV = f.JaebonK_'+sn+'.options[JaebonKindex].value');
        eval('JaebonKTxt = f.JaebonK_'+sn+'.options[JaebonKindex].text');
        eval('var FoilKindex = f.FoilK_'+sn+'.selectedIndex');
        eval('FoilKV = f.FoilK_'+sn+'.options[FoilKindex].value');
        eval('FoilKTxt = f.FoilK_'+sn+'.options[FoilKindex].text');
        eval('var HungAbKindex = f.HungAbK_'+sn+'.selectedIndex');
        eval('HungAbKV = f.HungAbK_'+sn+'.options[HungAbKindex].value');
        eval('HungAbKTxt = f.HungAbK_'+sn+'.options[HungAbKindex].text');
        eval('var JaeDanKindex = f.JaeDanK_'+sn+'.selectedIndex');
        eval('JaeDanKV = f.JaeDanK_'+sn+'.options[JaeDanKindex].value');
        eval('JaeDanKTxt = f.JaeDanK_'+sn+'.options[JaeDanKindex].text');
        eval('var SpecialColorKindex = f.SpecialColorK_'+sn+'.selectedIndex');
        eval('SpecialColorKV = f.SpecialColorK_'+sn+'.options[SpecialColorKindex].value');
        eval('SpecialColorKTxt = f.SpecialColorK_'+sn+'.options[SpecialColorKindex].text');
        eval('var NumberingKindex = f.NumberingK_'+sn+'.selectedIndex');
        eval('NumberingKV = f.NumberingK_'+sn+'.options[NumberingKindex].value');
        eval('NumberingKTxt = f.NumberingK_'+sn+'.options[NumberingKindex].text');
        eval('var JaepanKindex = f.JaepanK_'+sn+'.selectedIndex');
        eval('JaepanKV = f.JaepanK_'+sn+'.options[JaepanKindex].value');
        eval('JaepanKTxt = f.JaepanK_'+sn+'.options[JaepanKindex].text');
        eval('var AccuracyKindex = f.AccuracyK_'+sn+'.selectedIndex');
        eval('AccuracyKV = f.AccuracyK_'+sn+'.options[AccuracyKindex].value');
        eval('AccuracyKTxt = f.AccuracyK_'+sn+'.options[AccuracyKindex].text');

        eval('AfterWorkCheck = f.changeid2_'+sn+'[1].checked');

        if(Product==59||Product==60||Product==61)   //NCR1,NCR2,NCR3
        {
            if(Product==59||Product==60)
            {
                var BQunatity = 8000;
                var TQunatity = 100;
                if(KindT.indexOf('48절')!=-1)     { BQunatity = 24000; }
                else if(KindT.indexOf('32절')!=-1){ BQunatity = 16000; }
                else if(KindT.indexOf('16절')!=-1){ BQunatity =  8000; }
                else if(KindT.indexOf('A5')!=-1)  { BQunatity =  8000; }
                else if(KindT.indexOf('3등')!=-1) { BQunatity = 12000; }
                else if(KindT.indexOf('A4')!=-1)  { BQunatity =  4000; }

                if(KindT.indexOf('2매')!=-1)      { TQunatity = 100*QuantityR; }
                else if(KindT.indexOf('3매')!=-1) { TQunatity = 150*QuantityR; }
                else if(KindT.indexOf('4매')!=-1) { TQunatity = 200*QuantityR; }

            }
            //**************제판비***********************************************************
            if(JaepanKV!='')
            {
                if(JaepanKTxt=='1도인쇄비추가')      { JaepanValue=9000; }
                else if(JaepanKTxt=='2도인쇄비추가') { JaepanValue=18000; }
                else if(JaepanKTxt=='3도인쇄비추가') { JaepanValue=27000; }
                else if(JaepanKTxt=='4도인쇄비추가') { JaepanValue=35000; }
                else if(JaepanKTxt=='5도인쇄비추가') { JaepanValue=43000; }

                if(Product==59||Product==60){ JaepanValue = JaepanValue*Math.ceil(TQunatity/BQunatity);}
                else { JaepanValue = JaepanValue*QuantityR }

                eval('f.JaepanC_'+sn+'.value = f.JaepanC_V_'+sn+'.value = JaepanValue');
            }
            else{ eval('f.JaepanC_'+sn+'.value = f.JaepanC_V_'+sn+'.value = 0'); }
            //**************제판비***********************************************************
        }

        //BY LEE 20130414 재단비추가
        if(Product==98||Product==99||Product==100)   //NCR1,NCR2,NCR3
        {
            var BQunatity = 8000;
            var TQunatity = 100;
            if(KindT.indexOf('48절')!=-1)     { BQunatity = 24000; }
            else if(KindT.indexOf('32절')!=-1){ BQunatity = 16000; }
            else if(KindT.indexOf('16절')!=-1){ BQunatity =  8000; }
            else if(KindT.indexOf('A5')!=-1)  { BQunatity =  8000; }
            else if(KindT.indexOf('3등')!=-1) { BQunatity = 12000; }
            else if(KindT.indexOf('A4')!=-1)  { BQunatity =  4000; }

            if(KindT.indexOf('2매')!=-1)      { TQunatity = 100*QuantityR; }
            else if(KindT.indexOf('3매')!=-1) { TQunatity = 150*QuantityR; }
            else if(KindT.indexOf('4매')!=-1) { TQunatity = 200*QuantityR; }

        }

        if(AfterWorkCheck==true)
        {
            if(KindT.indexOf('64절')!=-1)      { BJAmount = 32000; }
            else if(KindT.indexOf('48절')!=-1) { BJAmount = 24000; }
            else if(KindT.indexOf('32절')!=-1||KindT.indexOf('A6')!=-1) { BJAmount = 16000; }
            else if(KindT.indexOf('24절')!=-1) { BJAmount = 12000; }
            else if(KindT.indexOf('16절')!=-1||KindT.indexOf('A5')!=-1||KindT.indexOf('장32절')!=-1) { BJAmount = 8000; }
            else if(KindT.indexOf('8절')!=-1||KindT.indexOf('A4')!=-1||KindT.indexOf('장A4')!=-1)  { BJAmount = 4000; }
            else if(KindT.indexOf('4절')!=-1||KindT.indexOf('A3')!=-1)  { BJAmount = 2000; }
            else if(KindT.indexOf('2절')!=-1||KindT.indexOf('A2')!=-1)  { BJAmount = 1000; }
            else if(KindT.indexOf('46전')!=-1||KindT.indexOf('국전')!=-1){ BJAmount = 500; }
            if(Product==0||Product==1||Product==110||Product==2||Product==3||Product==4||Product==5||Product==8||Product==9||Product==10||Product==11||Product==12||Product==13||Product==14||Product==81||Product==105||Product==7||Product==120)
            {
                //var xQuantityR = QuantityR*Baesu; //별사이즈를 위함
                var xQuantityR = QuantityR;
                if(Product==0||Product==1||Product==110||Product==2||Product==3||Product==8||Product==12){ BAmount = 500; }
                else if(Product==4||Product==13){ BAmount = 500; } //300
                else if(Product==5||Product==14||Product==81||Product==105||Product==7||Product==120){ BAmount = 500; } //200
                else if(Product==9){ BAmount = 500; } //600
                else if(Product==10||Product==11){ BAmount = 500; } //400
                //**************미싱*************************************************************
                if(MisingKV!='')
                {
                    if(xQuantityR<=BAmount){ MisingValue = 6000; }
                    else if(xQuantityR<=1000){ MisingValue = 10000; }
                    else if(xQuantityR<=2000){ MisingValue = 20000; }
                    else if(xQuantityR<=5000){ MisingValue = 25000; }
                    else if(xQuantityR<=10000){ MisingValue = 30000; }
                    //else if(xQuantityR<100000){ MisingValue = xQuantityR*3; }
                    //else if(xQuantityR<200000){ MisingValue = xQuantityR*2.5; }
                    else{ MisingValue = xQuantityR*3; EstimateMSG = EstimateMSG + ', 미싱(11,000장이상)'; EstimateCount = EstimateCount + 1; }
                    if(MisingKTxt.indexOf('2줄')!=-1){ MisingValue = MisingValue*1; }
                    else if(MisingKTxt.indexOf('3줄')!=-1){ MisingValue = MisingValue*2; }
                    else if(MisingKTxt.indexOf('4줄')!=-1){ MisingValue = MisingValue*2; }
                    else if(MisingKTxt.indexOf('5줄')!=-1){ MisingValue = MisingValue*3; }
                    eval('f.MisingC_'+sn+'.value = MisingValue');
                }
                else{ eval('f.MisingC_'+sn+'.value = 0'); }
                //**************미싱*************************************************************
                //**************오시*************************************************************
                if(OsiKV!='')
                {
                    if(xQuantityR<=BAmount){ OsiValue = 6000; }
                    else if(xQuantityR<=1000){ OsiValue = 10000; }
                    else if(xQuantityR<=2000){ OsiValue = 20000; }
                    else if(xQuantityR<=5000){ OsiValue = 25000; }
                    else if(xQuantityR<=10000){ OsiValue = 30000; }
                    //else if(xQuantityR<100000){ OsiValue = xQuantityR*3; }
                    //else if(xQuantityR<200000){ OsiValue = xQuantityR*2.5; }
                    else{ OsiValue = xQuantityR*3; EstimateMSG = EstimateMSG + ', 오시(11,000장이상)'; EstimateCount = EstimateCount + 1; }
                    if(OsiKTxt.indexOf('2줄')!=-1){ OsiValue = OsiValue*1; }
                    else if(OsiKTxt.indexOf('3줄')!=-1){ OsiValue = OsiValue*2; }
                    else if(OsiKTxt.indexOf('4줄')!=-1){ OsiValue = OsiValue*2; }
                    else if(OsiKTxt.indexOf('5줄')!=-1){ OsiValue = OsiValue*3; }
                    eval('f.OsiC_'+sn+'.value = OsiValue');
                }
                else{ eval('f.OsiC_'+sn+'.value = 0'); }
                //**************오시*************************************************************
                //**************타공*************************************************************
                if(TagongKV!='')
                {
                    if(QuantityR<=BAmount){ TagongValue = 6000; }
                    else if(QuantityR<=1000){ TagongValue = 10000; }
                    else if(QuantityR<=2000){ TagongValue = 20000; }
                    else if(QuantityR<=5000){ TagongValue = 25000; }
                    else if(QuantityR<=10000){ TagongValue = 30000;  }
                    //else if(QuantityR<100000){ TagongValue = QuantityR*3; }
                    //else if(QuantityR<200000){ TagongValue = QuantityR*2.5; }
                    else{ TagongValue = QuantityR*3; EstimateMSG = EstimateMSG + ', 타공(11,000장이상)'; EstimateCount = EstimateCount + 1; }
                    if(TagongKTxt.indexOf('2구멍')!=-1){ TagongValue = TagongValue*2; }
                    else if(TagongKTxt.indexOf('3구멍')!=-1){ TagongValue = TagongValue*3; }
                    else if(TagongKTxt.indexOf('4구멍')!=-1){ TagongValue = TagongValue*4; }
                    else if(TagongKTxt.indexOf('5구멍')!=-1){ TagongValue = TagongValue*5; }
                    eval('f.TagongC_'+sn+'.value = TagongValue');
                }
                else{ eval('f.TagongC_'+sn+'.value = 0'); }
                //**************타공*************************************************************
                //**************박인쇄*************************************************************
                if(FoilKV!='')
                {
                    if(QuantityR<=300){ FoilValue = 6000; }
                    else if(QuantityR<=400){ FoilValue = 8000; }
                    else if(QuantityR<=500){ FoilValue = 9000; }
                    else if(QuantityR<=600){ FoilValue = 10000; }
                    else if(QuantityR<=800){ FoilValue = 12000; }
                    else if(QuantityR<=900){ FoilValue = 14000; }
                    else if(QuantityR<=1000){ FoilValue = 16000; }
                    else if(QuantityR<=1500){ FoilValue = 20000; }
                    else if(QuantityR<=2000){ FoilValue = 26000; }
                    else if(QuantityR<=3000){ FoilValue = 35000; }
                    else if(QuantityR<=4000){ FoilValue = 44000; }
                    else if(QuantityR<=5000){ FoilValue = 50000; }
                    else if(QuantityR<=6000){ FoilValue = 58000; }
                    else if(QuantityR<=7000){ FoilValue = 66000; }
                    else if(QuantityR<=8000){ FoilValue = 74000; }
                    else if(QuantityR<=9000){ FoilValue = 82000; }
                    else if(QuantityR<=10000){ FoilValue = 90000; }
                    else{ FoilValue = 0; EstimateMSG = EstimateMSG + ', 박(10,000장 초과)'; EstimateCount = EstimateCount + 1; }
                    if(FoilKTxt.indexOf('통박')!=-1){
                        if(QuantityR<=300){ FoilValue = 25000; }
                        else if(QuantityR<=400){ FoilValue = 30000; }
                        else if(QuantityR<=500){ FoilValue = 30000; }
                        else if(QuantityR<=600){ FoilValue = 40000; }
                        else if(QuantityR<=800){ FoilValue = 50000; }
                        else if(QuantityR<=900){ FoilValue = 50000; }
                        else if(QuantityR<=1000){ FoilValue = 50000; }
                        else if(QuantityR<=1500){ FoilValue = 70000; }
                        else if(QuantityR<=2000){ FoilValue = 90000; }
                        else if(QuantityR<=3000){ FoilValue = 130000; }
                        else if(QuantityR<=4000){ FoilValue = 170000; }
                        else if(QuantityR<=5000){ FoilValue = 206000; }
                        else if(QuantityR<=6000){ FoilValue = 242000; }
                        else if(QuantityR<=7000){ FoilValue = 278000; }
                        else if(QuantityR<=8000){ FoilValue = 314000; }
                        else if(QuantityR<=9000){ FoilValue = 350000; }
                        else if(QuantityR<=10000){ FoilValue = 380000; }
                        else{ FoilValue = 0; EstimateMSG = EstimateMSG + ', 통박(10,000장 초과)'; EstimateCount = EstimateCount + 1; }
                        if(hostname.indexOf('mspg')!=-1){
                            FoilValue = 0;
                            alert('통박 가격은 관리과로 문의 바랍니다.');
                        }
                    }
                    //by lee 말씀 금박 가격 변경
                    if(FoilKTxt.indexOf('금박')!=-1 && hostname.indexOf('mspg')!=-1){
                        if(QuantityR<=200){ FoilValue = 6000; }
                        else if(QuantityR<=5000){ FoilValue = 3000 + (QuantityR/100) * 1400; }
                        else{ FoilValue = 0;alert('금박 5000장 이상 가격은 관리과로 문의 바랍니다.'); }
                    }
                    //by lee 말씀 금박 가격 변경
                    if(FoilKTxt.indexOf('통박') == -1 && hostname.indexOf('mspg')!=-1){
                        if(Product==4){//수입지 300장
                            if(QuantityR<=300){ FoilValue = 7200; }
                        }else if(Product==5||Product==120){//수입지 200장
                            if(QuantityR<=200){ FoilValue = 6000; }
                            else if(QuantityR<=400){ FoilValue = 8600; }
                            else if(QuantityR<=600){ FoilValue = 11400; }
                            else if(QuantityR<=800){ FoilValue = 14200; }
                            else if(QuantityR<=1000){ FoilValue = 17000; }
                        }
                    }
                    if(FoilKTxt.indexOf('양면')!=-1){ FoilValue = FoilValue*2; }
                    eval('f.FoilC_'+sn+'.value = FoilValue');
                }
                else{ eval('f.FoilC_'+sn+'.value = 0'); }
                //**************박인쇄*************************************************************
                //**************형압*************************************************************
                if(HungAbKV!='')
                {
                    if(QuantityR<=300){ HungAbValue = 6000; }
                    else if(QuantityR<=400){ HungAbValue = 8000; }
                    else if(QuantityR<=500){ HungAbValue = 9000; }
                    else if(QuantityR<=600){ HungAbValue = 10000; }
                    else if(QuantityR<=800){ HungAbValue = 12000; }
                    else if(QuantityR<=900){ HungAbValue = 14000; }
                    else if(QuantityR<=1000){ HungAbValue = 16000; }
                    else if(QuantityR<=1500){ HungAbValue = 20000; }
                    else if(QuantityR<=2000){ HungAbValue = 26000; }
                    else if(QuantityR<=3000){ HungAbValue = 35000; }
                    else if(QuantityR<=4000){ HungAbValue = 44000; }
                    else if(QuantityR<=5000){ HungAbValue = 50000; }
                    else if(QuantityR<=6000){ HungAbValue = 58000; }
                    else if(QuantityR<=7000){ HungAbValue = 66000; }
                    else if(QuantityR<=8000){ HungAbValue = 74000; }
                    else if(QuantityR<=9000){ HungAbValue = 82000; }
                    else if(QuantityR<=10000){ HungAbValue = 90000; }
                    else{ HungAbValue = 0; EstimateMSG = EstimateMSG + ', 형압(10,000장 초과)'; EstimateCount = EstimateCount + 1; }
                    if(HungAbKTxt.indexOf('통형압')!=-1){
                        if(QuantityR<=300){ HungAbValue = 25000; }
                        else if(QuantityR<=400){ HungAbValue = 30000; }
                        else if(QuantityR<=500){ HungAbValue = 30000; }
                        else if(QuantityR<=600){ HungAbValue = 40000; }
                        else if(QuantityR<=800){ HungAbValue = 50000; }
                        else if(QuantityR<=900){ HungAbValue = 50000; }
                        else if(QuantityR<=1000){ HungAbValue = 50000; }
                        else if(QuantityR<=1500){ HungAbValue = 70000; }
                        else if(QuantityR<=2000){ HungAbValue = 90000; }
                        else if(QuantityR<=3000){ HungAbValue = 130000; }
                        else if(QuantityR<=4000){ HungAbValue = 170000; }
                        else if(QuantityR<=5000){ HungAbValue = 206000; }
                        else if(QuantityR<=6000){ HungAbValue = 242000; }
                        else if(QuantityR<=7000){ HungAbValue = 278000; }
                        else if(QuantityR<=8000){ HungAbValue = 314000; }
                        else if(QuantityR<=9000){ HungAbValue = 350000; }
                        else if(QuantityR<=10000){ HungAbValue = 380000; }
                        else{ HungAbValue = 0; EstimateMSG = EstimateMSG + ', 통형압(10,000장 초과)'; EstimateCount = EstimateCount + 1; }
                    }
                    HungAbValue = HungAbValue + 3000;
                    eval('f.HungAbC_'+sn+'.value = HungAbValue');
                }
                else{ eval('f.HungAbC_'+sn+'.value = 0'); }
                //**************형압*************************************************************
                //**************도무송(명함귀돌이)***********************************************
                if(DomusongKV!='')
                {
                    if(QuantityR<=BAmount){
                        if(Product==0||Product==1||Product==110||Product==2){
                            DomusongValue = 6000;
                        }else{
                            if(QuantityR >= 400 && (Product==5||Product==7 || Product==105||Product==120)){
                                DomusongValue = 6000;
                            }else{
                                DomusongValue = 3000;
                            }
                        }
                    }
                    else if(QuantityR<=1000){ DomusongValue = 10000; }
                    else if(QuantityR<=2000){ DomusongValue = 20000; }
                    else if(QuantityR<=5000){ DomusongValue = 25000; }
                    else if(QuantityR<=10000){ DomusongValue = 30000;  }
                    //else if(QuantityR<=20000){ DomusongValue = 40000;  }
                    else{ DomusongValue = QuantityR*15; EstimateMSG = EstimateMSG + ', 명함귀돌이(11,000장이상)'; EstimateCount = EstimateCount + 1; }
                    eval('f.DomusongC_'+sn+'.value = DomusongValue');
                }
                else{ eval('f.DomusongC_'+sn+'.value = 0'); }
                //**************도무송(명함귀돌이)***********************************************
            }else if(Product==33||Product==35||Product==36||Product==38||Product==39||Product==40||Product==41||Product==93){
                //**************박인쇄*************************************************************
                if(FoilKV!='')
                {
                    EstimateMSG = EstimateMSG + ', 박인쇄'; EstimateCount = EstimateCount + 1;
                    eval('f.FoilC_'+sn+'.value = 0');
                }
                else{ eval('f.FoilC_'+sn+'.value = 0'); }
                //**************박인쇄*************************************************************
                //**************형압*************************************************************
                if(HungAbKV!='')
                {
                    EstimateMSG = EstimateMSG + ', 형압'; EstimateCount = EstimateCount + 1;
                    eval('f.HungAbC_'+sn+'.value = 0');
                }
                else{ eval('f.HungAbC_'+sn+'.value = 0'); }
                //**************형압*************************************************************
                //**************별색*************************************************************
                if(SpecialColorKV!='')
                {
                    EstimateMSG = EstimateMSG + ', 별색'; EstimateCount = EstimateCount + 1;
                    eval('f.SpecialColorC_'+sn+'.value = 0');
                }
                else{ eval('f.SpecialColorC_'+sn+'.value = 0'); }
                //**************별색*************************************************************
                //**************미싱*************************************************************
                if(MisingKV!='')
                {
                    if(PaperT.substring(0,2)=='70')
                    { alert('80g 이상만 미싱이 가능합니다!');
                        eval('f.MisingK_'+sn+'.selectedIndex = 0'); Cost(sn);
                    }
                    else
                    {
                        if(Product==33||Product==35||Product==36||Product==93)  //100아트,80모조,150아트합판전단지,80코트지합판전단지
                        {
                            if(KindT.indexOf('16절')!=-1||KindT.indexOf('A5')!=-1){ MisingValue = 30000; }
                            else if(KindT.indexOf('32절')!=-1||KindT.indexOf('A6')!=-1){ MisingValue = 40000; }
                            else if(KindT.indexOf('64절')!=-1){ MisingValue = 40000; }
                            else { MisingValue = 20000; }
                            if(KindT.indexOf('4줄')!=-1){ MisingValue = MisingValue + 10000; }
                            else if(KindT.indexOf('5줄')!=-1){ MisingValue = MisingValue + 20000; }
                            eval('f.MisingC_'+sn+'.value = MisingValue*xQuantityR - 5000*(xQuantityR-1)');
                        }
                        else //독판전단지,독판문어발,독판문고리,단색독판
                        {
                            if(KindT.indexOf('16절')!=-1||KindT.indexOf('A5')!=-1){ MisingValue = 20000; }
                            else if(KindT.indexOf('32절')!=-1||KindT.indexOf('A6')!=-1){ MisingValue = 40000; }
                            else if(KindT.indexOf('64절')!=-1){ MisingValue = 40000; }
                            else { MisingValue = 20000; }
                            if(KindT.indexOf('4줄')!=-1){ MisingValue = MisingValue + 10000; }
                            else if(KindT.indexOf('5줄')!=-1){ MisingValue = MisingValue + 20000; }
                            eval('f.MisingC_'+sn+'.value = MisingValue*xQuantityR - 5000*(xQuantityR-1)');
                        }
                    }
                }
                else{ eval('f.MisingC_'+sn+'.value = 0'); }
                //**************미싱*************************************************************
                //**************타공*************************************************************
                if(TagongKV!='')
                {
                    if(TagongKTxt=='1구멍')     { BTagongValue = 2; }
                    else if(TagongKTxt=='2구멍'){ BTagongValue = 4; }
                    else if(TagongKTxt=='3구멍'){ BTagongValue = 6; }
                    else if(TagongKTxt=='4구멍'){ BTagongValue = 8; }
                    else if(TagongKTxt=='5구멍'){ BTagongValue = 10; }
                    TagongValue = BTagongValue*BJAmount;
                    if(TagongValue<20000){ TagongValue = 20000; }
                    TagongValue = TagongValue + 20000*(xQuantityR-1);
                    eval('f.TagongC_'+sn+'.value = TagongValue');
                }
                else{ eval('f.TagongC_'+sn+'.value = 0'); }
                //**************타공*************************************************************
                //**************재단*************************************************************
                if(JaeDanKV!='')
                {
                    if(JaeDanKTxt=='2등분재단')     { BJaeDanValue = 5000; }
                    else if(JaeDanKTxt=='3등분재단'){ BJaeDanValue = 5000; }
                    else if(JaeDanKTxt=='4등분재단'){ BJaeDanValue = 5000; }
                    else if(JaeDanKTxt=='5등분재단'){ BJaeDanValue = 5000; }
                    else if(JaeDanKTxt=='6등분재단'){ BJaeDanValue = 5000; }
                    else if(JaeDanKTxt=='라벨재단') { BJaeDanValue = 8000; }
                    if((Product==33||Product==35||Product==36||Product==93||Product==38||Product==39||Product==40||Product==41||Product==42||Product==47)&&(KindT.substring(0,3)=='16절'||KindT.substring(0,2)=='A4')&&(JaeDanKTxt=='2등분재단')){ BJaeDanValue = 0; }
                    if((Product==33||Product==35||Product==36||Product==93||Product==38||Product==39||Product==40||Product==41||Product==42||Product==47)&&(KindT.substring(0,2)=='8절'||KindT.substring(0,2)=='A3')&&(JaeDanKTxt=='2등분재단'||JaeDanKTxt=='3등분재단'||JaeDanKTxt=='4등분재단')){ BJaeDanValue = 0; }
                    if((Product==33||Product==35||Product==36||Product==93||Product==38||Product==39||Product==40||Product==41||Product==42||Product==47)&&(KindT.substring(0,2)=='4절'||KindT.substring(0,2)=='A2')&&(JaeDanKTxt=='2등분재단'||JaeDanKTxt=='3등분재단'||JaeDanKTxt=='4등분재단'||JaeDanKTxt=='5등분재단'||JaeDanKTxt=='6등분재단')){ BJaeDanValue = 0; }
                    if( Product==33 || Product==35 || Product==36 || Product==38 || Product==41 ){
                        BJaeDanValue = 5000;
                        if(JaeDanKTxt=='2등분재단')     { BJaeDanValue = BJaeDanValue; }
                        else if(JaeDanKTxt=='3등분재단'){ BJaeDanValue = BJaeDanValue; }
                        else if(JaeDanKTxt=='4등분재단'){ BJaeDanValue = BJaeDanValue; }
                        else if(JaeDanKTxt=='5등분재단'){ BJaeDanValue = BJaeDanValue; }
                        else if(JaeDanKTxt=='6등분재단'){ BJaeDanValue = BJaeDanValue; }
                        else if(JaeDanKTxt=='7등분재단'){ BJaeDanValue = BJaeDanValue; }
                        else if(JaeDanKTxt=='8등분재단'){ BJaeDanValue = BJaeDanValue; }
                        else if(JaeDanKTxt=='9등분재단'){ BJaeDanValue = BJaeDanValue; }
                        else if(JaeDanKTxt=='10등분재단'){ BJaeDanValue = BJaeDanValue; }
                        else if(JaeDanKTxt=='12등분재단'){ BJaeDanValue = BJaeDanValue; }
                        else if(JaeDanKTxt=='14등분재단'){ BJaeDanValue = BJaeDanValue; }
                        else if(JaeDanKTxt=='15등분재단'){ BJaeDanValue = BJaeDanValue; }
                        else if(JaeDanKTxt=='16등분재단'){ BJaeDanValue = BJaeDanValue; }
                        else if(JaeDanKTxt=='18등분재단'){ BJaeDanValue = BJaeDanValue; }
                        else if(JaeDanKTxt=='20등분재단'){ BJaeDanValue = BJaeDanValue; }
                        if( (KindT.substring(0,2)=='A6'||KindT.substring(0,3)=='64절') && (JaeDanKTxt!='2등분재단' && JaeDanKTxt!='3등분재단') ){
                            alert('선택하실 수 없습니다(1)!');
                            eval('f.JaeDanK_'+sn+'.selectedIndex = 0'); BJaeDanValue = 0;JaeDanKTxt=''; Cost(sn);
                        }
                        if( (KindT.substring(0,2)=='A5'||KindT.substring(0,3)=='32절') && (JaeDanKTxt!='2등분재단') && (JaeDanKTxt!='3등분재단') && (JaeDanKTxt!='4등분재단') && (JaeDanKTxt!='5등분재단') && (JaeDanKTxt!='6등분재단') ){
                            alert('선택하실 수 없습니다(2)!');
                            eval('f.JaeDanK_'+sn+'.selectedIndex = 0'); BJaeDanValue = 0;JaeDanKTxt=''; Cost(sn);
                        }
                        if( (KindT.substring(0,2)=='A4'||KindT.substring(0,3)=='16절') && (JaeDanKTxt!='2등분재단') && (JaeDanKTxt!='3등분재단') && (JaeDanKTxt!='4등분재단') && (JaeDanKTxt!='5등분재단') && (JaeDanKTxt!='6등분재단') && (JaeDanKTxt!='7등분재단') && (JaeDanKTxt!='8등분재단') && (JaeDanKTxt!='9등분재단') && (JaeDanKTxt!='10등분재단') && (JaeDanKTxt!='12등분재단') ){
                            alert('선택하실 수 없습니다(3)!');
                            eval('f.JaeDanK_'+sn+'.selectedIndex = 0'); BJaeDanValue = 0;JaeDanKTxt=''; Cost(sn);
                        }
                        if( (KindT.substring(0,2)=='A4' || KindT.substring(0,2)=='A3' || KindT.substring(0,2)=='A2' || KindT.substring(0,3)=='16절' || KindT.substring(0,2)=='8절' || KindT.substring(0,2)=='4절') && (JaeDanKTxt=='2등분재단') ){
                            BJaeDanValue = 0;
                        }
                        if( (KindT.substring(0,2)=='A3' || KindT.substring(0,2)=='A2' || KindT.substring(0,2)=='8절' || KindT.substring(0,2)=='4절') && (JaeDanKTxt=='3등분재단' || JaeDanKTxt=='4등분재단' || JaeDanKTxt=='5등분재단') ){
                            BJaeDanValue = 0;
                        }
                        if( (KindT.substring(0,2)=='A2' || KindT.substring(0,2)=='4절') && (JaeDanKTxt=='6등분재단' || JaeDanKTxt=='7등분재단' || JaeDanKTxt=='8등분재단' || JaeDanKTxt=='9등분재단' || JaeDanKTxt=='10등분재단') ){
                            BJaeDanValue = 0;
                        }
                        if( (KindT.substring(0,2)=='A6' || KindT.substring(0,3)=='64절') && (JaeDanKTxt=='2등분재단') ){
                            BJaeDanValue = 3000;
                        }
                        if( (KindT.substring(0,2)=='A6' || KindT.substring(0,3)=='64절') && (JaeDanKTxt=='3등분재단') ){
                            BJaeDanValue = 3000;
                        }
                        if( (KindT.substring(0,2)=='A5' || KindT.substring(0,3)=='32절') && (JaeDanKTxt=='4등분재단') ){
                            BJaeDanValue = 8000;
                        }
                        if( (KindT.substring(0,2)=='A5' || KindT.substring(0,3)=='32절') && (JaeDanKTxt=='5등분재단' || JaeDanKTxt=='6등분재단') ){
                            BJaeDanValue = 8000;
                            if( Product!=33 ){
                                BJaeDanValue = BJaeDanValue + 4000
                            }
                        }
                        if( (KindT.substring(0,2)=='A4' || KindT.substring(0,3)=='16절') && (JaeDanKTxt=='8등분재단' || JaeDanKTxt=='9등분재단') ){
                            BJaeDanValue = 8000;
                        }
                        if( (KindT.substring(0,2)=='A4' || KindT.substring(0,3)=='16절') && (JaeDanKTxt=='10등분재단' || JaeDanKTxt=='12등분재단') ){
                            BJaeDanValue = 8000;
                            if( Product!=33 ){
                                BJaeDanValue = BJaeDanValue + 4000
                            }
                        }
                        if( (KindT.substring(0,2)=='A3' || KindT.substring(0,2)=='8절') && (JaeDanKTxt=='16등분재단' || JaeDanKTxt=='18등분재단') ){
                            BJaeDanValue = 8000;
                        }
                        if( (KindT.substring(0,2)=='A3' || KindT.substring(0,2)=='8절') && (JaeDanKTxt=='20등분재단') ){
                            BJaeDanValue = 8000;
                            if( Product!=33 ){
                                BJaeDanValue = BJaeDanValue + 4000
                            }
                        }
                        if( (KindT.substring(0,2)=='A1' || KindT.substring(0,2)=='2절' || KindT.substring(0,2)=='국전') ){
                            BJaeDanValue = 0;
                        }
                    }
                    JaeDanValue = xQuantityR*BJaeDanValue;
                    eval('f.JaeDanC_'+sn+'.value = JaeDanValue');
                }
                else{ eval('f.JaeDanC_'+sn+'.value = 0'); }
                //**************재단*************************************************************
                //**************코팅(100아트합판전단지,독판전단지,80코트합판전단지)**************
                if(CottingKV!='')
                {
                    if((CottingKTxt=='라미넥스코팅' && Product!=33 && Product!=93)) {
                        alert('라미넥스 코팅은 별도 견적문의 부탁드립니다!');
                        eval('f.CottingK_'+sn+'.selectedIndex = 0'); CottingKTxt=''; Cost(sn);
                    }
                    if((Product==33||Product==93)&&CottingKTxt!='라미넥스코팅')
                    {  alert('라미넥스코팅만 가능합니다!');
                        eval('f.CottingK_'+sn+'.selectedIndex = 0'); CottingKTxt='';Cost(sn);
                    }
                    if((PaperT.substring(0,2)=='70'||PaperT.substring(0,2)=='80')&&CottingKTxt=='라미넥스코팅')
                    { alert('100g 이상만 코팅이 가능합니다!');
                        eval('f.CottingK_'+sn+'.selectedIndex = 0'); CottingKTxt=''; Cost(sn);
                    }
                    if((PaperT.substring(0,2)=='70'||PaperT.substring(0,2)=='80'||PaperT.substring(0,3)=='100'||PaperT.substring(0,3)=='120')&&CottingKTxt!='라미넥스코팅')
                    { alert('150g 이상만 코팅이 가능합니다!');
                        eval('f.CottingK_'+sn+'.selectedIndex = 0'); CottingKTxt=''; Cost(sn);
                    }
                    if(PaperT.substring(0,3)=='150'&&CottingKTxt.indexOf('양면')!=-1)
                    { alert('150g은 단면코팅만 가능합니다!');
                        eval('f.CottingK_'+sn+'.selectedIndex = 0'); CottingKTxt=''; Cost(sn);
                    }
                    if(CottingKTxt=='무광단면코팅'||CottingKTxt=='무광양면코팅')
                    {
                        if(KindT.indexOf('절')!=-1||KindT.indexOf('46전지')!=-1){ BCottingKValue = 60000; }
                        else{ BCottingKValue = 50000; }
                        if( Product==38 || Product==41 ){
                            if(QuantityR=='0.5'){
                                if(CottingKTxt=='무광양면코팅'){
                                }else{
                                    BCottingKValue = BCottingKValue - 10000;
                                }
                            }else{
                                if(CottingKTxt=='무광양면코팅'){ BCottingKValue = BCottingKValue*2; }
                            }
                        }else{
                            if(CottingKTxt=='무광양면코팅'){ BCottingKValue = BCottingKValue*2; }
                        }
                        CottingValue = xQuantityR*BCottingKValue;
                    }
                    else if(CottingKTxt=='유광단면코팅'||CottingKTxt=='유광양면코팅')
                    {
                        if(KindT.indexOf('절')!=-1||KindT.indexOf('46전지')!=-1){ BCottingKValue = 50000; }
                        else{ BCottingKValue = 40000; }
                        if( Product==38 || Product==41 ){
                            if(QuantityR=='0.5'){
                                if(CottingKTxt=='유광양면코팅'){
                                }else{
                                    BCottingKValue = BCottingKValue - 10000;
                                }
                            }else{
                                if(CottingKTxt=='유광양면코팅' && QuantityR !='0.5'){ BCottingKValue = BCottingKValue*2; }
                            }
                        }else{
                            if(CottingKTxt=='유광양면코팅' && QuantityR !='0.5'){ BCottingKValue = BCottingKValue*2; }
                        }
                        CottingValue = xQuantityR*BCottingKValue;
                    }
                    else if(CottingKTxt=='UV단면코팅'||CottingKTxt=='UV양면코팅')
                    {
                        if(KindT.substring(0,2)=='2절'||KindT.substring(0,2)=='46'||KindT.substring(0,2)=='A2'||KindT.substring(0,2)=='국전'){ BCottingKValue = 30000; }
                        else { BCottingKValue = 60000; }
                        if(CottingKTxt=='UV양면코팅'){ BCottingKValue = BCottingKValue*2; }
                        CottingValue = xQuantityR*BCottingKValue;
                        EstimateMSG = EstimateMSG + ', UV코팅'; EstimateCount = EstimateCount + 1;
                    }
                    else if(CottingKTxt=='라미넥스코팅')
                    {
                        if(Product==33||Product==93)
                        {
                            eval('f.CottingK_'+sn+'.selectedIndex = 0'); CottingValue=0;CottingKTxt='';Cost(sn); EstimateMSG = EstimateMSG + ', 라미넥스코팅'; EstimateCount = EstimateCount + 1;
                        }
                        var PSum = 0;
                        if(KindT.indexOf('64절')!=-1){
                            PSum = QuantityR * 32000;
                            if(PSum < 21){
                                BCottingKValue = 450;
                            }else if(PSum < 101){
                                BCottingKValue = 380;
                            }else if(PSum < 201){
                                BCottingKValue = 270;
                            }else if(PSum < 501){
                                BCottingKValue = 220;
                            }else if(PSum < 900){
                                BCottingKValue = 170;
                            }else if(PSum < 4000){
                                BCottingKValue = 130;
                            }else if(PSum < 10000){
                                BCottingKValue = 120;
                            }else if(PSum < 20000){
                                BCottingKValue = 110;
                            }else{
                                BCottingKValue = 100;
                            }
                        }else if(KindT.indexOf('32절')!=-1){
                            PSum = QuantityR * 16000;
                            if(PSum < 21){
                                BCottingKValue = 450;
                            }else if(PSum < 101){
                                BCottingKValue = 380;
                            }else if(PSum < 201){
                                BCottingKValue = 270;
                            }else if(PSum < 501){
                                BCottingKValue = 220;
                            }else if(PSum < 900){
                                BCottingKValue = 170;
                            }else if(PSum < 4000){
                                BCottingKValue = 130;
                            }else if(PSum < 10000){
                                BCottingKValue = 120;
                            }else if(PSum < 20000){
                                BCottingKValue = 110;
                            }else{
                                BCottingKValue = 100;
                            }
                        }else if(KindT.indexOf('16절')!=-1){
                            PSum = QuantityR * 8000;
                            if(PSum < 21){
                                BCottingKValue = 450;
                            }else if(PSum < 101){
                                BCottingKValue = 380;
                            }else if(PSum < 201){
                                BCottingKValue = 270;
                            }else if(PSum < 501){
                                BCottingKValue = 220;
                            }else if(PSum < 900){
                                BCottingKValue = 170;
                            }else if(PSum < 4000){
                                BCottingKValue = 140;
                            }else if(PSum < 10000){
                                BCottingKValue = 130;
                            }else if(PSum < 20000){
                                BCottingKValue = 120;
                            }else{
                                BCottingKValue = 110;
                            }
                        }else if(KindT.indexOf('8절')!=-1){
                            PSum = QuantityR * 4000;
                            if(PSum < 21){
                                BCottingKValue = 600;
                            }else if(PSum < 101){
                                BCottingKValue = 520;
                            }else if(PSum < 201){
                                BCottingKValue = 400;
                            }else if(PSum < 501){
                                BCottingKValue = 360;
                            }else if(PSum < 900){
                                BCottingKValue = 320;
                            }else if(PSum < 4000){
                                BCottingKValue = 280;
                            }else if(PSum < 10000){
                                BCottingKValue = 260;
                            }else if(PSum < 20000){
                                BCottingKValue = 250;
                            }else{
                                BCottingKValue = 240;
                            }
                        }else if(KindT.indexOf('4절')!=-1){
                            PSum = QuantityR * 2000;
                            if(PSum < 21){
                                BCottingKValue = 1200;
                            }else if(PSum < 101){
                                BCottingKValue = 1040;
                            }else if(PSum < 201){
                                BCottingKValue = 800;
                            }else if(PSum < 501){
                                BCottingKValue = 600;
                            }else if(PSum < 900){
                                BCottingKValue = 540;
                            }else if(PSum < 4000){
                                BCottingKValue = 490;
                            }else if(PSum < 10000){
                                BCottingKValue = 440;
                            }else if(PSum < 20000){
                                BCottingKValue = 420;
                            }else{
                                BCottingKValue = 410;
                            }
                        }else if(KindT.indexOf('2절')!=-1){
                            PSum = QuantityR * 1000;
                            if(PSum < 21){
                                BCottingKValue = 2150;
                            }else if(PSum < 101){
                                BCottingKValue = 1800;
                            }else if(PSum < 201){
                                BCottingKValue = 1200;
                            }else if(PSum < 501){
                                BCottingKValue = 1100;
                            }else if(PSum < 900){
                                BCottingKValue = 950;
                            }else if(PSum < 4000){
                                BCottingKValue = 900;
                            }else if(PSum < 10000){
                                BCottingKValue = 850;
                            }else if(PSum < 20000){
                                BCottingKValue = 820;
                            }else{
                                BCottingKValue = 790;
                            }
                        }else if(KindT.indexOf('46')!=-1){
                            PSum = QuantityR * 500;
                            if(PSum < 21){
                                BCottingKValue = 4500;
                            }else if(PSum < 101){
                                BCottingKValue = 3000;
                            }else if(PSum < 201){
                                BCottingKValue = 2700;
                            }else if(PSum < 501){
                                BCottingKValue = 1800;
                            }else if(PSum < 900){
                                BCottingKValue = 1400;
                            }else if(PSum < 4000){
                                BCottingKValue = 1200;
                            }else if(PSum < 10000){
                                BCottingKValue = 1100;
                            }else if(PSum < 20000){
                                BCottingKValue = 1000;
                            }else{
                                BCottingKValue = 950;
                            }
                        }else if(KindT.indexOf('A6')!=-1){
                            PSum = QuantityR * 16000;
                            if(PSum < 21){
                                BCottingKValue = 450;
                            }else if(PSum < 101){
                                BCottingKValue = 380;
                            }else if(PSum < 201){
                                BCottingKValue = 270;
                            }else if(PSum < 501){
                                BCottingKValue = 220;
                            }else if(PSum < 900){
                                BCottingKValue = 170;
                            }else if(PSum < 4000){
                                BCottingKValue = 130;
                            }else if(PSum < 10000){
                                BCottingKValue = 120;
                            }else if(PSum < 20000){
                                BCottingKValue = 110;
                            }else{
                                BCottingKValue = 100;
                            }
                        }else if(KindT.indexOf('A5')!=-1){
                            PSum = QuantityR * 8000;
                            if(PSum < 21){
                                BCottingKValue = 450;
                            }else if(PSum < 101){
                                BCottingKValue = 380;
                            }else if(PSum < 201){
                                BCottingKValue = 270;
                            }else if(PSum < 501){
                                BCottingKValue = 220;
                            }else if(PSum < 900){
                                BCottingKValue = 170;
                            }else if(PSum < 4000){
                                BCottingKValue = 130;
                            }else if(PSum < 10000){
                                BCottingKValue = 120;
                            }else if(PSum < 20000){
                                BCottingKValue = 110;
                            }else{
                                BCottingKValue = 100;
                            }
                        }else if(KindT.indexOf('A4')!=-1){
                            PSum = QuantityR * 4000;
                            if(PSum < 21){
                                BCottingKValue = 600;
                            }else if(PSum < 101){
                                BCottingKValue = 450;
                            }else if(PSum < 201){
                                BCottingKValue = 300;
                            }else if(PSum < 501){
                                BCottingKValue = 240;
                            }else if(PSum < 900){
                                BCottingKValue = 180;
                            }else if(PSum < 4000){
                                BCottingKValue = 150;
                            }else if(PSum < 10000){
                                BCottingKValue = 140;
                            }else if(PSum < 20000){
                                BCottingKValue = 130;
                            }else{
                                BCottingKValue = 120;
                            }
                        }else if(KindT.indexOf('A3')!=-1){
                            PSum = QuantityR * 2000;
                            if(PSum < 21){
                                BCottingKValue = 900;
                            }else if(PSum < 101){
                                BCottingKValue = 750;
                            }else if(PSum < 201){
                                BCottingKValue = 520;
                            }else if(PSum < 501){
                                BCottingKValue = 450;
                            }else if(PSum < 900){
                                BCottingKValue = 350;
                            }else if(PSum < 4000){
                                BCottingKValue = 300;
                            }else if(PSum < 10000){
                                BCottingKValue = 270;
                            }else if(PSum < 20000){
                                BCottingKValue = 260;
                            }else{
                                BCottingKValue = 250;
                            }
                        }else if(KindT.indexOf('A2')!=-1){
                            PSum = QuantityR * 1000;
                            if(PSum < 21){
                                BCottingKValue = 1800;
                            }else if(PSum < 101){
                                BCottingKValue = 1340;
                            }else if(PSum < 201){
                                BCottingKValue = 1000;
                            }else if(PSum < 501){
                                BCottingKValue = 840;
                            }else if(PSum < 900){
                                BCottingKValue = 670;
                            }else if(PSum < 4000){
                                BCottingKValue = 550;
                            }else if(PSum < 10000){
                                BCottingKValue = 500;
                            }else if(PSum < 20000){
                                BCottingKValue = 480;
                            }else{
                                BCottingKValue = 460;
                            }
                        }else if(KindT.indexOf('국전')!=-1){
                            PSum = QuantityR * 500;
                            if(PSum < 21){
                                BCottingKValue = 4500;
                            }else if(PSum < 101){
                                BCottingKValue = 3000;
                            }else if(PSum < 201){
                                BCottingKValue = 2700;
                            }else if(PSum < 501){
                                BCottingKValue = 1800;
                            }else if(PSum < 900){
                                BCottingKValue = 1400;
                            }else if(PSum < 4000){
                                BCottingKValue = 1200;
                            }else if(PSum < 10000){
                                BCottingKValue = 1100;
                            }else if(PSum < 20000){
                                BCottingKValue = 1000;
                            }else{
                                BCottingKValue = 950;
                            }
                        }
                        CottingValue = BCottingKValue * PSum;
                        //CottingValue = BCottingKValue*BJAmount*xQuantityR;
                    }
                    eval('f.CottingC_'+sn+'.value = CottingValue');
                    if(Product==38||Product==39||Product==40||Product==41)
                    {
                        if((KindT.indexOf('16절')!=-1||KindT.indexOf('32절')!=-1||KindT.indexOf('16절')!=-1||KindT.indexOf('8절')!=-1)&&KindT.indexOf('양면')!=-1&&CottingKTxt.indexOf('단면')!=-1){ eval('f.JaepanC_'+sn+'.value = f.JaepanC_V_'+sn+'.value = parseInt(f.JaepanC_'+sn+'.value) + 27000'); eval('f.JaepanK_'+sn+'.selectedIndex = OptionSI(sn,"JaepanK",121)'); }
                        //else if((KindT.indexOf('A6')!=-1||KindT.indexOf('A5')!=-1||KindT.indexOf('A4')!=-1||KindT.indexOf('A3')!=-1)&&KindT.indexOf('양면')!=-1&&CottingKTxt.indexOf('단면')!=-1){ eval('f.JaepanC_'+sn+'.value = f.JaepanC_V_'+sn+'.value = parseInt(f.JaepanC_'+sn+'.value) + 50000'); eval('f.JaepanK_'+sn+'.selectedIndex = OptionSI(sn,"JaepanK",117)'); }
                    }
                }
                else{ eval('f.CottingC_'+sn+'.value = 0'); }
                //**************코팅(100아트합판전단지,독판전단지,80코트합판전단지)**************
                //**************오시*************************************************************
                if(OsiKV!='')
                {
                    if(Product==33||Product==35||Product==36||Product==93)  //100아트,80모조,150아트합판전단지,80코트합판전단지
                    {
                        if(KindT.indexOf('16절')!=-1||KindT.indexOf('A5')!=-1){ OsiValue = 30000; }
                        else if(KindT.indexOf('32절')!=-1||KindT.indexOf('A6')!=-1){ OsiValue = 40000; }
                        else if(KindT.indexOf('64절')!=-1){ OsiValue = 50000; }
                        else { OsiValue = 20000; }
                        if(KindT.indexOf('4줄')!=-1){ OsiValue = OsiValue + 10000; }
                        else if(KindT.indexOf('5줄')!=-1){ OsiValue = OsiValue + 20000; }
                        if(CottingKV!=''&&CottingKTxt.indexOf('양면')!=-1){ OsiValue = OsiValue+10000; }
                        eval('f.OsiC_'+sn+'.value = OsiValue*xQuantityR - 5000*(xQuantityR-1)');
                    }
                    else //독판전단지,독판문어발,독판문고리,단색독판
                    {
                        if(KindT.indexOf('16절')!=-1||KindT.indexOf('A5')!=-1){ OsiValue = 20000; }
                        else if(KindT.indexOf('32절')!=-1||KindT.indexOf('A6')!=-1){ OsiValue = 40000; }
                        else if(KindT.indexOf('64절')!=-1){ OsiValue = 50000; }
                        else { OsiValue = 20000; }
                        if(KindT.indexOf('4줄')!=-1){ OsiValue = OsiValue + 10000; }
                        else if(KindT.indexOf('5줄')!=-1){ OsiValue = OsiValue + 20000; }
                        if(CottingKV!=''&&CottingKTxt.indexOf('양면')!=-1){ OsiValue = OsiValue+10000; }
                        eval('f.OsiC_'+sn+'.value = OsiValue*xQuantityR - 5000*(xQuantityR-1)');
                    }
                }
                else{ eval('f.OsiC_'+sn+'.value = 0'); }
                //**************오시*************************************************************
                //**************접지*************************************************************
                if(JubgyKV!='')
                {
                    if(JubgyKTxt=='2단접지' || JubgyKTxt=='3단접지' || JubgyKTxt=='3단병풍'){
                        if(KindT.indexOf('16절')!=-1 || KindT.indexOf('A5')!=-1){
                            if(xQuantityR	< 2){						BJubgyKValue = 28000; }
                            else if(xQuantityR < 3){			BJubgyKValue = 25000; }
                            else if(xQuantityR < 4){			BJubgyKValue = 23000; }
                            else if(xQuantityR < 5){			BJubgyKValue = 22000; }
                            else if(xQuantityR < 6){			BJubgyKValue = 21000; }
                            else if(xQuantityR < 7){			BJubgyKValue = 21000; }
                            else if(xQuantityR < 8){			BJubgyKValue = 20000; }
                            else if(xQuantityR < 9){			BJubgyKValue = 20000; }
                            else if(xQuantityR < 10){			BJubgyKValue = 20000; }
                            else if(xQuantityR < 11){			BJubgyKValue = 19000; }
                            else if(xQuantityR < 13){			BJubgyKValue = 19000; }
                            else if(xQuantityR < 15){			BJubgyKValue = 19000; }
                            else if(xQuantityR < 17){			BJubgyKValue = 18000; }
                            else if(xQuantityR < 19){			BJubgyKValue = 18000; }
                            else if(xQuantityR < 21){			BJubgyKValue = 18000; }
                            else if(xQuantityR < 23){			BJubgyKValue = 17000; }
                            else if(xQuantityR < 30){			BJubgyKValue = 17000; }
                            else if(xQuantityR < 35){			BJubgyKValue = 17000; }
                            else if(xQuantityR < 40){			BJubgyKValue = 17000; }
                            else{													BJubgyKValue = 16000; }
                        }else if(KindT.indexOf('32절')!=-1 && KindT.indexOf('장32절')==-1 && JubgyKTxt=='2단접지'){
                            if(xQuantityR	< 2){						BJubgyKValue = 56000; }
                            else if(xQuantityR < 3){			BJubgyKValue = 50000; }
                            else if(xQuantityR < 4){			BJubgyKValue = 46000; }
                            else if(xQuantityR < 5){			BJubgyKValue = 44000; }
                            else if(xQuantityR < 6){			BJubgyKValue = 42000; }
                            else if(xQuantityR < 7){			BJubgyKValue = 42000; }
                            else if(xQuantityR < 8){			BJubgyKValue = 40000; }
                            else if(xQuantityR < 9){			BJubgyKValue = 40000; }
                            else if(xQuantityR < 10){			BJubgyKValue = 40000; }
                            else if(xQuantityR < 11){			BJubgyKValue = 38000; }
                            else if(xQuantityR < 13){			BJubgyKValue = 38000; }
                            else if(xQuantityR < 15){			BJubgyKValue = 38000; }
                            else if(xQuantityR < 17){			BJubgyKValue = 36000; }
                            else if(xQuantityR < 19){			BJubgyKValue = 36000; }
                            else if(xQuantityR < 21){			BJubgyKValue = 36000; }
                            else if(xQuantityR < 23){			BJubgyKValue = 34000; }
                            else if(xQuantityR < 30){			BJubgyKValue = 34000; }
                            else if(xQuantityR < 35){			BJubgyKValue = 34000; }
                            else if(xQuantityR < 40){			BJubgyKValue = 34000; }
                            else{													BJubgyKValue = 32000; }
                        }else if((KindT.indexOf('2절')!=-1 && KindT.indexOf('32절')==-1) || KindT.indexOf('4절')!=-1 || KindT.indexOf('8절')!=-1 || KindT.indexOf('A2')!=-1 || KindT.indexOf('A3')!=-1 || KindT.indexOf('국3절')!=-1 || KindT.indexOf('A4')!=-1){
                            if(xQuantityR	< 2){						BJubgyKValue = 22000; }
                            else if(xQuantityR < 3){			BJubgyKValue = 20000; }
                            else if(xQuantityR < 4){			BJubgyKValue = 18000; }
                            else if(xQuantityR < 5){			BJubgyKValue = 17000; }
                            else if(xQuantityR < 6){			BJubgyKValue = 16000; }
                            else if(xQuantityR < 7){			BJubgyKValue = 16000; }
                            else if(xQuantityR < 8){			BJubgyKValue = 15000; }
                            else if(xQuantityR < 9){			BJubgyKValue = 15000; }
                            else if(xQuantityR < 10){			BJubgyKValue = 15000; }
                            else if(xQuantityR < 11){			BJubgyKValue = 14000; }
                            else if(xQuantityR < 13){			BJubgyKValue = 14000; }
                            else if(xQuantityR < 15){			BJubgyKValue = 14000; }
                            else if(xQuantityR < 17){			BJubgyKValue = 13000; }
                            else if(xQuantityR < 19){			BJubgyKValue = 13000; }
                            else if(xQuantityR < 21){			BJubgyKValue = 13000; }
                            else if(xQuantityR < 23){			BJubgyKValue = 12000; }
                            else if(xQuantityR < 30){			BJubgyKValue = 12000; }
                            else if(xQuantityR < 35){			BJubgyKValue = 11000; }
                            else if(xQuantityR < 40){			BJubgyKValue = 11000; }
                            else{													BJubgyKValue = 10000; }
                        }else{	BJubgyKValue = 0; EstimateMSG = EstimateMSG + ', 접지'; EstimateCount = EstimateCount + 1;	}
                    }else if(JubgyKTxt=='대문접지' || JubgyKTxt=='병풍접지' || JubgyKTxt=='두루마리접지' || JubgyKTxt=='DM접지' || JubgyKTxt=='12P접지'){
                        if((KindT.indexOf('2절')!=-1 && KindT.indexOf('장32절')==-1) || KindT.indexOf('4절')!=-1 || KindT.indexOf('8절')!=-1 || KindT.indexOf('국전')!=-1 || KindT.indexOf('장국2절')!=-1 || KindT.indexOf('A2')!=-1 || KindT.indexOf('A3')!=-1 || KindT.indexOf('A4')!=-1){
                            if(xQuantityR	< 2){						BJubgyKValue = 55000; }
                            else if(xQuantityR < 3){			BJubgyKValue = 50000; }
                            else if(xQuantityR < 4){			BJubgyKValue = 45000; }
                            else if(xQuantityR < 5){			BJubgyKValue = 44000; }
                            else if(xQuantityR < 6){			BJubgyKValue = 43000; }
                            else if(xQuantityR < 7){			BJubgyKValue = 42000; }
                            else if(xQuantityR < 8){			BJubgyKValue = 41000; }
                            else if(xQuantityR < 9){			BJubgyKValue = 40000; }
                            else if(xQuantityR < 10){			BJubgyKValue = 39000; }
                            else if(xQuantityR < 11){			BJubgyKValue = 38000; }
                            else if(xQuantityR < 13){			BJubgyKValue = 36000; }
                            else if(xQuantityR < 15){			BJubgyKValue = 34000; }
                            else if(xQuantityR < 17){			BJubgyKValue = 33000; }
                            else if(xQuantityR < 19){			BJubgyKValue = 32000; }
                            else if(xQuantityR < 21){			BJubgyKValue = 31000; }
                            else if(xQuantityR < 23){			BJubgyKValue = 30000; }
                            else if(xQuantityR < 30){			BJubgyKValue = 29000; }
                            else if(xQuantityR < 35){			BJubgyKValue = 28000; }
                            else if(xQuantityR < 40){			BJubgyKValue = 27000; }
                            else{													BJubgyKValue = 26000; }
                        }else{	BJubgyKValue = 0;eval('f.JubgyK_'+sn+'.selectedIndex = 0'); EstimateMSG = EstimateMSG + ', 접지'; EstimateCount = EstimateCount + 1;	}
                    }else if(JubgyKTxt=='십자접지'){
                        if((KindT.indexOf('2절')!=-1 && KindT.indexOf('장32절')==-1) || KindT.indexOf('4절')!=-1 || KindT.indexOf('8절')!=-1 || KindT.indexOf('국전')!=-1 || KindT.indexOf('A2')!=-1 || KindT.indexOf('A3')!=-1 || KindT.indexOf('A4')!=-1){
                            if(xQuantityR	< 2){						BJubgyKValue = 35000; }
                            else if(xQuantityR < 3){			BJubgyKValue = 30000; }
                            else if(xQuantityR < 4){			BJubgyKValue = 29000; }
                            else if(xQuantityR < 5){			BJubgyKValue = 28000; }
                            else if(xQuantityR < 6){			BJubgyKValue = 27000; }
                            else if(xQuantityR < 7){			BJubgyKValue = 26000; }
                            else if(xQuantityR < 8){			BJubgyKValue = 25000; }
                            else if(xQuantityR < 9){			BJubgyKValue = 23000; }
                            else if(xQuantityR < 10){			BJubgyKValue = 22000; }
                            else if(xQuantityR < 11){			BJubgyKValue = 22000; }
                            else if(xQuantityR < 13){			BJubgyKValue = 21000; }
                            else if(xQuantityR < 15){			BJubgyKValue = 21000; }
                            else if(xQuantityR < 17){			BJubgyKValue = 21000; }
                            else if(xQuantityR < 19){			BJubgyKValue = 21000; }
                            else if(xQuantityR < 21){			BJubgyKValue = 21000; }
                            else if(xQuantityR < 23){			BJubgyKValue = 20000; }
                            else if(xQuantityR < 30){			BJubgyKValue = 20000; }
                            else if(xQuantityR < 35){			BJubgyKValue = 20000; }
                            else if(xQuantityR < 40){			BJubgyKValue = 20000; }
                            else{													BJubgyKValue = 19000; }
                        }else if(KindT.indexOf('16절')!=-1){
                            if(xQuantityR	< 2){						BJubgyKValue = 42000; }
                            else if(xQuantityR < 3){			BJubgyKValue = 37000; }
                            else if(xQuantityR < 4){			BJubgyKValue = 36000; }
                            else if(xQuantityR < 5){			BJubgyKValue = 35000; }
                            else if(xQuantityR < 6){			BJubgyKValue = 34000; }
                            else if(xQuantityR < 7){			BJubgyKValue = 33000; }
                            else if(xQuantityR < 8){			BJubgyKValue = 32000; }
                            else if(xQuantityR < 9){			BJubgyKValue = 30000; }
                            else if(xQuantityR < 10){			BJubgyKValue = 29000; }
                            else if(xQuantityR < 11){			BJubgyKValue = 29000; }
                            else if(xQuantityR < 13){			BJubgyKValue = 28000; }
                            else if(xQuantityR < 15){			BJubgyKValue = 28000; }
                            else if(xQuantityR < 17){			BJubgyKValue = 28000; }
                            else if(xQuantityR < 19){			BJubgyKValue = 28000; }
                            else if(xQuantityR < 21){			BJubgyKValue = 28000; }
                            else if(xQuantityR < 23){			BJubgyKValue = 27000; }
                            else if(xQuantityR < 30){			BJubgyKValue = 27000; }
                            else if(xQuantityR < 35){			BJubgyKValue = 27000; }
                            else if(xQuantityR < 40){			BJubgyKValue = 27000; }
                            else{													BJubgyKValue = 26000; }
                        }else{	BJubgyKValue = 0;eval('f.JubgyK_'+sn+'.selectedIndex = 0'); EstimateMSG = EstimateMSG + ', 접지'; EstimateCount = EstimateCount + 1;	}
                        //if(hostname.indexOf('mspg')!=-1){
                        if(KindT.indexOf('국전')!=-1){
                            if(xQuantityR	< 2){						BJubgyKValue = 55000; }
                            else if(xQuantityR < 3){			BJubgyKValue = 50000; }
                            else if(xQuantityR < 4){			BJubgyKValue = 45000; }
                            else if(xQuantityR < 5){			BJubgyKValue = 44000; }
                            else if(xQuantityR < 6){			BJubgyKValue = 43000; }
                            else if(xQuantityR < 7){			BJubgyKValue = 42000; }
                            else if(xQuantityR < 8){			BJubgyKValue = 41000; }
                            else if(xQuantityR < 9){			BJubgyKValue = 40000; }
                            else if(xQuantityR < 10){			BJubgyKValue = 39000; }
                            else if(xQuantityR < 11){			BJubgyKValue = 38000; }
                            else if(xQuantityR < 13){			BJubgyKValue = 36000; }
                            else if(xQuantityR < 15){			BJubgyKValue = 34000; }
                            else if(xQuantityR < 17){			BJubgyKValue = 33000; }
                            else if(xQuantityR < 19){			BJubgyKValue = 32000; }
                            else if(xQuantityR < 21){			BJubgyKValue = 31000; }
                            else if(xQuantityR < 23){			BJubgyKValue = 30000; }
                            else if(xQuantityR < 30){			BJubgyKValue = 29000; }
                            else if(xQuantityR < 35){			BJubgyKValue = 28000; }
                            else if(xQuantityR < 40){			BJubgyKValue = 27000; }
                            else{													BJubgyKValue = 26000; }
                        }else{	BJubgyKValue = 0;eval('f.JubgyK_'+sn+'.selectedIndex = 0'); EstimateMSG = EstimateMSG + ', 접지'; EstimateCount = EstimateCount + 1;	}
                        //}
                    }else{	BJubgyKValue = 0;eval('f.JubgyK_'+sn+'.selectedIndex = 0'); EstimateMSG = EstimateMSG + ', 접지'; EstimateCount = EstimateCount + 1;	}
                    if(CottingKV!=''&&CottingKTxt.indexOf('양면')!=-1&&BJubgyKValue > 0){ JubgyValue = (BJubgyKValue+10000)*xQuantityR; }
                    else{ JubgyValue = BJubgyKValue*xQuantityR; }
                    if(JubgyKTxt=='2단접지'||JubgyKTxt=='3단접지'||JubgyKTxt=='3단병풍'||JubgyKTxt=='대문접지'){
                        if(Paper==7||Paper==17||Paper==24){ JubgyValue = 0;eval('f.JubgyK_'+sn+'.selectedIndex = 0'); alert('접지가 안 되는 종이 두께 입니다. 관리부로 문의 바랍니다.'); }
                    }else if(JubgyKTxt=='병풍접지'||JubgyKTxt=='두루마리접지'||JubgyKTxt=='DM접지'||JubgyKTxt=='십자접지'){
                        if(Paper==6||Paper==16||Paper==23||Paper==7||Paper==17||Paper==24){ JubgyValue = 0;eval('f.JubgyK_'+sn+'.selectedIndex = 0'); alert('접지가 안 되는 종이 두께 입니다. 관리부로 문의 바랍니다.'); }
                    }
                    if(KindT.substring(0,3)=='장32절'){
                    }else if((KindT.substring(0,3)=='32절'&&JubgyKTxt!='2단접지')||KindT.substring(0,3)=='64절'||KindT.substring(0,3)=='A6'){
                        JubgyValue = 0; eval('f.JubgyK_'+sn+'.selectedIndex = 0'); EstimateMSG = EstimateMSG + ', 접지'; EstimateCount = EstimateCount + 1;
                    }
                    eval('f.JubgyC_'+sn+'.value = JubgyValue');
                }else{ eval('f.JubgyC_'+sn+'.value = 0'); }
                //**************접지*************************************************************
                //**************제본*************************************************************
                if(JaebonKV!='')
                {
                    if(JaebonKTxt=='떡제본'){ BJaebonKValue = 20000;  BUnitValue = 15000; }
                    else if(JaebonKTxt=='중철제본'){ BJaebonKValue = 50000;  BUnitValue = 50000; }
                    else if(JaebonKTxt=='짧은쪽중철'){ BJaebonKValue = 75000;  BUnitValue = 75000; }
                    else if(JaebonKTxt=='무선제본'){ BJaebonKValue = 170000;  BUnitValue = 170000; }
                    JaebonValue = BJaebonKValue + (xQuantityR-1)*BUnitValue;
                    if(JaebonKTxt!='떡제본'){ EstimateMSG = EstimateMSG + ', 떡제본'; EstimateCount = EstimateCount + 1; }
                    eval('f.JaebonC_'+sn+'.value = JaebonValue');
                }
                else{ eval('f.JaebonC_'+sn+'.value = 0'); }
                //**************제본*************************************************************

                //**************도무송(독판전단지)***********************************************
                if(DomusongKV!='')
                {
                    if(Product==40&&!(DomusongKTxt.indexOf('문고리')!=-1||DomusongKV==98))
                    {
                        eval('f.DomusongK_'+sn+'.selectedIndex = OptionSI(sn,"DomusongK",87)');
                        DomusongKTxt=='문고리 1';
                    }
                    else if(Product==39)
                    {
                        if(KindT.substring(0,3)=='16절'&&(DomusongKV<68||DomusongKV>76))
                        {
                            alert('16절 문어발칼선을 선택하세요!');
                            eval('f.DomusongK_'+sn+'.selectedIndex = OptionSI(sn,"DomusongK",68)');
                            DomusongKTxt=='60*36.2-5개';
                        }
                        else if(KindT.substring(0,2)=='A4'&&(DomusongKV<78||DomusongKV>86))
                        {
                            alert('A4 문어발칼선을 선택하세요!');
                            eval('f.DomusongK_'+sn+'.selectedIndex = OptionSI(sn,"DomusongK",78)');
                            DomusongKTxt=='60*41.8-5개';
                        }
                        else if(KindT.substring(0,2)=='4절'&&DomusongKV!=66)
                        {
                            alert('4절 문어발칼선을 선택하세요!');
                            eval('f.DomusongK_'+sn+'.selectedIndex = OptionSI(sn,"DomusongK",66)');
                            DomusongKTxt=='100*36.6-10개';
                        }
                        else if(KindT.substring(0,2)=='8절'&&DomusongKV!=67)
                        {
                            alert('8절 문어발칼선을 선택하세요!');
                            eval('f.DomusongK_'+sn+'.selectedIndex = OptionSI(sn,"DomusongK",67)');
                            DomusongKTxt=='100*32-8개';
                        }
                        else if(KindT.substring(0,2)=='A3'&&DomusongKV!=77)
                        {
                            alert('A3 문어발칼선을 선택하세요!');
                            eval('f.DomusongK_'+sn+'.selectedIndex = OptionSI(sn,"DomusongK",77)');
                            DomusongKTxt=='100*37-8개';
                        }
                    }
                    if(DomusongKTxt=='목형+도무송')
                    {
                        MockhungV = 40000*Math.ceil(BJAmount/2000);
                        if(MockhungV<40000) { MockhungV = 40000; }
                        alert('목형비는 변경될 수 있습니다!');
                    }
                    else { MockhungV = 40000; }
                    DomusongValue = MockhungV + (xQuantityR-1)*35000;
                    eval('f.DomusongC_'+sn+'.value = DomusongValue');
                }
                else{ eval('f.DomusongC_'+sn+'.value = 0'); }
                //**************도무송(독판전단지)***********************************************
                //**************넘버링(독판전단지)************************************************
                if(NumberingKV!=''){
                    //if(hostname.indexOf('mspg')!=-1){
                    eval('f.NumberingC_'+sn+'.value = 0');
                    alert('넘버링 가격은 관리과로 문의 바랍니다.');
                    //}
                    //eval('f.NumberingC_'+sn+'.value = 80000*xQuantityR');
                }else{
                    eval('f.NumberingC_'+sn+'.value = 0');
                }
                //**************넘버링(독판전단지)************************************************
            }
            else if(Product==43)   //카다로그
            {
                //**************코팅*************************************************************
                if((Paper==13||Paper==20)&&CottingKV!='')
                {
                    alert('150g은 코팅하실 수 없습니다!');
                    eval('f.CottingK_'+sn+'.selectedIndex = 0');
                }
                else if(CottingKV!='')
                {
                    if(CottingKTxt=='유광단면코팅')
                    { eval('f.Cost_'+sn+'.value = Cost_'+Product+'_'+QuantityR+'_'+xPaper+'_'+xPaper2+'_YC['+myindex2+']'); }
                    else if(CottingKTxt=='무광단면코팅')
                    { eval('f.Cost_'+sn+'.value = Cost_'+Product+'_'+QuantityR+'_'+xPaper+'_'+xPaper2+'_MC['+myindex2+']'); }
                    else
                    {
                        alert('유광단면코팅,무광단면코팅만 가능합니다!');
                        eval('f.CottingK_'+sn+'.selectedIndex = 0');
                    }
                    eval('f.CottingC_'+sn+'.value = 0');
                }
                else{ eval('f.CottingC_'+sn+'.value = 0'); }
                //**************코팅*************************************************************
            }
            else if(Product==45)   //리플렛
            {
                //**************코팅*************************************************************
                if(CottingKV!='')
                {
                    if(PaperT.substring(0,3)=='150'&&CottingKTxt.indexOf('양면')!=-1)
                    { alert('150g은 단면코팅만 가능합니다!');
                        eval('f.CottingK_'+sn+'.selectedIndex = 0'); CottingKTxt=''; Cost(sn);
                    }
                    if(CottingKTxt=='유광단면코팅')
                    { eval('CottingValue = Cost_'+Product+'_'+QuantityR+'_YC_1['+myindex2+']') }
                    else if(CottingKTxt=='유광양면코팅')
                    { eval('CottingValue = Cost_'+Product+'_'+QuantityR+'_YC_2['+myindex2+']') }
                    else if(CottingKTxt=='무광단면코팅')
                    { eval('CottingValue = Cost_'+Product+'_'+QuantityR+'_MC_1['+myindex2+']') }
                    else if(CottingKTxt=='무광양면코팅')
                    { eval('CottingValue = Cost_'+Product+'_'+QuantityR+'_MC_2['+myindex2+']') }
                    eval('f.CottingC_'+sn+'.value = parseInt(CottingValue) - parseInt(f.Cost_'+sn+'.value)');
                }
                else{ eval('f.CottingC_'+sn+'.value = 0'); }
                //**************코팅*************************************************************
            }
            else if(Product==47)   //홀더
            {
                if(KindT.indexOf('단면')!=-1&&CottingKTxt.indexOf('양면')!=-1)
                {
                    alert('홀더 단면인쇄제품은 양면코팅을 하실 수 없습니다.');
                    eval('f.CottingK_'+sn+'.selectedIndex = 0');
                    CottingKV=''; CottingKTxt='';
                }
                //**************코팅*************************************************************
                if(CottingKV!='')
                {
                    if(CottingKTxt=='유광단면코팅')
                    { eval('CottingValue = Cost_'+Product+'_'+QuantityR+'_YC_1['+myindex2+']') }
                    else if(CottingKTxt=='유광양면코팅')
                    { eval('CottingValue = Cost_'+Product+'_'+QuantityR+'_YC_2['+myindex2+']') }
                    else if(CottingKTxt=='무광단면코팅')
                    { eval('CottingValue = Cost_'+Product+'_'+QuantityR+'_MC_1['+myindex2+']') }
                    else if(CottingKTxt=='무광양면코팅')
                    { eval('CottingValue = Cost_'+Product+'_'+QuantityR+'_MC_2['+myindex2+']') }
                    eval('f.CottingC_'+sn+'.value = parseInt(CottingValue) - parseInt(f.Cost_'+sn+'.value)');
                }
                else{ eval('f.CottingC_'+sn+'.value = 0'); }
                //**************코팅*************************************************************
            }
            else if(Product==48||Product==49||Product==50||Product==51||Product==52||Product==53||Product==54||Product==111||Product==55||Product==101||Product==102||Product==103||Product==104||Product==112||Product==113||Product==114)   //칼라대봉투합판,칼라소봉투합판,봉투세트합판,칼라대봉투독판,칼라소봉투독판,칼라봉투세트독판,마스타대봉투,마스타소봉투
            {
                //**************도무송***********************************************************
                if(DomusongKV!='')
                {
                    if(DomusongKTxt=='목형+도무송')
                    {
                        MockhungV = 30000;
                        if(Product==48||Product==51||Product==54||Product==101||Product==102){ DomusongValue = MockhungV + (QuantityR/1000)*40000; }
                        else if(Product==49||Product==52||Product==55||Product==103||Product==104||Product==111||Product==112||Product==113||Product==114){ DomusongValue = MockhungV + (QuantityR/1000)*40000; }
                        else if(Product==50||Product==53)
                        { DomusongValue = (MockhungV+QuantityR*40000)+(MockhungV+QuantityR*2*40000); }
                    }
                    else { DomusongValue = 0; }
                    eval('f.DomusongC_'+sn+'.value = DomusongValue');
                }
                else{ eval('f.DomusongC_'+sn+'.value = 0'); }
                //**************도무송***********************************************************
                //**************제본*************************************************************
                if(JaebonKV!='')
                {
                    if(JaebonKTxt=='양면테이프')
                    {
                        if(QuantityR == 500){ BUnitValue1 = 30; BUnitValue2 = 25; }
                        else if(QuantityR==1000){ BUnitValue1 = 25; BUnitValue2 = 20; }
                        else if(QuantityR==1500){ BUnitValue1 = 25; BUnitValue2 = 20; }
                        else if(QuantityR >= 10000){ BUnitValue1 = 15; BUnitValue2 = 10; }
                        else if(QuantityR >= 5000){ BUnitValue1 = 17; BUnitValue2 = 13; }
                        else if(QuantityR >= 2000){ BUnitValue1 = 20; BUnitValue2 = 15; }
                        else { BUnitValue1 = 30; BUnitValue2 = 25; }
                        if(Product==48||Product==51||Product==54||Product==101||Product==102){ JaebonValue=QuantityR*BUnitValue1; }
                        else if(Product==49||Product==52||Product==55||Product==103||Product==104||Product==111||Product==112||Product==113||Product==114){ JaebonValue = QuantityR*BUnitValue2; }
                        else if(Product==50||Product==53)
                        {
                            if(QuantityR==1)     { BUnitValue1 = 45; BUnitValue2 = 35; }
                            else if(QuantityR==2){ BUnitValue1 = 40; BUnitValue2 = 35; }
                            else if(QuantityR<=5){ BUnitValue1 = 40; BUnitValue2 = 30; }
                            else                 { BUnitValue1 = 35; BUnitValue2 = 30; }
                            JaebonValue = QuantityR*1000*BUnitValue1 + QuantityR*2000*BUnitValue2;
                        }
                    }
                    else{ JaebonValue = 0; }
                    eval('f.JaebonC_'+sn+'.value = JaebonValue');
                }
                else{ eval('f.JaebonC_'+sn+'.value = 0'); }
                //**************제본*************************************************************
                //**************by lee 타공 추가 20160201*************************************************************
                if(TagongKV!='')
                {
                    var TBUnitValue1 = 0;
                    var TBUnitValue2 = 0;
                    if(QuantityR == 500){ TBUnitValue1 = 9000; TBUnitValue2 = 8000; }
                    else if(QuantityR==1000){ TBUnitValue1 = 10; TBUnitValue2 = 9; }
                    else if(QuantityR==1500){ TBUnitValue1 = 10; TBUnitValue2 = 9; }
                    else if(QuantityR	>=10000){ TBUnitValue1 = 7; TBUnitValue2 = 6; }
                    else if(QuantityR	>=5000){ TBUnitValue1 = 8; TBUnitValue2 = 7; }
                    else if(QuantityR	>=2000){ TBUnitValue1 = 9; TBUnitValue2 = 8; }
                    else { TBUnitValue1 = 10; TBUnitValue2 = 9; }
                    if(Product==48||Product==51||Product==54||Product==101||Product==102){
                        if(QuantityR == 500){ TagongValue = 9000; }
                        else{ TagongValue=QuantityR*TBUnitValue1; }

                    }
                    else if(Product==49||Product==52||Product==55||Product==103||Product==104||Product==111||Product==112||Product==113||Product==114){
                        if(QuantityR == 500){ TagongValue = 8000; }
                        else{ TagongValue=QuantityR*TBUnitValue2; }
                    }
                    else if(Product==50||Product==53)
                    {
                        TagongValue = 0;
                    }else{
                        TagongValue = 0;
                    }
                    eval('f.TagongC_'+sn+'.value = TagongValue');
                }
                else{ eval('f.TagongC_'+sn+'.value = 0'); }
                //**************타공*************************************************************
                //**************제판비(마스타봉투)*************************************************
                if(JaepanKV!='')
                {
                    if(Product==54){
                        if(QuantityR <= 1000){ BUnitValue = 8000;
                        }else if(QuantityR <= 2000){ BUnitValue = 13000;
                        }else if(QuantityR <= 3000){ BUnitValue = 18000;
                        }else if(QuantityR <= 4000){ BUnitValue = 23000;
                        }else if(QuantityR <= 5000){ BUnitValue = 28000;
                        }else if(QuantityR <= 6000){ BUnitValue = 33000;
                        }else if(QuantityR <= 7000){ BUnitValue = 38000;
                        }else if(QuantityR <= 8000){ BUnitValue = 43000;
                        }else if(QuantityR <= 9000){ BUnitValue = 48000;
                        }else if(QuantityR <= 10000){ BUnitValue = 53000;
                        }else if(QuantityR <= 20000){ BUnitValue = 103000;
                        }else if(QuantityR <= 30000){ BUnitValue = 153000;
                        }else if(QuantityR <= 40000){ BUnitValue = 203000;
                        }else if(QuantityR <= 50000){ BUnitValue = 253000;
                        }else{ BUnitValue = 53000; }
                        if(JaepanKTxt.indexOf('1')!=-1){ BUnitValue = BUnitValue * 1; }
                        else if(JaepanKTxt.indexOf('2')!=-1){ BUnitValue = BUnitValue * 2; }
                        else if(JaepanKTxt.indexOf('3')!=-1){ BUnitValue = BUnitValue * 3; }
                        else if(JaepanKTxt.indexOf('4')!=-1){ BUnitValue = BUnitValue * 4; }
                        else if(JaepanKTxt.indexOf('5')!=-1){ BUnitValue = BUnitValue * 5; }
                        else if(JaepanKTxt.indexOf('6')!=-1){ BUnitValue = BUnitValue * 6; }
                        else if(JaepanKTxt.indexOf('7')!=-1){ BUnitValue = BUnitValue * 7; }
                        else if(JaepanKTxt.indexOf('8')!=-1){ BUnitValue = BUnitValue * 8; }
                        else { BUnitValue = 0; }
                        JaepanValue = BUnitValue;
                        eval('f.JaepanC_'+sn+'.value = JaepanValue');
                    }else if(Product==55){
                        if(QuantityR <= 1000){ BUnitValue = 7000;
                        }else if(QuantityR <= 2000){ BUnitValue = 11000;
                        }else if(QuantityR <= 3000){ BUnitValue = 15000;
                        }else if(QuantityR <= 4000){ BUnitValue = 19000;
                        }else if(QuantityR <= 5000){ BUnitValue = 23000;
                        }else if(QuantityR <= 6000){ BUnitValue = 27000;
                        }else if(QuantityR <= 7000){ BUnitValue = 31000;
                        }else if(QuantityR <= 8000){ BUnitValue = 35000;
                        }else if(QuantityR <= 9000){ BUnitValue = 39000;
                        }else if(QuantityR <= 10000){ BUnitValue = 43000;
                        }else if(QuantityR <= 20000){ BUnitValue = 83000;
                        }else if(QuantityR <= 30000){ BUnitValue = 123000;
                        }else if(QuantityR <= 40000){ BUnitValue = 163000;
                        }else if(QuantityR <= 50000){ BUnitValue = 203000;
                        }else{ BUnitValue = 43000; }
                        if(JaepanKTxt.indexOf('1')!=-1){ BUnitValue = BUnitValue * 1; }
                        else if(JaepanKTxt.indexOf('2')!=-1){ BUnitValue = BUnitValue * 2; }
                        else if(JaepanKTxt.indexOf('3')!=-1){ BUnitValue = BUnitValue * 3; }
                        else if(JaepanKTxt.indexOf('4')!=-1){ BUnitValue = BUnitValue * 4; }
                        else if(JaepanKTxt.indexOf('5')!=-1){ BUnitValue = BUnitValue * 5; }
                        else if(JaepanKTxt.indexOf('6')!=-1){ BUnitValue = BUnitValue * 6; }
                        else if(JaepanKTxt.indexOf('7')!=-1){ BUnitValue = BUnitValue * 7; }
                        else if(JaepanKTxt.indexOf('8')!=-1){ BUnitValue = BUnitValue * 8; }
                        else { BUnitValue = 0; }
                        JaepanValue = BUnitValue;
                        eval('f.JaepanC_'+sn+'.value = JaepanValue');
                    }else{
                        if(JaepanKTxt.indexOf('1')!=-1){ BUnitValue = 3000; }
                        else if(JaepanKTxt.indexOf('2')!=-1){ BUnitValue = 6000; }
                        else if(JaepanKTxt.indexOf('3')!=-1){ BUnitValue = 9000; }
                        else if(JaepanKTxt.indexOf('4')!=-1){ BUnitValue = 12000; }
                        else if(JaepanKTxt.indexOf('5')!=-1){ BUnitValue = 15000; }
                        else if(JaepanKTxt.indexOf('6')!=-1){ BUnitValue = 18000; }
                        else if(JaepanKTxt.indexOf('7')!=-1){ BUnitValue = 21000; }
                        else if(JaepanKTxt.indexOf('8')!=-1){ BUnitValue = 24000; }
                        else { BUnitValue = 0; }
                        if(Product==54&&QuantityR==500){ JaepanValue = 5000 + BUnitValue }
                        else if(Product==54){ JaepanValue =  Math.ceil(QuantityR/1000)*1000*5 + BUnitValue }
                        else if(Product==55){ JaepanValue = QuantityR*4 + BUnitValue }
                        else{ JaepanValue = 0; }
                        eval('f.JaepanC_'+sn+'.value = JaepanValue');
                    }
                }
                else{ eval('f.JaepanC_'+sn+'.value = 0'); }
                //**************제판비(마스타봉투)*************************************************
            }
            else if(Product==37)   //합판메뉴판
            {
                //**************오시*************************************************************
                if(OsiKV!='')
                {
                    if(KindT.indexOf('16절')!=-1&&!(OsiKTxt=='오시1줄'||OsiKTxt=='오시2줄'))
                    {  alert('오시1줄,오시2줄만 가능합니다!');
                        eval('f.OsiK_'+sn+'.selectedIndex = OptionSI(sn,"OsiK",18)'); OsiKTxt='오시1줄';
                    }
                    if((KindT.indexOf('32절')!=-1||KindT.indexOf('64절')!=-1)&&OsiKTxt!='오시1줄')
                    {  alert('오시1줄만 가능합니다!');
                        eval('f.OsiK_'+sn+'.selectedIndex = OptionSI(sn,"OsiK",18)'); OsiKTxt='오시1줄';
                    }
                    BOsiValue = 10000;
                    if(KindT.indexOf('16절')!=-1&&OsiKTxt=='오시2줄'){ BOsiValue = BOsiValue + 5000;  }
                    else if(KindT.indexOf('32절')!=-1){ BOsiValue = BOsiValue + 5000;  }
                    else if(KindT.indexOf('64절')!=-1){ BOsiValue = BOsiValue + 10000;  }
                    OsiValue = BOsiValue*xQuantityR;
                    //eval('f.OsiC_'+sn+'.value = OsiValue');
                    eval('f.Cost_'+sn+'.value = parseInt(f.Cost_'+sn+'.value)+OsiValue');
                }
                else{ eval('f.OsiC_'+sn+'.value = 0'); }
                //**************오시*************************************************************
                //**************타공*************************************************************
                if(TagongKV!='')
                {
                    if(TagongKTxt!='1구멍'&&TagongKTxt!='2구멍')
                    {  alert('1구멍,2구멍만 가능합니다!');
                        eval('f.TagongK_'+sn+'.selectedIndex = OptionSI(sn,"TagongK",23)'); TagongKTxt='1구멍';
                    }
                    if(KindT.indexOf('64절')!=-1&&TagongKTxt!='1구멍')
                    {  alert('1구멍만 가능합니다!');
                        eval('f.TagongK_'+sn+'.selectedIndex = OptionSI(sn,"TagongK",23)'); TagongKTxt='1구멍';
                    }
                    if(TagongKTxt=='1구멍')     { BTagongValue = 10000; }
                    else if(TagongKTxt=='2구멍'){ BTagongValue = 10000; }
                    if(KindT.indexOf('32절')!=-1){ BTagongValue = BTagongValue + 5000;  }
                    else if(KindT.indexOf('64절')!=-1){ BTagongValue = BTagongValue + 10000;  }
                    TagongValue = BTagongValue*xQuantityR;
                    //eval('f.TagongC_'+sn+'.value = TagongValue');
                    eval('f.Cost_'+sn+'.value = parseInt(f.Cost_'+sn+'.value)+TagongValue');
                }
                else{ eval('f.TagongC_'+sn+'.value = 0'); }
                //**************타공*************************************************************
                //**************코팅*************************************************************
                if(CottingKV!='')
                {
                    //if(CottingKTxt!='유광단면코팅'&&CottingKTxt!='유광양면코팅'&&CottingKTxt!='UV단면코팅')
                    if(CottingKTxt!='유광단면코팅')
                    {  alert('유광단면코팅만 가능합니다!');
                        eval('f.CottingK_'+sn+'.selectedIndex = OptionSI(sn,"CottingK",56)'); CottingKTxt='유광단면코팅';
                    }
                    if(CottingKTxt=='유광단면코팅'){ BCottingValue = 30000; }
                    //else if(CottingKTxt=='유광양면코팅'&&xQuantityR==4){ BCottingValue = 140000; }
                    //else if(CottingKTxt=='유광양면코팅'){ BCottingValue = 170000; }
                    else if(CottingKTxt=='UV단면코팅'){ BCottingValue = 15000; }
                    else{	BCottingValue = 170000; }
                    CottingValue = BCottingValue*xQuantityR;
                    //if(KindT.indexOf('8절')!=-1){ CottingValue = CottingValue + 20000; }
                    //eval('f.CottingC_'+sn+'.value = CottingValue');
                    eval('f.Cost_'+sn+'.value = parseInt(DeComma(f.Cost_'+sn+'.value))+CottingValue');
                }
                //**************코팅*************************************************************
                if(OsiKV!=''&&JubgyKV!='')
                {
                    alert('오시와 접지는 동시에 선택하실 수 없습니다!');
                    eval('f.JubgyK_'+sn+'.selectedIndex = 0'); JubgyKV=''; JubgyKTxt='';
                }
                if(CottingKV==''&&JubgyKV!='')
                {
                    alert('코팅을 선택하셔야 접지를 하실 수 있습니다!');
                    eval('f.JubgyK_'+sn+'.selectedIndex = 0'); JubgyKV=''; JubgyKTxt='';
                }
                if(CottingKTxt.indexOf('양면코팅')!=-1&&JubgyKV!='')
                {
                    alert('양면코팅은 접지를 하실 수 없습니다!');
                    eval('f.JubgyK_'+sn+'.selectedIndex = 0'); JubgyKV=''; JubgyKTxt='';
                }
                //**************접지*************************************************************
                if(JubgyKV!='')
                {
                    if(KindT.indexOf('32절')!=-1||KindT.indexOf('64절')!=-1)
                    {  alert('32절,64절은 접지를 하실 수 없습니다!');
                        eval('f.JubgyK_'+sn+'.selectedIndex = 0'); JubgyKTxt='';
                    }
                    else if(JubgyKTxt!='2단접지')
                    {  alert('2단접지만 가능합니다!');
                        eval('f.JubgyK_'+sn+'.selectedIndex = OptionSI(sn,"JubgyK",99)'); JubgyKTxt='2단접지';
                    }
                    if(JubgyKTxt=='2단접지')
                    {
                        if(xQuantityR<5){ BJubgyKValue = 10000; }
                        else{ BJubgyKValue = 10000; }
                    }
                    else{ BJubgyKValue = 0; }
                    JubgyValue = BJubgyKValue*xQuantityR;
                    //eval('f.JubgyC_'+sn+'.value = JubgyValue');
                    eval('f.Cost_'+sn+'.value = parseInt(f.Cost_'+sn+'.value)+JubgyValue');
                }
                else{ eval('f.JubgyC_'+sn+'.value = 0'); }
                //**************접지*************************************************************
            }
            else if((Product==19||Product==20||Product==21||Product==22||Product==79||Product==94)&&KindT.indexOf('도무송')!=-1)
            {
                //도무송스티커,강접스티커,유포지스티커,은데드롱스티커,투명스티커,80모조스티커
                //**************도무송************************************************************
                if(DomusongKV!='')
                {
                    var MockhungV = 0;
                    if(DomusongKTxt=='전단지문어발'){ MockhungV = 0; }
                    else if(DomusongKTxt=='기타도무송')  { MockhungV = 0; }
                    eval('var WHL1 = parseInt(f.Width_'+sn+'.value)');
                    eval('var WHL2 = parseInt(f.Height_'+sn+'.value)');
                    if(WHL1>=WHL2){ var WHL = WHL1 }
                    else{ var WHL = WHL2 }
                    if(DomusongKTxt=='A타입스티커')
                    {
                        if((WHL<70)&&(QuantityR<=1000)){ DomusongValue = 1000*6; }
                        else if((WHL<70)&&(QuantityR<6000)){ DomusongValue = QuantityR*5; }
                        else if((WHL<70)&&(QuantityR>=6000)){ DomusongValue = QuantityR*4; }
                        else if((WHL<120)&&(QuantityR<=1000)){ DomusongValue = 1000*7; }
                        else if((WHL<120)&&(QuantityR<6000)){ DomusongValue = QuantityR*6; }
                        else if((WHL<120)&&(QuantityR>=6000)){ DomusongValue = QuantityR*5; }
                        else if((WHL<180)&&(QuantityR<=1000)){ DomusongValue = 1000*8; }
                        else if((WHL<180)&&(QuantityR<6000)){ DomusongValue = QuantityR*7; }
                        else if((WHL<180)&&(QuantityR>=6000)){ DomusongValue = QuantityR*6; }
                        else if((WHL<230)&&(QuantityR<=1000)){ DomusongValue = 1000*9; }
                        else if((WHL<230)&&(QuantityR<6000)){ DomusongValue = QuantityR*8; }
                        else if((WHL<230)&&(QuantityR>=6000)){ DomusongValue = QuantityR*7; }
                        else if((WHL<260)&&(QuantityR<=1000)){ DomusongValue = 1000*10; }
                        else if((WHL<260)&&(QuantityR<6000)){ DomusongValue = QuantityR*9; }
                        else if((WHL<260)&&(QuantityR>=6000)){ DomusongValue = QuantityR*8; }
                        else if((WHL<301)&&(QuantityR<=1000)){ DomusongValue = 1000*11; }
                        else if((WHL<301)&&(QuantityR<6000)){ DomusongValue = QuantityR*10; }
                        else if((WHL<301)&&(QuantityR>=6000)){ DomusongValue = QuantityR*9; }
                        else if((WHL<600)&&(QuantityR<=1000)){ DomusongValue = 1000*21; }
                        else if((WHL<600)&&(QuantityR<6000)){ DomusongValue = QuantityR*20; }
                        else if((WHL<600)&&(QuantityR>=6000)){ DomusongValue = QuantityR*19; }
                        else if((WHL<701)&&(QuantityR<=1000)){ DomusongValue = 1000*31; }
                        else if((WHL<701)&&(QuantityR<6000)){ DomusongValue = QuantityR*30; }
                        else if((WHL<701)&&(QuantityR>=6000)){ DomusongValue = QuantityR*29; }
                        else{ DomusongValue = QuantityR*30; }
                    }
                    else if(DomusongKTxt=='B타입스티커')
                    {
                        if((WHL<70)&&(QuantityR<=1000)){ DomusongValue = 1000*10; }
                        else if((WHL<70)&&(QuantityR<6000)){ DomusongValue = QuantityR*9; }
                        else if((WHL<70)&&(QuantityR>=6000)){ DomusongValue = QuantityR*8; }
                        else if((WHL<120)&&(QuantityR<=1000)){ DomusongValue = 1000*11; }
                        else if((WHL<120)&&(QuantityR<6000)){ DomusongValue = QuantityR*10; }
                        else if((WHL<120)&&(QuantityR>=6000)){ DomusongValue = QuantityR*9; }
                        else if((WHL<180)&&(QuantityR<=1000)){ DomusongValue = 1000*12; }
                        else if((WHL<180)&&(QuantityR<6000)){ DomusongValue = QuantityR*11; }
                        else if((WHL<180)&&(QuantityR>=6000)){ DomusongValue = QuantityR*10; }
                        else if((WHL<230)&&(QuantityR<=1000)){ DomusongValue = 1000*13; }
                        else if((WHL<230)&&(QuantityR<6000)){ DomusongValue = QuantityR*12; }
                        else if((WHL<230)&&(QuantityR>=6000)){ DomusongValue = QuantityR*11; }
                        else if((WHL<260)&&(QuantityR<=1000)){ DomusongValue = 1000*14; }
                        else if((WHL<260)&&(QuantityR<6000)){ DomusongValue = QuantityR*13; }
                        else if((WHL<260)&&(QuantityR>=6000)){ DomusongValue = QuantityR*12; }
                        else if((WHL<301)&&(QuantityR<=1000)){ DomusongValue = 1000*15; }
                        else if((WHL<301)&&(QuantityR<6000)){ DomusongValue = QuantityR*14; }
                        else if((WHL<301)&&(QuantityR>=6000)){ DomusongValue = QuantityR*13; }
                        else if((WHL<600)&&(QuantityR<=1000)){ DomusongValue = 1000*25; }
                        else if((WHL<600)&&(QuantityR<6000)){ DomusongValue = QuantityR*24; }
                        else if((WHL<600)&&(QuantityR>=6000)){ DomusongValue = QuantityR*23; }
                        else if((WHL<701)&&(QuantityR<=1000)){ DomusongValue = 1000*35; }
                        else if((WHL<701)&&(QuantityR<6000)){ DomusongValue = QuantityR*34; }
                        else if((WHL<701)&&(QuantityR>=6000)){ DomusongValue = QuantityR*33; }
                        else{ DomusongValue = QuantityR*35; }
                    }
                    else if(DomusongKTxt=='C타입스티커')
                    {
                        if((WHL<70)&&(QuantityR<=1000)){ DomusongValue = 1000*15; }
                        else if((WHL<70)&&(QuantityR<6000)){ DomusongValue = QuantityR*14; }
                        else if((WHL<70)&&(QuantityR>=6000)){ DomusongValue = QuantityR*13; }
                        else if((WHL<120)&&(QuantityR<=1000)){ DomusongValue = 1000*16; }
                        else if((WHL<120)&&(QuantityR<6000)){ DomusongValue = QuantityR*15; }
                        else if((WHL<120)&&(QuantityR>=6000)){ DomusongValue = QuantityR*14; }
                        else if((WHL<180)&&(QuantityR<=1000)){ DomusongValue = 1000*17; }
                        else if((WHL<180)&&(QuantityR<6000)){ DomusongValue = QuantityR*16; }
                        else if((WHL<180)&&(QuantityR>=6000)){ DomusongValue = QuantityR*15; }
                        else if((WHL<230)&&(QuantityR<=1000)){ DomusongValue = 1000*18; }
                        else if((WHL<230)&&(QuantityR<6000)){ DomusongValue = QuantityR*17; }
                        else if((WHL<230)&&(QuantityR>=6000)){ DomusongValue = QuantityR*16; }
                        else if((WHL<260)&&(QuantityR<=1000)){ DomusongValue = 1000*19; }
                        else if((WHL<260)&&(QuantityR<6000)){ DomusongValue = QuantityR*18; }
                        else if((WHL<260)&&(QuantityR>=6000)){ DomusongValue = QuantityR*17; }
                        else if((WHL<301)&&(QuantityR<=1000)){ DomusongValue = 1000*20; }
                        else if((WHL<301)&&(QuantityR<6000)){ DomusongValue = QuantityR*19; }
                        else if((WHL<301)&&(QuantityR>=6000)){ DomusongValue = QuantityR*18; }
                        else if((WHL<600)&&(QuantityR<=1000)){ DomusongValue = 1000*32; }
                        else if((WHL<600)&&(QuantityR<6000)){ DomusongValue = QuantityR*29; }
                        else if((WHL<600)&&(QuantityR>=6000)){ DomusongValue = QuantityR*27; }
                        else if((WHL<701)&&(QuantityR<=1000)){ DomusongValue = 1000*42; }
                        else if((WHL<701)&&(QuantityR<6000)){ DomusongValue = QuantityR*39; }
                        else if((WHL<701)&&(QuantityR>=6000)){ DomusongValue = QuantityR*37; }
                        else{ DomusongValue = QuantityR*40; }
                    }

                    DomusongValue = MockhungV + DomusongValue
                    //if(Product==21||Product==22||Product==79){ DomusongValue = DomusongValue + 20000; }
                    eval('f.DomusongC_'+sn+'.value = DomusongValue');
                }
                else{ eval('f.DomusongC_'+sn+'.value = 0'); }
                //**************도무송************************************************************
            }
            else if(Product==56||Product==57||Product==106||Product==107)   //마스타양식지1,마스타양식지2
            {
                //**************재단*************************************************************
                if(JaeDanKV!='')
                {
                    if(JaeDanKTxt=='2등분재단')     { BJaeDanValue = 0; }
                    else if(JaeDanKTxt=='3등분재단'){ BJaeDanValue = 0; }
                    else if(JaeDanKTxt=='4등분재단'){ BJaeDanValue = 5000; }
                    else if(JaeDanKTxt=='5등분재단'){ BJaeDanValue = 5000; }
                    else if(JaeDanKTxt=='6등분재단'){ BJaeDanValue = 5000; }
                    JaeDanValue = Math.ceil(QuantityR*100/BJAmount)*BJaeDanValue;
                    eval('f.JaeDanC_'+sn+'.value = JaeDanValue');
                }
                else{ eval('f.JaeDanC_'+sn+'.value = 0'); }
                //**************재단*************************************************************
                //**************제판비***********************************************************
                if(JaepanKV!='')
                {
                    if(JaepanKTxt=='1도인쇄비추가')      { JaepanValue=9000; }
                    else if(JaepanKTxt=='2도인쇄비추가') { JaepanValue=18000; }
                    else if(JaepanKTxt=='3도인쇄비추가') { JaepanValue=27000; }
                    else if(JaepanKTxt=='4도인쇄비추가') { JaepanValue=35000; }
                    else if(JaepanKTxt=='5도인쇄비추가') { JaepanValue=43000; }
                    JaepanValue = JaepanValue*Math.ceil(QuantityR*100/BJAmount);
                    eval('f.JaepanC_'+sn+'.value = f.JaepanC_V_'+sn+'.value = JaepanValue');
                }
                else{ eval('f.JaepanC_'+sn+'.value = f.JaepanC_V_'+sn+'.value = 0'); }
                //**************제판비***********************************************************
            }
            else if(Product==58)   //마스타양식지3
            {
                //**************재단*************************************************************
                if(JaeDanKV!='')
                {
                    if(JaeDanKTxt=='2등분재단')     { BJaeDanValue = 0; }
                    else if(JaeDanKTxt=='3등분재단'){ BJaeDanValue = 0; }
                    else if(JaeDanKTxt=='4등분재단'){ BJaeDanValue = 5000; }
                    else if(JaeDanKTxt=='5등분재단'){ BJaeDanValue = 5000; }
                    else if(JaeDanKTxt=='6등분재단'){ BJaeDanValue = 5000; }
                    JaeDanValue = QuantityR*BJaeDanValue;
                    eval('f.JaeDanC_'+sn+'.value = JaeDanValue');
                }
                else{ eval('f.JaeDanC_'+sn+'.value = 0'); }
                //**************재단*************************************************************
                //**************제판비***********************************************************
                if(JaepanKV!='')
                {
                    if(JaepanKTxt=='1도인쇄비추가')      { JaepanValue=9000; }
                    else if(JaepanKTxt=='2도인쇄비추가') { JaepanValue=18000; }
                    else if(JaepanKTxt=='3도인쇄비추가') { JaepanValue=27000; }
                    else if(JaepanKTxt=='4도인쇄비추가') { JaepanValue=35000; }
                    else if(JaepanKTxt=='5도인쇄비추가') { JaepanValue=43000; }
                    JaepanValue = JaepanValue*QuantityR;
                    eval('f.JaepanC_'+sn+'.value = f.JaepanC_V_'+sn+'.value = JaepanValue');
                }
                else{ eval('f.JaepanC_'+sn+'.value = f.JaepanC_V_'+sn+'.value = 0'); }
                //**************제판비***********************************************************
                //**************제본*************************************************************
                if(JaebonKV!=''&&KindT.indexOf('제본')==-1)
                {
                    if(JaebonKTxt!='떡제본')
                    {  alert('떡제본만 가능합니다!');
                        eval('f.JaebonK_'+sn+'.selectedIndex = OptionSI(sn,"JaebonK",106)');
                    }
                    if(KindT.indexOf('국전')!=-1)
                    {
                        if(QuantityR<3)        { JaebonValue=10000*QuantityR }
                        else if(QuantityR<10)  { JaebonValue=10000*QuantityR }
                        else                   { JaebonValue=9000*QuantityR }
                    }
                    else
                    {
                        if(QuantityR<3)        { JaebonValue=17000*QuantityR }
                        else if(QuantityR<6)   { JaebonValue=15000*QuantityR }
                        else if(QuantityR<10)  { JaebonValue=14000*QuantityR }
                        else                   { JaebonValue=12000*QuantityR }
                    }
                    eval('f.JaebonC_'+sn+'.value = JaebonValue');
                }
                else{ eval('f.JaebonC_'+sn+'.value = 0'); }
                //**************제본*************************************************************
            }
            //by lee 20130414 마스터추가
            else if(Product==95||Product==96||Product==97||Product==108||Product==109)   //마스타양식지3
            {
                //**************재단*************************************************************
                if(JaeDanKV!='')
                {
                    if(JaeDanKTxt=='2등분재단')     { BJaeDanValue = 0; }
                    else if(JaeDanKTxt=='3등분재단'){ BJaeDanValue = 0; }
                    else if(JaeDanKTxt=='4등분재단'){ BJaeDanValue = 5000; }
                    else if(JaeDanKTxt=='5등분재단'){ BJaeDanValue = 5000; }
                    else if(JaeDanKTxt=='6등분재단'){ BJaeDanValue = 5000; }
                    else{ BJaeDanValue = 8000; }
                    JaeDanValue = QuantityR*BJaeDanValue;
                    eval('f.JaeDanC_'+sn+'.value = JaeDanValue');
                }
                else{ eval('f.JaeDanC_'+sn+'.value = 0'); }
                //**************재단*************************************************************
                //**************제본*************************************************************
                if(JaebonKV!='')
                {
                    if(JaebonKTxt!='떡제본')
                    {  alert('떡제본만 가능합니다!');
                        eval('f.JaebonK_'+sn+'.selectedIndex = OptionSI(sn,"JaebonK",106)');
                    }
                    if(KindT.indexOf('16절')!=-1)
                    {
                        JaebonValue=15000*QuantityR;
                    }else{
                        JaebonValue=9000*QuantityR;
                    }
                    eval('f.JaebonC_'+sn+'.value = JaebonValue');
                }
                else{ eval('f.JaebonC_'+sn+'.value = 0'); }
                //**************제본*************************************************************
            }
            //by lee 20130414 마스터추가
            //by lee 20130414 마스터 98 추가
            else if(Product==59||Product==60)   //NCR1,NCR2
            {
                //**************재단*************************************************************
                if(JaeDanKV!='')
                {
                    eval('f.JaeDanC_'+sn+'.value = Math.ceil(TQunatity/BQunatity)*5000');
                }
                else{ eval('f.JaeDanC_'+sn+'.value = 0'); }
                //**************재단*************************************************************
            }
            else if(Product==98||Product==99||Product==100)   //NCR1,NCR2
            {
                //**************재단*************************************************************
                if(JaeDanKV!='')
                {
                    if(JaeDanKTxt=='2등분재단')     { BJaeDanValue = 0; }
                    else if(JaeDanKTxt=='3등분재단'){ BJaeDanValue = 0; }
                    else if(JaeDanKTxt=='4등분재단'){ BJaeDanValue = 5000; }
                    else if(JaeDanKTxt=='5등분재단'){ BJaeDanValue = 5000; }
                    else if(JaeDanKTxt=='6등분재단'){ BJaeDanValue = 5000; }
                    JaeDanValue = Math.ceil(QuantityR*100/BJAmount)*BJaeDanValue;
                    eval('f.JaeDanC_'+sn+'.value = JaeDanValue');
                }
                else{ eval('f.JaeDanC_'+sn+'.value = 0'); }
                //**************재단*************************************************************
            }
            else if(Product==62)   //초소량옵셋인쇄
            {
                //**************재단*************************************************************
                if(JaeDanKV!='')
                {
                    EstimateMSG = EstimateMSG + ', 재단'; EstimateCount = EstimateCount + 1;
                }
                else{ eval('f.JaeDanC_'+sn+'.value = 0'); }
                //**************재단*************************************************************
            }
            else if(Product==34) //합판문어발
            {
                //**************도무송************************************************************
                if(DomusongKV!='')
                {
                    if(DomusongKTxt=='목형+도무송')
                    { MockhungV = 40000;  alert('목형비는 변경될 수 있습니다!'); }
                    else
                    {
                        MockhungV = 0;
                        if(KindT.substring(0,3)=='16절'&&(DomusongKV<68||DomusongKV>76||DomusongKV==74||DomusongKV==75||DomusongKV==76))
                        {
                            alert('16절 문어발칼선을 선택하세요!');
                            eval('f.DomusongK_'+sn+'.selectedIndex = OptionSI(sn,"DomusongK",68)');
                            DomusongKTxt=='60*36.2-5개';
                        }
                        else if(KindT.substring(0,2)=='A4'&&(DomusongKV<78||DomusongKV>86))
                        {
                            alert('A4 문어발칼선을 선택하세요!');
                            eval('f.DomusongK_'+sn+'.selectedIndex = OptionSI(sn,"DomusongK",78)');
                            DomusongKTxt=='60*41.8-5개';
                        }
                    }
                    DomusongValue = 0;
                    eval('f.DomusongC_'+sn+'.value = DomusongValue');
                }
                else{ eval('f.DomusongC_'+sn+'.value = 0'); }
                //**************도무송************************************************************
            }
            if(JaeDanKV!='' & JubgyKV!=''){
                alert('재단과 접지는 동시에 선택하실 수 없습니다.(별도견적문의!)');
                eval('f.JubgyK_'+sn+'.selectedIndex = 0'); JubgyKV=''; JubgyKTxt='';
                eval('f.JubgyC_'+sn+'.value = 0');
            }
            if(JubgyKV!='' && (Product==38||Product==41||Product==45) && (PaperT.indexOf('180모조')!=-1||PaperT.indexOf('220모조')!=-1||PaperT.indexOf('260모조')!=-1||PaperT.indexOf('180스노우')!=-1||PaperT.indexOf('200스노우')!=-1||PaperT.indexOf('250스노우')!=-1||PaperT.indexOf('300스노우')!=-1||PaperT.indexOf('180아트')!=-1||PaperT.indexOf('200아트')!=-1||PaperT.indexOf('250아트')!=-1||PaperT.indexOf('300아트')!=-1) ){
                if(f.JubgyC_1.value != 0){
                    alert('180g 이상은 접지시 터짐 현상이 심하므로 오시 선택 후 접지 하시기 바랍니다. \n특히 접지면에 색상이 인쇄시 코팅 후 접 접지를 선택해주십시오.');
                }
            }
        }
        //**************교정지*************************************************************
        //if((Product==33||Product==35||Product==38||Product==41||Product==93)&&RevisionKV!='')
        //{
        //   //100아트합판전단지,80모조합판전단지,독판전단지,단색독판,80코트합판전단지
        //   if(QuantityR<100){ eval('f.RevisionC_'+sn+'.value = 40000'); }
        //   else{ eval('f.RevisionC_'+sn+'.value = 0'); }
        //}
        //else
        //{
        //   eval('f.Revision_'+sn+'.selectedIndex = 0');
        //   eval('f.RevisionC_'+sn+'.value = 0');
        //}
        //**************교정지*************************************************************
        //**************독판정매수*************************************************************
        if((Product==38||Product==39||Product==40||Product==41)&&AccuracyKV!='')
        {
            //독판전단지, 단색독판
            var AccuracyDouble = 0;
            if(FoilKV!=''){ AccuracyDouble = AccuracyDouble + 1 }
            if(MisingKV!=''){ AccuracyDouble = AccuracyDouble + 1 }
            if(OsiKV!=''){ AccuracyDouble = AccuracyDouble + 1 }
            if(TagongKV!=''){ AccuracyDouble = AccuracyDouble + 1 }
            if(HungAbKV!=''){ AccuracyDouble = AccuracyDouble + 1 }
            if(JaeDanKV!=''){ AccuracyDouble = AccuracyDouble + 1 }
            if(SpecialColorKV!=''){ AccuracyDouble = AccuracyDouble + 1 }
            if(CottingKV!=''){ AccuracyDouble = AccuracyDouble + 1 }
            if(DomusongKV!=''){ AccuracyDouble = AccuracyDouble + 1 }
            if(NumberingKV!=''){ AccuracyDouble = AccuracyDouble + 1 }
            if(JubgyKV!=''){ AccuracyDouble = AccuracyDouble + 1 }
            if(JaebonKV!=''){ AccuracyDouble = AccuracyDouble + 1 }
            if(AccuracyDouble<=2){ AccuracyDoubleValue = 1 }
            else if(AccuracyDouble==3){ AccuracyDoubleValue = 2 }
            else{ AccuracyDoubleValue = 3 }
            if(KindT.substring(0,2)=='2절'||KindT.substring(0,2)=='46')
            { eval('f.AccuracyC_'+sn+'.value = parseInt(AccuracyC_B[Paper])*AccuracyDoubleValue*2'); }
            else if(KindT.substring(0,3)=='32절'||KindT.substring(0,3)=='16절'||KindT.substring(0,2)=='8절'||KindT.substring(0,2)=='4절')
            { eval('f.AccuracyC_'+sn+'.value = parseInt(AccuracyC_B[Paper])*AccuracyDoubleValue'); }
            else if(KindT.indexOf('A')!=-1)
            { eval('f.AccuracyC_'+sn+'.value = parseInt(AccuracyC_A[Paper])*AccuracyDoubleValue'); }
            else if(KindT.substring(0,2)=='국전')
            { eval('f.AccuracyC_'+sn+'.value = parseInt(AccuracyC_A[Paper])*AccuracyDoubleValue*2'); }
            else if(KindT.indexOf('절')!=-1)
            { eval('f.AccuracyC_'+sn+'.value = parseInt(AccuracyC_B[Paper])*AccuracyDoubleValue'); }
            else
            { eval('f.AccuracyC_'+sn+'.value = parseInt(AccuracyC_A[Paper])*AccuracyDoubleValue'); }
        }
        else
        {
            eval('f.AccuracyC_'+sn+'.value = 0 ');
        }
        //**************독판정매수*************************************************************

        eval('f.VAccuracyC_'+sn+'.value = f.AccuracyC_'+sn+'.value ');
    }
    else if(Product=='')
    {
        eval('f.Cost_'+sn+'.value = 0');
        eval('f.PaperCost_'+sn+'.value = 0');
        eval('f.TotalCost_'+sn+'.value = 0');
        eval('f.WongoC_'+sn+'.value = 0');
        eval('f.RevisionC_'+sn+'.value = 0');
    }
    else
    {
        alert('다시 선택하십시요!'); SrcKind(sn); SrcPaper(sn,'',''); Cost(sn);
        parent.frames[1].ChangeQuantity(sn);
    }

    eval('f.AfterWorkC_'+sn+'.value = parseInt(DeComma(f.FoilC_'+sn+'.value)) + parseInt(DeComma(f.MisingC_'+sn+'.value)) + parseInt(DeComma(f.OsiC_'+sn+'.value)) + parseInt(DeComma(f.TagongC_'+sn+'.value)) + parseInt(DeComma(f.HungAbC_'+sn+'.value)) + parseInt(DeComma(f.JaeDanC_'+sn+'.value)) + parseInt(DeComma(f.SpecialColorC_'+sn+'.value)) + parseInt(DeComma(f.CottingC_'+sn+'.value)) + parseInt(DeComma(f.DomusongC_'+sn+'.value)) + parseInt(DeComma(f.NumberingC_'+sn+'.value)) + parseInt(DeComma(f.JubgyC_'+sn+'.value)) + parseInt(DeComma(f.JaebonC_'+sn+'.value))');

    if((Product==0||Product==1||Product==110||Product==2||Product==3||Product==4||Product==5||Product==8||Product==9||Product==10||Product==11||Product==12||Product==13||Product==14||Product==81||Product==105||Product==7||Product==120)&&FoilKV!=''&&FoilKTxt!='통박'&&Pcases!=1)
    {
        if(hostname.indexOf('mspg')!=-1){
            var AddAWC = -2000*(Pcases-1);
        }else{
            var AddAWC = -2500*(Pcases-1);
        }
        if(FoilKTxt.indexOf('양면')!=-1){ AddAWC = AddAWC*2; }
        eval('f.AddAWK_'+sn+'.selectedIndex = OptionSI(sn,"AddAWK",113)');
        eval('f.AddAWC_'+sn+'.value = Comma(AddAWC)');
    }
    else if((Product==0||Product==1||Product==110||Product==2||Product==3||Product==4||Product==5||Product==8||Product==9||Product==10||Product==11||Product==12||Product==13||Product==14||Product==81||Product==105||Product==7||Product==120)&&FoilKV!=''&&FoilKTxt!='통박'&&Pcases==1)
    {
        var AddAWC = 0;
        eval('f.AddAWK_'+sn+'.selectedIndex = 0');
        eval('f.AddAWC_'+sn+'.value = 0');
    }
    else if((Product==0||Product==1||Product==110||Product==2||Product==3||Product==4||Product==5||Product==8||Product==9||Product==10||Product==11||Product==12||Product==13||Product==14||Product==81||Product==105||Product==7||Product==120)&&FoilKV=='')
    {
        var AddAWC = 0;
        eval('f.AddAWK_'+sn+'.selectedIndex = 0');
        eval('f.AddAWC_'+sn+'.value = 0');
    }

    eval('var TWMoney = DeComma(f.AddAWC_'+sn+'.value)');
    if((Product==0||Product==1||Product==110||Product==2||Product==3||Product==4||Product==5||Product==8||Product==9||Product==10||Product==11||Product==12||Product==13||Product==14||Product==81||Product==105||Product==7||Product==120)&&HungAbKV!=''&&HungAbKTxt!='통형압'&&Pcases!=1)
    {
        if(TWMoney == 0 || TWMoney ==''){
            var AddAWC = -3000*(Pcases-1);
            eval('f.AddAWK_'+sn+'.selectedIndex = OptionSI(sn,"AddAWK",113)');
            eval('f.AddAWC_'+sn+'.value = Comma(AddAWC)');
        }else{
            var AddAWC = (TWMoney * 1) + (-3000*(Pcases-1));
            eval('f.AddAWK_'+sn+'.selectedIndex = OptionSI(sn,"AddAWK",113)');
            eval('f.AddAWC_'+sn+'.value = Comma(AddAWC)');
        }
    }
    else if((Product==0||Product==1||Product==110||Product==2||Product==3||Product==4||Product==5||Product==8||Product==9||Product==10||Product==11||Product==12||Product==13||Product==14||Product==81||Product==105||Product==7||Product==120)&&HungAbKV!=''&&HungAbKTxt!='통형압'&&Pcases==1)
    {
        if(TWMoney == 0 || TWMoney ==''){
            var AddAWC = 0;
            eval('f.AddAWK_'+sn+'.selectedIndex = 0');
            eval('f.AddAWC_'+sn+'.value = 0');
        }
    }
    else if((Product==0||Product==1||Product==110||Product==2||Product==3||Product==4||Product==5||Product==8||Product==9||Product==10||Product==11||Product==12||Product==13||Product==14||Product==81||Product==105||Product==7||Product==120)&&HungAbKV=='')
    {
        if(TWMoney == 0 || TWMoney ==''){
            var AddAWC = 0;
            eval('f.AddAWK_'+sn+'.selectedIndex = 0');
            eval('f.AddAWC_'+sn+'.value = 0');
        }
    }

    eval('f.Cost_'+sn+'.value = Comma(DeComma(f.Cost_'+sn+'.value))');
    eval('f.PaperCost_'+sn+'.value = Comma(DeComma(f.PaperCost_'+sn+'.value))');
    eval('f.JaepanC_V_'+sn+'.value = Comma(DeComma(f.JaepanC_V_'+sn+'.value))');
    eval('f.AfterWorkC_'+sn+'.value = Comma(DeComma(f.AfterWorkC_'+sn+'.value))');
    eval('f.VAccuracyC_'+sn+'.value = Comma(DeComma(f.VAccuracyC_'+sn+'.value))');
    eval('f.EtcC_'+sn+'.value = Comma(DeComma(f.AddAWC_'+sn+'.value))');
    eval('f.TotalCost_'+sn+'.value = ( parseInt(DeComma(f.Cost_'+sn+'.value)) + parseInt(DeComma(f.PaperCost_'+sn+'.value)) + parseInt(DeComma(f.JaepanC_'+sn+'.value)) + parseInt(DeComma(f.AfterWorkC_'+sn+'.value)) + parseInt(DeComma(f.AccuracyC_'+sn+'.value)) )*Pcases + parseInt(DeComma(f.WongoC_'+sn+'.value)) + parseInt(DeComma(f.RevisionC_'+sn+'.value)) + parseInt(DeComma(f.EtcC_'+sn+'.value))');

    eval('f.TotalCost_'+sn+'.value = Comma(DeComma(f.TotalCost_'+sn+'.value))');
    eval('f.EstimateCount_'+sn+'.value = EstimateCount');
    if(EstimateCount!=0)
    {
        eval('f.ProcessGo_'+sn+'.checked = true');
        EstimateMSG = EstimateMSG.substring(1,EstimateMSG.length) + ' 견적은 다시 받으시길 바랍니다!';
        alert(EstimateMSG);
    }
    else{ eval('f.ProcessGo_'+sn+'.checked = false'); }

    Check_Product(sn);

}
function change_id2(sn,num)
{
    var f = parent.frames[1].document.OrderForm;
    var white = 'white';
    var gray = '#CCCCCC';
    eval('var myindex = f.Product_'+sn+'.selectedIndex');
    eval('Product = f.Product_'+sn+'.options[myindex].value');

    eval('var myindex2 = f.Kind_'+sn+'.selectedIndex');
    eval('Kind = f.Kind_'+sn+'.options[myindex2].value');
    eval('KindT = f.Kind_'+sn+'.options[myindex2].text');

    eval('f.MisingK_'+sn+'.disabled = true');
    eval('f.MisingK_'+sn+'.style.background = gray');
    eval('f.MisingK_'+sn+'.selectedIndex = 0');
    eval('f.MisingC_'+sn+'.disabled = true');
    eval('f.MisingC_'+sn+'.style.background = gray');
    eval('f.MisingC_'+sn+'.value = 0');
    eval('f.OsiK_'+sn+'.disabled = true');
    eval('f.OsiK_'+sn+'.style.background = gray');
    eval('f.OsiK_'+sn+'.selectedIndex = 0');
    eval('f.OsiC_'+sn+'.disabled = true');
    eval('f.OsiC_'+sn+'.style.background = gray');
    eval('f.OsiC_'+sn+'.value = 0');
    eval('f.TagongK_'+sn+'.disabled = true');
    eval('f.TagongK_'+sn+'.style.background = gray');
    eval('f.TagongK_'+sn+'.selectedIndex = 0');
    eval('f.TagongC_'+sn+'.disabled = true');
    eval('f.TagongC_'+sn+'.style.background = gray');
    eval('f.TagongC_'+sn+'.value = 0');
    eval('f.DomusongK_'+sn+'.disabled = true');
    eval('f.DomusongK_'+sn+'.style.background = gray');
    eval('f.DomusongK_'+sn+'.selectedIndex = 0');
    eval('f.DomusongC_'+sn+'.disabled = true');
    eval('f.DomusongC_'+sn+'.style.background = gray');
    eval('f.DomusongC_'+sn+'.value = 0');
    eval('f.CottingK_'+sn+'.disabled = true');
    eval('f.CottingK_'+sn+'.style.background = gray');
    eval('f.CottingK_'+sn+'.selectedIndex = 0');
    eval('f.CottingC_'+sn+'.disabled = true');
    eval('f.CottingC_'+sn+'.style.background = gray');
    eval('f.CottingC_'+sn+'.value = 0');
    eval('f.JubgyK_'+sn+'.disabled = true');
    eval('f.JubgyK_'+sn+'.style.background = gray');
    eval('f.JubgyK_'+sn+'.selectedIndex = 0');
    eval('f.JubgyC_'+sn+'.disabled = true');
    eval('f.JubgyC_'+sn+'.style.background = gray');
    eval('f.JubgyC_'+sn+'.value = 0');
    eval('f.JaebonK_'+sn+'.disabled = true');
    eval('f.JaebonK_'+sn+'.style.background = gray');
    eval('f.JaebonK_'+sn+'.selectedIndex = 0');
    eval('f.JaebonC_'+sn+'.disabled = true');
    eval('f.JaebonC_'+sn+'.style.background = gray');
    eval('f.JaebonC_'+sn+'.value = 0');
    eval('f.FoilK_'+sn+'.disabled = true');
    eval('f.FoilK_'+sn+'.style.background = gray');
    eval('f.FoilK_'+sn+'.selectedIndex = 0');
    eval('f.FoilC_'+sn+'.disabled = true');
    eval('f.FoilC_'+sn+'.style.background = gray');
    eval('f.FoilC_'+sn+'.value = 0');
    eval('f.HungAbK_'+sn+'.disabled = true');
    eval('f.HungAbK_'+sn+'.style.background = gray');
    eval('f.HungAbK_'+sn+'.selectedIndex = 0');
    eval('f.HungAbC_'+sn+'.disabled = true');
    eval('f.HungAbC_'+sn+'.style.background = gray');
    eval('f.HungAbC_'+sn+'.value = 0');
    eval('f.JaeDanK_'+sn+'.disabled = true');
    eval('f.JaeDanK_'+sn+'.style.background = gray');
    eval('f.JaeDanK_'+sn+'.selectedIndex = 0');
    eval('f.JaeDanC_'+sn+'.disabled = true');
    eval('f.JaeDanC_'+sn+'.style.background = gray');
    eval('f.JaeDanC_'+sn+'.value = 0');
    eval('f.SpecialColorK_'+sn+'.disabled = true');
    eval('f.SpecialColorK_'+sn+'.style.background = gray');
    eval('f.SpecialColorK_'+sn+'.selectedIndex = 0');
    eval('f.SpecialColorC_'+sn+'.disabled = true');
    eval('f.SpecialColorC_'+sn+'.style.background = gray');
    eval('f.SpecialColorC_'+sn+'.value = 0');
    eval('f.NumberingK_'+sn+'.disabled = true');
    eval('f.NumberingK_'+sn+'.style.background = gray');
    eval('f.NumberingK_'+sn+'.selectedIndex = 0');
    eval('f.NumberingC_'+sn+'.disabled = true');
    eval('f.NumberingC_'+sn+'.style.background = gray');
    eval('f.NumberingC_'+sn+'.value = 0');
    //by lee 20130414 마스타 98 추가
    if(Product==33||Product==35||Product==38||Product==39||Product==40||Product==41||Product==59||Product==60||Product==61||Product==93)
    { //100아트합판전단지,80모조합판전단지,독판전단지,독판문고리,독판문어발,단색독판,NCR1,NCR2,NCR3,80코트합판전단지
        eval('f.JaepanK_'+sn+'.disabled = false');
        eval('f.JaepanK_'+sn+'.style.background = white');
        eval('f.JaepanK_'+sn+'.selectedIndex = 0');
        eval('f.JaepanC_'+sn+'.disabled = false');
        eval('f.JaepanC_'+sn+'.style.background = white');
        eval('f.JaepanC_'+sn+'.value = 0');
    }
    else
    {
        eval('f.JaepanK_'+sn+'.disabled = true');
        eval('f.JaepanK_'+sn+'.style.background = gray');
        eval('f.JaepanK_'+sn+'.selectedIndex = 0');
        eval('f.JaepanC_'+sn+'.disabled = true');
        eval('f.JaepanC_'+sn+'.style.background = gray');
        eval('f.JaepanC_'+sn+'.value = 0');
    }
    eval('f.AccuracyK_'+sn+'.disabled = true');
    eval('f.AccuracyK_'+sn+'.style.background = gray');
    eval('f.AccuracyK_'+sn+'.selectedIndex = 0');
    eval('f.AccuracyC_'+sn+'.disabled = true');
    eval('f.AccuracyC_'+sn+'.style.background = gray');
    eval('f.AccuracyC_'+sn+'.value = 0');

    eval('f.changeid2_'+sn+'[0].checked = true');

    if(num==1||Product==39||Product==40)
    {
        //문어발독판, 문고리독판
        eval('f.changeid2_'+sn+'[1].checked = true');

        if(Product==0||Product==1||Product==110||Product==2||Product==3||Product==4||Product==5||Product==7||Product==120)
        {
            //일반명함, 고품격명함, 당일오전판명함, 복권, 수입지명함-300장명함, 수입지명함-200장명함, 수입지귀돌이명함
            eval('f.MisingK_'+sn+'.disabled = false');
            eval('f.MisingK_'+sn+'.style.background = white');
            eval('f.MisingC_'+sn+'.disabled = false');
            eval('f.MisingC_'+sn+'.style.background = white');
            eval('f.OsiK_'+sn+'.disabled = false');
            eval('f.OsiK_'+sn+'.style.background = white');
            eval('f.OsiC_'+sn+'.disabled = false');
            eval('f.OsiC_'+sn+'.style.background = white');
            eval('f.TagongK_'+sn+'.disabled = false');
            eval('f.TagongK_'+sn+'.style.background = white');
            eval('f.TagongC_'+sn+'.disabled = false');
            eval('f.TagongC_'+sn+'.style.background = white');
            eval('f.FoilK_'+sn+'.disabled = false');
            eval('f.FoilK_'+sn+'.style.background = white');
            eval('f.FoilC_'+sn+'.disabled = false');
            eval('f.FoilC_'+sn+'.style.background = white');
            eval('f.HungAbK_'+sn+'.disabled = false');
            eval('f.HungAbK_'+sn+'.style.background = white');
            eval('f.HungAbC_'+sn+'.disabled = false');
            eval('f.HungAbC_'+sn+'.style.background = white');
            eval('f.JaeDanK_'+sn+'.disabled = false');
            eval('f.JaeDanK_'+sn+'.style.background = white');
            eval('f.JaeDanC_'+sn+'.disabled = false');
            eval('f.JaeDanC_'+sn+'.style.background = white');
            eval('f.DomusongK_'+sn+'.disabled = false');
            eval('f.DomusongK_'+sn+'.style.background = white');
            eval('f.DomusongC_'+sn+'.disabled = false');
            eval('f.DomusongC_'+sn+'.style.background = white');
        }
        else if(Product==81)
        {
            //일반명함, 고품격명함, 당일오전판명함, 복권, 수입지명함-300장명함, 수입지명함-200장명함, 수입지귀돌이명함
            eval('f.MisingK_'+sn+'.disabled = false');
            eval('f.MisingK_'+sn+'.style.background = white');
            eval('f.MisingC_'+sn+'.disabled = false');
            eval('f.MisingC_'+sn+'.style.background = white');
            eval('f.OsiK_'+sn+'.disabled = false');
            eval('f.OsiK_'+sn+'.style.background = white');
            eval('f.OsiC_'+sn+'.disabled = false');
            eval('f.OsiC_'+sn+'.style.background = white');
            eval('f.TagongK_'+sn+'.disabled = false');
            eval('f.TagongK_'+sn+'.style.background = white');
            eval('f.TagongC_'+sn+'.disabled = false');
            eval('f.TagongC_'+sn+'.style.background = white');
            eval('f.FoilK_'+sn+'.disabled = false');
            eval('f.FoilK_'+sn+'.style.background = white');
            eval('f.FoilC_'+sn+'.disabled = false');
            eval('f.FoilC_'+sn+'.style.background = white');
            eval('f.HungAbK_'+sn+'.disabled = false');
            eval('f.HungAbK_'+sn+'.style.background = white');
            eval('f.HungAbC_'+sn+'.disabled = false');
            eval('f.HungAbC_'+sn+'.style.background = white');
            eval('f.JaeDanK_'+sn+'.disabled = false');
            eval('f.JaeDanK_'+sn+'.style.background = white');
            eval('f.JaeDanC_'+sn+'.disabled = false');
            eval('f.JaeDanC_'+sn+'.style.background = white');
            eval('f.DomusongK_'+sn+'.disabled = true');
            eval('f.DomusongK_'+sn+'.selectedIndex = 0');
            eval('f.DomusongK_'+sn+'.style.background = gray');
            eval('f.DomusongC_'+sn+'.disabled = true');
            eval('f.DomusongC_'+sn+'.style.background = gray');
            eval('f.DomusongC_'+sn+'.value = 0');
        }
        else if(Product==105)
        {
            //부분에폭시
            eval('f.MisingK_'+sn+'.disabled = false');
            eval('f.MisingK_'+sn+'.style.background = white');
            eval('f.MisingC_'+sn+'.disabled = false');
            eval('f.MisingC_'+sn+'.style.background = white');
            eval('f.OsiK_'+sn+'.disabled = false');
            eval('f.OsiK_'+sn+'.style.background = white');
            eval('f.OsiC_'+sn+'.disabled = false');
            eval('f.OsiC_'+sn+'.style.background = white');
            eval('f.TagongK_'+sn+'.disabled = false');
            eval('f.TagongK_'+sn+'.style.background = white');
            eval('f.TagongC_'+sn+'.disabled = false');
            eval('f.TagongC_'+sn+'.style.background = white');
            eval('f.FoilK_'+sn+'.disabled = true');
            eval('f.FoilK_'+sn+'.style.background = gray');
            eval('f.FoilC_'+sn+'.disabled = true');
            eval('f.FoilC_'+sn+'.style.background = gray');
            eval('f.HungAbK_'+sn+'.disabled = true');
            eval('f.HungAbK_'+sn+'.style.background = gray');
            eval('f.HungAbC_'+sn+'.disabled = true');
            eval('f.HungAbC_'+sn+'.style.background = gray');
            eval('f.JaeDanK_'+sn+'.disabled = false');
            eval('f.JaeDanK_'+sn+'.style.background = white');
            eval('f.JaeDanC_'+sn+'.disabled = false');
            eval('f.JaeDanC_'+sn+'.style.background = white');
            eval('f.DomusongK_'+sn+'.disabled = false');
            eval('f.DomusongK_'+sn+'.style.background = white');
            eval('f.DomusongC_'+sn+'.disabled = false');
            eval('f.DomusongC_'+sn+'.style.background = white');
        }
        else if(Product==33||Product==35||Product==36||Product==93) //100아트,80모조,150아트합판전단지,80코트지합판지
        {
            eval('f.MisingK_'+sn+'.disabled = false');
            eval('f.MisingK_'+sn+'.style.background = white');
            eval('f.MisingC_'+sn+'.disabled = false');
            eval('f.MisingC_'+sn+'.style.background = white');
            eval('f.TagongK_'+sn+'.disabled = false');
            eval('f.TagongK_'+sn+'.style.background = white');
            eval('f.TagongC_'+sn+'.disabled = false');
            eval('f.TagongC_'+sn+'.style.background = white');
            eval('f.JaeDanK_'+sn+'.disabled = false');
            eval('f.JaeDanK_'+sn+'.style.background = white');
            eval('f.JaeDanC_'+sn+'.disabled = false');
            eval('f.JaeDanC_'+sn+'.style.background = white');
            eval('f.JubgyK_'+sn+'.disabled = false');
            eval('f.JubgyK_'+sn+'.style.background = white');
            eval('f.JubgyC_'+sn+'.disabled = false');
            eval('f.JubgyC_'+sn+'.style.background = white');
            eval('f.JaebonK_'+sn+'.disabled = false');
            eval('f.JaebonK_'+sn+'.style.background = white');
            eval('f.JaebonC_'+sn+'.disabled = false');
            eval('f.JaebonC_'+sn+'.style.background = white');
            if(Product==33||Product==93) //100아트합판전단지,80코트합판전단지
            {
                eval('f.CottingK_'+sn+'.disabled = false');
                eval('f.CottingK_'+sn+'.style.background = white');
                eval('f.CottingC_'+sn+'.disabled = false');
                eval('f.CottingC_'+sn+'.style.background = white');
            }
            if(Product==35||Product==36||Product==93) //80모조합판전단지,150아트합판전단지,80코트지합판지
            {
                eval('f.OsiK_'+sn+'.disabled = false');
                eval('f.OsiK_'+sn+'.style.background = white');
                eval('f.OsiC_'+sn+'.disabled = false');
                eval('f.OsiC_'+sn+'.style.background = white');
            }
        }
        else if(Product==37) //메뉴판합판
        {
            eval('f.OsiK_'+sn+'.disabled = false');
            eval('f.OsiK_'+sn+'.style.background = white');
            eval('f.OsiC_'+sn+'.disabled = false');
            eval('f.OsiC_'+sn+'.style.background = white');
            eval('f.TagongK_'+sn+'.disabled = false');
            eval('f.TagongK_'+sn+'.style.background = white');
            eval('f.TagongC_'+sn+'.disabled = false');
            eval('f.TagongC_'+sn+'.style.background = white');
            eval('f.CottingK_'+sn+'.disabled = false');
            eval('f.CottingK_'+sn+'.style.background = white');
            eval('f.CottingC_'+sn+'.disabled = false');
            eval('f.CottingC_'+sn+'.style.background = white');
            eval('f.JubgyK_'+sn+'.disabled = false');
            eval('f.JubgyK_'+sn+'.style.background = white');
            eval('f.JubgyC_'+sn+'.disabled = false');
            eval('f.JubgyC_'+sn+'.style.background = white');
        }
        else if(Product==24||Product==25||Product==26||Product==27||Product==28||Product==29||Product==30||Product==31||Product==32||Product==43||Product==45||Product==47||Product==71||Product==72||Product==73||Product==74||Product==75||Product==76||Product==77||Product==78) //정사각귀돌이-AR,직사각귀돌이-ARR,원형도무송-AC,타원형도무송-AE,반원형도무송-AS,하트형도무송-AH,비디오스티커,열쇠스티커,CD카세트스티커,중철카다로그,리플렛,홀더
        {
            eval('f.CottingK_'+sn+'.disabled = false');
            eval('f.CottingK_'+sn+'.style.background = white');
            eval('f.CottingC_'+sn+'.disabled = false');
            eval('f.CottingC_'+sn+'.style.background = white');
        }
        else if(Product==48||Product==49||Product==50||Product==51||Product==52||Product==53||Product==101||Product==102||Product==103||Product==104||Product==112||Product==113||Product==114) //칼라대봉투합판,칼라소봉투합판,봉투세트합판,칼라대봉투독판,칼라소봉투독판,칼라봉투세트독판
        {
            eval('f.DomusongK_'+sn+'.disabled = false');
            eval('f.DomusongK_'+sn+'.style.background = white');
            eval('f.DomusongC_'+sn+'.disabled = false');
            eval('f.DomusongC_'+sn+'.style.background = white');
            eval('f.JaebonK_'+sn+'.disabled = false');
            eval('f.JaebonK_'+sn+'.style.background = white');
            eval('f.JaebonC_'+sn+'.disabled = false');
            eval('f.JaebonC_'+sn+'.style.background = white');
            eval('f.TagongK_'+sn+'.disabled = false');
            eval('f.TagongK_'+sn+'.style.background = white');
            eval('f.TagongC_'+sn+'.disabled = false');
            eval('f.TagongC_'+sn+'.style.background = white');
        }
        else if(Product==54||Product==55||Product==111) //마스타대봉투,마스타소봉투
        {
            eval('f.JaepanK_'+sn+'.disabled = false');
            eval('f.JaepanK_'+sn+'.style.background = white');
            eval('f.JaepanC_'+sn+'.disabled = false');
            eval('f.JaepanC_'+sn+'.style.background = white');
            eval('f.DomusongK_'+sn+'.disabled = false');
            eval('f.DomusongK_'+sn+'.style.background = white');
            eval('f.DomusongC_'+sn+'.disabled = false');
            eval('f.DomusongC_'+sn+'.style.background = white');
            eval('f.JaebonK_'+sn+'.disabled = false');
            eval('f.JaebonK_'+sn+'.style.background = white');
            eval('f.JaebonC_'+sn+'.disabled = false');
            eval('f.JaebonC_'+sn+'.style.background = white');
            eval('f.TagongK_'+sn+'.disabled = false');
            eval('f.TagongK_'+sn+'.style.background = white');
            eval('f.TagongC_'+sn+'.disabled = false');
            eval('f.TagongC_'+sn+'.style.background = white');
        }
        //by lee 20130414 마스타 추가
        else if(Product==56||Product==57||Product==58||Product==95||Product==96||Product==97||Product==106||Product==107||Product==108||Product==109)
        {
            //마스타양식지1,2,3
            eval('f.SpecialColorK_'+sn+'.disabled = false');
            eval('f.SpecialColorK_'+sn+'.style.background = white');
            eval('f.SpecialColorC_'+sn+'.disabled = false');
            eval('f.SpecialColorC_'+sn+'.style.background = white');
            eval('f.JaeDanK_'+sn+'.disabled = false');
            eval('f.JaeDanK_'+sn+'.style.background = white');
            eval('f.JaeDanC_'+sn+'.disabled = false');
            eval('f.JaeDanC_'+sn+'.style.background = white');
            eval('f.JaebonK_'+sn+'.disabled = false');
            eval('f.JaebonK_'+sn+'.style.background = white');
            eval('f.JaebonC_'+sn+'.disabled = false');
            eval('f.JaebonC_'+sn+'.style.background = white');
            eval('f.NumberingK_'+sn+'.disabled = false');
            eval('f.NumberingK_'+sn+'.style.background = white');
            eval('f.NumberingC_'+sn+'.disabled = false');
            eval('f.NumberingC_'+sn+'.style.background = white');
            //eval('f.JaepanK_'+sn+'.disabled = false');
            //eval('f.JaepanK_'+sn+'.style.background = white');
            //eval('f.JaepanC_'+sn+'.disabled = false');
            //eval('f.JaepanC_'+sn+'.style.background = white');
        }
        //by lee 20130414 마스타 98 추가
        else if(Product==98||Product==99||Product==100)
        {
            //NCR1,2,3
            eval('f.JaeDanK_'+sn+'.disabled = false');
            eval('f.JaeDanK_'+sn+'.style.background = white');
            eval('f.JaeDanC_'+sn+'.disabled = false');
            eval('f.JaeDanC_'+sn+'.style.background = white');
            eval('f.JaebonK_'+sn+'.disabled = false');
            eval('f.JaebonK_'+sn+'.style.background = white');
            eval('f.JaebonC_'+sn+'.disabled = false');
            eval('f.JaebonC_'+sn+'.style.background = white');
        }
        else if(Product==59||Product==60||Product==61)
        {
            //NCR1,2,3
            eval('f.JaeDanK_'+sn+'.disabled = false');
            eval('f.JaeDanK_'+sn+'.style.background = white');
            eval('f.JaeDanC_'+sn+'.disabled = false');
            eval('f.JaeDanC_'+sn+'.style.background = white');
            eval('f.JaebonK_'+sn+'.disabled = false');
            eval('f.JaebonK_'+sn+'.style.background = white');
            eval('f.JaebonC_'+sn+'.disabled = false');
            eval('f.JaebonC_'+sn+'.style.background = white');
            eval('f.JaepanK_'+sn+'.disabled = false');
            eval('f.JaepanK_'+sn+'.style.background = white');
            eval('f.JaepanC_'+sn+'.disabled = false');
            eval('f.JaepanC_'+sn+'.style.background = white');
        }
        else if(Product==62)
        {
            //초소량옵셋인쇄
            eval('f.JaeDanK_'+sn+'.disabled = false');
            eval('f.JaeDanK_'+sn+'.style.background = white');
            eval('f.JaeDanC_'+sn+'.disabled = false');
            eval('f.JaeDanC_'+sn+'.style.background = white');
            eval('f.CottingK_'+sn+'.disabled = false');
            eval('f.CottingK_'+sn+'.style.background = white');
            eval('f.CottingC_'+sn+'.disabled = false');
            eval('f.CottingC_'+sn+'.style.background = white');
        }
        else if(((Product==19||Product==20||Product==21||Product==22||Product==79||Product==94)&&KindT.indexOf('도무송')!=-1)||Product==34) //일반스티커,강접스티커,유포지스티커,은데드롱스티커,문어발합판,80모조스티커
        {
            eval('f.DomusongK_'+sn+'.disabled = false');
            eval('f.DomusongK_'+sn+'.style.background = white');
            eval('f.DomusongC_'+sn+'.disabled = false');
            eval('f.DomusongC_'+sn+'.style.background = white');
        }
        else if(Product==8||Product==9||Product==10||Product==11||Product==12||Product==13||Product==14)
        {
            //상품권-500장,상품권-600장,상품권-400장-1,상품권-400장-2,초대청첩장-500장,초대청첩장-300장,초대청첩장-200장,
            eval('f.MisingK_'+sn+'.disabled = false');
            eval('f.MisingK_'+sn+'.style.background = white');
            eval('f.MisingC_'+sn+'.disabled = false');
            eval('f.MisingC_'+sn+'.style.background = white');
            eval('f.OsiK_'+sn+'.disabled = false');
            eval('f.OsiK_'+sn+'.style.background = white');
            eval('f.OsiC_'+sn+'.disabled = false');
            eval('f.OsiC_'+sn+'.style.background = white');
            eval('f.TagongK_'+sn+'.disabled = false');
            eval('f.TagongK_'+sn+'.style.background = white');
            eval('f.TagongC_'+sn+'.disabled = false');
            eval('f.TagongC_'+sn+'.style.background = white');
            eval('f.HungAbK_'+sn+'.disabled = false');
            eval('f.HungAbK_'+sn+'.style.background = white');
            eval('f.HungAbC_'+sn+'.disabled = false');
            eval('f.HungAbC_'+sn+'.style.background = white');
            eval('f.FoilK_'+sn+'.disabled = false');
            eval('f.FoilK_'+sn+'.style.background = white');
            eval('f.FoilC_'+sn+'.disabled = false');
            eval('f.FoilC_'+sn+'.style.background = white');
        }
        else if(Product==38||Product==39||Product==40||Product==41)
        {
            //독판전단,문어발독판전단,문고리독판전단,단색독판
            eval('f.MisingK_'+sn+'.disabled = false');
            eval('f.MisingK_'+sn+'.style.background = white');
            eval('f.MisingC_'+sn+'.disabled = false');
            eval('f.MisingC_'+sn+'.style.background = white');
            eval('f.OsiK_'+sn+'.disabled = false');
            eval('f.OsiK_'+sn+'.style.background = white');
            eval('f.OsiC_'+sn+'.disabled = false');
            eval('f.OsiC_'+sn+'.style.background = white');
            eval('f.TagongK_'+sn+'.disabled = false');
            eval('f.TagongK_'+sn+'.style.background = white');
            eval('f.TagongC_'+sn+'.disabled = false');
            eval('f.TagongC_'+sn+'.style.background = white');
            eval('f.DomusongK_'+sn+'.disabled = false');
            eval('f.DomusongK_'+sn+'.style.background = white');
            eval('f.DomusongC_'+sn+'.disabled = false');
            eval('f.DomusongC_'+sn+'.style.background = white');
            eval('f.CottingK_'+sn+'.disabled = false');
            eval('f.CottingK_'+sn+'.style.background = white');
            eval('f.CottingC_'+sn+'.disabled = false');
            eval('f.CottingC_'+sn+'.style.background = white');
            eval('f.JubgyK_'+sn+'.disabled = false');
            eval('f.JubgyK_'+sn+'.style.background = white');
            eval('f.JubgyC_'+sn+'.disabled = false');
            eval('f.JubgyC_'+sn+'.style.background = white');
            eval('f.JaebonK_'+sn+'.disabled = false');
            eval('f.JaebonK_'+sn+'.style.background = white');
            eval('f.JaebonC_'+sn+'.disabled = false');
            eval('f.JaebonC_'+sn+'.style.background = white');
            eval('f.FoilK_'+sn+'.disabled = false');
            eval('f.FoilK_'+sn+'.style.background = white');
            eval('f.FoilC_'+sn+'.disabled = false');
            eval('f.FoilC_'+sn+'.style.background = white');
            eval('f.HungAbK_'+sn+'.disabled = false');
            eval('f.HungAbK_'+sn+'.style.background = white');
            eval('f.HungAbC_'+sn+'.disabled = false');
            eval('f.HungAbC_'+sn+'.style.background = white');
            eval('f.JaeDanK_'+sn+'.disabled = false');
            eval('f.JaeDanK_'+sn+'.style.background = white');
            eval('f.JaeDanC_'+sn+'.disabled = false');
            eval('f.JaeDanC_'+sn+'.style.background = white');

            eval('f.SpecialColorK_'+sn+'.disabled = false');
            eval('f.SpecialColorK_'+sn+'.style.background = white');
            eval('f.SpecialColorC_'+sn+'.disabled = false');
            eval('f.SpecialColorC_'+sn+'.style.background = white');
            eval('f.NumberingK_'+sn+'.disabled = false');
            eval('f.NumberingK_'+sn+'.style.background = white');
            eval('f.NumberingC_'+sn+'.disabled = false');
            eval('f.NumberingC_'+sn+'.style.background = white');
            eval('f.JaepanK_'+sn+'.disabled = false');
            eval('f.JaepanK_'+sn+'.style.background = white');
            eval('f.JaepanC_'+sn+'.disabled = false');
            eval('f.JaepanC_'+sn+'.style.background = white');
            eval('f.AccuracyK_'+sn+'.disabled = false');
            eval('f.AccuracyK_'+sn+'.style.background = white');
            eval('f.AccuracyC_'+sn+'.disabled = false');
            eval('f.AccuracyC_'+sn+'.style.background = white');

        }
        else if(Product==91)
        {
            //디지탈인쇄(후가공1)
            eval('f.NumberingK_'+sn+'.disabled = false');
            eval('f.NumberingK_'+sn+'.style.background = white');
            eval('f.NumberingC_'+sn+'.disabled = false');
            eval('f.NumberingC_'+sn+'.style.background = white');

        }
        else if(Product==92)
        {
            //디지탈인쇄(후가공2)
            //eval('f.CottingK_'+sn+'.disabled = false');
            //eval('f.CottingK_'+sn+'.style.background = white');
            //eval('f.CottingC_'+sn+'.disabled = false');
            //eval('f.CottingC_'+sn+'.style.background = white');
            eval('f.JubgyK_'+sn+'.disabled = false');
            eval('f.JubgyK_'+sn+'.style.background = white');
            eval('f.JubgyC_'+sn+'.disabled = false');
            eval('f.JubgyC_'+sn+'.style.background = white');
            eval('f.JaebonK_'+sn+'.disabled = false');
            eval('f.JaebonK_'+sn+'.style.background = white');
            eval('f.JaebonC_'+sn+'.disabled = false');
            eval('f.JaebonC_'+sn+'.style.background = white');

        }
        else
        { eval('f.changeid2_'+sn+'[0].checked = true'); }
    }
    //by lee 20131028 울트라화이트 오시 안되게
    if(Product==5 && KindT.indexOf('울트라화이트')!=-1)
    {
        eval('f.OsiK_'+sn+'.disabled = true');
        eval('f.OsiK_'+sn+'.style.background = gray');
        eval('f.OsiK_'+sn+'.selectedIndex = 0');
        eval('f.OsiC_'+sn+'.disabled = true');
        eval('f.OsiC_'+sn+'.style.background = gray');
        eval('f.OsiC_'+sn+'.value = 0');
    }

}

function Comma(Cost)
{
    var Rz = '';
    var Rs = '';
    var Rc = 0;
    Cost = parseInt(Cost);
    var Rh = (Cost < 0) ? 1 : 0;Cost += '';
    var CostLength = Cost.length;
    for(i = CostLength; i >= 0 ; i--)
    {
        Rz = Cost.charAt(i);
        Rs = Rz + Rs;
        if(Rc % 3 == 0 && i > Rh && i < CostLength)
        {
            Rs = ',' + Rs;
        }
        Rc++;
    }
    return (Rs);
}

function DeComma(Cost)
{
    var Rz = '';
    var Rs = '';
    if(Cost=='') Cost = 0;
    var CostLength = Cost.length;
    for(i = CostLength; i >= 0 ; i--)
    {
        Rz = Cost.charAt(i);
        if(Rz != ',')
        {
            Rs = Rz + Rs;
        }
    }
    if(Rs=='') Rs = 0;
    return (Rs);
}
function OptionSI(sn,SelectBox,SelectValue)
{
    var f = parent.frames[1].document.OrderForm;
    var SelectIndex = 0;
    eval('SelectBoxObj = f.'+SelectBox+'_'+sn+'');
    for( i = 0; i < SelectBoxObj.length ; i++ )
    {
        if(SelectValue==SelectBoxObj.options[i].value){ SelectIndex = i; }
    }
    return (SelectIndex);
}
function Check_Product(sn)
{
    var f = parent.frames[1].document.OrderForm;
    eval('var TodayPrint = f.TodayPrint_'+sn+'.checked');
    eval('var AfterWorkCheck = f.changeid2_'+sn+'[0].checked');
    eval('var myindex6 = f.SizeKind_'+sn+'.selectedIndex');
    eval('SizeKind = f.SizeKind_'+sn+'.options[myindex6].value');
    eval('SizeKindT = f.SizeKind_'+sn+'.options[myindex6].text');
    eval('var myindex1 = f.Product_'+sn+'.selectedIndex');
    eval('Product = f.Product_'+sn+'.options[myindex1].value');
    eval('var myindex2 = f.Kind_'+sn+'.selectedIndex');
    eval('Kind = f.Kind_'+sn+'.options[myindex2].value');
    eval('KindT = f.Kind_'+sn+'.options[myindex2].text');
    eval('var myindex3 = f.Quantity_'+sn+'.selectedIndex');
    eval('Quantity = f.Quantity_'+sn+'.options[myindex3].value');
    eval('QuantityR = f.Quantity_'+sn+'.options[myindex3].text');
    if(Product=='81'){//귀돌이 명함 편집사이즈 92*56으로 변경
        eval('f.w_1.value = parseInt(92)');
        eval('f.h_1.value = parseInt(56)');
    }else if(Product=='6'){
        eval('f.w_1.value = parseInt(90)');
        eval('f.h_1.value = parseInt(58)');
    }else if(Product=='23'){
        eval('f.w_1.value = parseInt(f.Width_'+sn+'.value)+6');
        eval('f.h_1.value = parseInt(f.Height_'+sn+'.value)+6');
    }else if(Product=='19'||Product=='20'||Product=='21'||Product=='22'||Product=='94'||Product=='79'){
        eval('f.w_1.value = parseInt(f.Width_'+sn+'.value)');
        eval('f.h_1.value = parseInt(f.Height_'+sn+'.value)');
        if(Kind=='448'||Kind=='450'||Kind=='481'||Kind=='482'||Kind=='498'||Kind=='512'||Kind=='1339'||Kind=='1451'||Kind=='451'||Kind=='452'||Kind=='483'||Kind=='484'||Kind=='975'||Kind=='976'||Kind=='1340'||Kind=='1452'){
            eval('f.w_1.value = parseInt(f.Width_'+sn+'.value)+6');
            eval('f.h_1.value = parseInt(f.Height_'+sn+'.value)+6');
        }
    }else if(Product=='105'||Product=='33'||Product=='35'||Product=='36'||Product=='38'||Product=='39'||Product=='40'||Product=='41'||Product=='42'||Product=='47'||Product=='45'||Product=='46'||Product=='93'||Product=='62'){
        if( (Kind=='739'||Kind=='1630') && Product=='40' ){
            eval('f.w_1.value = parseInt(f.Width_'+sn+'.value)+4');
            eval('f.h_1.value = parseInt(f.Height_'+sn+'.value)+4');
        }else{
            eval('f.w_1.value = parseInt(f.Width_'+sn+'.value)+3');
            eval('f.h_1.value = parseInt(f.Height_'+sn+'.value)+3');
        }
        if( Product=='45' ){
            eval('f.w_1.value = parseInt(f.Width_'+sn+'.value)+4');
            eval('f.h_1.value = parseInt(f.Height_'+sn+'.value)+4');
        }
    }else if(Product=='34'){
        eval('f.w_1.value = parseInt(f.Width_'+sn+'.value)+4');
        eval('f.h_1.value = parseInt(f.Height_'+sn+'.value)+4');
    }else if(Product=='43'||Product=='44'){
        eval('f.w_1.value = parseInt(f.Width_'+sn+'.value)+3');
        eval('f.h_1.value = parseInt(f.Height_'+sn+'.value)+6');
    }else if(Product=='56'||Product=='57'||Product=='58'||Product=='59'||Product=='60'||Product=='61'){
        eval('f.w_1.value = parseInt(f.Width_'+sn+'.value)');
        eval('f.h_1.value = parseInt(f.Height_'+sn+'.value)');
    }else if(Product=='50'||Product=='51'||Product=='52'||Product=='53'||Product=='54'||Product=='55'||Product=='86'||Product=='87'||Product=='88'||Product=='89'){//봉투 편집사이즈 안나오게
        eval('f.w_1.value = 0');
        eval('f.h_1.value = 0');
    }else if(Product=='48'){//봉투 사이즈수정
        eval('f.w_1.value = parseInt(f.Width_'+sn+'.value)+60');
        eval('f.h_1.value = parseInt(f.Height_'+sn+'.value)+268');
    }else if(Product=='101'){//봉투 사이즈수정
        eval('f.w_1.value = parseInt(f.Width_'+sn+'.value)+90');
        eval('f.h_1.value = parseInt(f.Height_'+sn+'.value)+298');
    }else if(Product=='102'){//봉투 사이즈수정
        eval('f.w_1.value = parseInt(f.Width_'+sn+'.value)+130');
        eval('f.h_1.value = parseInt(f.Height_'+sn+'.value)+323');
    }else if(Product=='49'){//봉투 사이즈수정
        eval('f.w_1.value = parseInt(f.Width_'+sn+'.value)+161');
        eval('f.h_1.value = parseInt(f.Height_'+sn+'.value)+14');
    }else if(Product=='103'){//봉투 사이즈수정
        eval('f.w_1.value = parseInt(f.Width_'+sn+'.value)+46');
        eval('f.h_1.value = parseInt(f.Height_'+sn+'.value)+129');
    }else if(Product=='104'){//봉투 사이즈수정
        eval('f.w_1.value = parseInt(f.Width_'+sn+'.value)+91');
        eval('f.h_1.value = parseInt(f.Height_'+sn+'.value)+149');
    }else if(Product=='112'){//봉투 사이즈수정
        eval('f.w_1.value = parseInt(f.Width_'+sn+'.value)+91');
        eval('f.h_1.value = parseInt(f.Height_'+sn+'.value)+144');
    }else if(Product=='113'){//봉투 사이즈수정
        eval('f.w_1.value = parseInt(f.Width_'+sn+'.value)+66');
        eval('f.h_1.value = parseInt(f.Height_'+sn+'.value)+134');
    }else if(Product=='114'){//봉투 사이즈수정
        eval('f.w_1.value = parseInt(f.Width_'+sn+'.value)+160');
        eval('f.h_1.value = parseInt(f.Height_'+sn+'.value)+393');
    }else{
        eval('f.w_1.value = parseInt(f.Width_'+sn+'.value)+2');
        eval('f.h_1.value = parseInt(f.Height_'+sn+'.value)+2');
    }
    //if(TodayPrint==true&&AfterWorkCheck==true&&SizeKindT=='규격'&&(Product==0||Product==1||Product==110||Product==2||Product==4||Product==5||Product==81||Product==7||(Product==19&&KindT.indexOf('비코팅')==-1)||Product==33))
    if(TodayPrint==true&&AfterWorkCheck==true&&(Product==0||Product==1||Product==2||Product==4||Product==5||Product==7||Product==120||(Product==19&&KindT.indexOf('비코팅')==-1&&KindT.indexOf('무코팅')==-1&&KindT.indexOf('도무송')==-1)||Product==33))
    {
        if((Product==0||Product==1||Product==110)&&QuantityR==500){ }
        else if(Product==0||Product==1)
        {
            alert('일반명함,고품격명함 오전판은 500매 주문만 가능합니다!');
            eval('f.TodayPrint_'+sn+'.checked = false');
        }
        if(Product==4&&QuantityR==300){ }
        else if(Product==4)
        {
            alert('고급지-300장명함 오전판은 300매 주문만 가능합니다!');
            eval('f.TodayPrint_'+sn+'.checked = false');
        }
        var today = new Date();
        var toHours = today.getHours();
        var toMinutes = today.getMinutes();
        var todayofweek = today.getDay();
        if((Product==5||Product==81||Product==7)&&KindT.indexOf('빌리')!=-1)
        //if((Product==5||Product==81)&&KindT.indexOf('빌리')!=-1&&toHours>10&&toHours<20)
        {
            alert('빌리지는 오전판 주문이 불가능합니다!');
            eval('f.TodayPrint_'+sn+'.checked = false');
        }
        else if((Product==5||Product==81||Product==7)&&QuantityR==200&&KindT.indexOf('탄트')==-1&&KindT.indexOf('스코')==-1&&KindT.indexOf('카멜')==-1&&KindT.indexOf('유포')==-1){ }
        else if((Product==5||Product==81||Product==7)&&(	(KindT.indexOf('탄트')!=-1	&&	KindT.indexOf('양면무늬')==-1)			||KindT.indexOf('스코')!=-1||KindT.indexOf('카멜')!=-1||KindT.indexOf('유포')!=-1))
        {
            alert('탄트지,스코트,카멜레온,유포지는 오전판이 안됩니다!');
            eval('f.TodayPrint_'+sn+'.checked = false');
        }
        else if((Product==5||Product==81||Product==7||Product==120)&&QuantityR!=200)
        {
            alert('고급지-200장명함, 고급지귀돌이명함 오전판은 200매 주문만 가능합니다!');
            eval('f.TodayPrint_'+sn+'.checked = false');
        }
        if(Product==19&&QuantityR==1000){ }
        else if(Product==19)
        {
            alert('일반스티커 오전판은 1000매 주문만 가능합니다!');
            eval('f.TodayPrint_'+sn+'.checked = false');
        }
        if(Product==33&&QuantityR==1&&(KindT.indexOf('64절')!=-1||KindT.indexOf('32절')!=-1||KindT.indexOf('16절')!=-1||KindT.indexOf('A6')!=-1||KindT.indexOf('A5')!=-1||KindT.indexOf('A4')!=-1)){ }
        //else if(Product==33&&KindT.indexOf('단면')==-1&&KindT.indexOf('64절')==-1&&KindT.indexOf('32절')==-1&&KindT.indexOf('16절')==-1&&KindT.indexOf('A6')==-1&&KindT.indexOf('A5')==-1&&KindT.indexOf('A4')==-1)
        //{
        //   alert('16절, A4 이하 단면만 오전판이 됩니다!');
        //   eval('f.TodayPrint_'+sn+'.checked = false');
        //}
        else if(Product==33)
        {
            alert('전단지 오전판은 1연 주문만 가능합니다!');
            eval('f.TodayPrint_'+sn+'.checked = false');
        }
    }
    else if(TodayPrint==true)
    {
        alert('당일판은 합판전단,스티커,코팅명함,고급지명함이며 후가공은 하실 수 없습니다. \n\n스코틀랜드,유포지,탄트지,카멜레온 고급지명함은 오전판이 안됩니다.\n\n확인하시고 주문하시길 바랍니다!');
        eval('f.TodayPrint_'+sn+'.checked = false');
    }
}
//-->

